<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Bereiche der Administrationskonsole </title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rconsole"></a>
<h2>Bereiche der Administrationskonsole </h2>

<p>Mit der Administrationskonsole k&ouml;nnen Sie Ressourcen, Anwendungen und Server erstellen und
verwalten sowie Produktnachrichten anzeigen. </p>

<p>Wenn Sie die Administrationskonsole anzeigen m&ouml;chten, m&uuml;ssen Sie sich vergewissern, dass der
Anwendungsserver f&uuml;r die Administrationskonsole ausgef&uuml;hrt wird. Geben Sie dann in einem Webbrowser den URL f&uuml;r die
Administrationskonsole ein. Geben Sie auf einer Anmeldeseite Ihre Benutzer-ID und, falls erforderlich, ein Kennwort ein.</p>

<p>Die Konsole setzt sich aus folgenden Bereichen zusammen, deren Gr&ouml;&szlig;e Sie wie gew&uuml;nscht anpassen k&ouml;nnen:</p>

<dl>
<dt>
<strong><a name="menu"></a>Task-Leiste</strong>
</dt>
<dd>Die Task-Leiste enth&auml;lt Optionen f&uuml;r die R&uuml;ckkehr zur Homepage der Konsole, das Speichern von
&Auml;nderungen, die Sie an den Administrationskonfigurationen vorgenommen haben, die Angabe von Konsolenvorgaben,
das Abmelden von der Konsole und den Zugriff auf Produktinformationen.

</dd>
<dt>
<strong><a name="tree"></a>Navigationsstruktur</strong>
</dt>
<dd>Die Navigationsstruktur auf der linken Seite der Konsole enth&auml;lt Links
zu Konsolseiten, auf
denen Sie Komponenten in einer Administrationszelle des WebSphere Application Server
erstellen und verwalten k&ouml;nnen.
<p>Klicken Sie auf das Pluszeichen (<strong>+</strong>) neben einem Ordner oder Element, um dessen Struktur
einzublenden. Klicken Sie auf das Minuszeichen (<strong>-</strong>) neben einem Ordner oder
Element, um dessen Struktur auszublenden.
Klicken Sie doppelt auf ein
Element in der Baumstruktur, um zwischen dem Status "Eingeblendet" und dem
Status "Ausgeblendet" hin- und herzuschalten.</p>

</dd>
<dt>
<strong><a name="workspace"></a>WorkSpace</strong>
</dt>
<dd>Der Arbeitsbereich auf der rechten Seite der Konsole enth&auml;lt Seiten, auf denen Sie
Konfigurationsobjekte, wie z. B. Server und Ressourcen, erstellen und verwalten k&ouml;nnen.
Klicken Sie in der Navigationsstruktur auf die entsprechenden Links, um die verschiedenen Typen konfigurierter
Objekte anzuzeigen. Klicken Sie im Arbeitsbereich auf konfigurierte Objekte, um deren Konfigurationen,
Laufzeitstatus und Optionen anzuzeigen. Klicken Sie in der Task-Leiste auf <strong>Home</strong>, um die Homepage des
Arbeitsbereichs anzuzeigen, auf der sich Links zur Verwendung des WebSphere Application Server
befinden. 

</dd>
<dt>
<strong><a name="status"></a>WebSphere-Status</strong>
</dt>
<dd>Im Bereich f&uuml;r die Statusnachrichten im unteren Bereich der Konsole werden Informationen zu den
vom WebSphere Application Server zur&uuml;ckgegebenen Nachrichten, zu Fehlern in der Administrationskonfiguration sowie zu
Laufzeitereignissen angezeigt. Klicken Sie auf <strong>Zur&uuml;ck</strong> oder <strong>Weiter</strong>, um zwischen der Anzeige
f&uuml;r Konfigurationsfehler und der Anzeige f&uuml;r Laufzeitereignisse hin- und herzuschalten.
<p>In den Einstellungen f&uuml;r die Vorgaben k&ouml;nnen Sie das Intervall zwischen den automatischen Aktualisierungen
&auml;ndern.</p>

</dd>
</dl>
<div>
<p>
<strong>Zugeh&ouml;rige Informationen</strong>
</p>
<a href="rcon_buttons.html">Kn&ouml;pfe in der Adminstrationskonsole</a>
<br>

<a href="rcon_pageusage.html">Funktionen auf den Seiten der Administrationskonsole</a>
<br>

<a href="ucon_rlogin.html">Einstellungen f&uuml;r Anmeldung</a>
<br>

<a href="ucon_rnavtree.html">Aktionen in der Navigationsstruktur der Administrationskonsole</a>
<br>

<a href="ucon_rpref.html">Einstellungen f&uuml;r Vorgaben</a>
<br>

<a href="ucon_rtaskbar.html">Aktionen in der Task-Leiste der Administrationskonsole</a>
<br>

<a href="ucon_rstatus.html">Einstellungen des WebSphere-Status </a>
<br>

</div>
</body>
</html>
