<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Aktionen in der Task-Leiste der Administrationskonsole</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rtaskbar"></a>
<h2>Aktionen in der Task-Leiste der Administrationskonsole</h2>

<p>Sie k&ouml;nnen &uuml;ber die Task-Leiste der Administrationskonsole zur Homepage der
Konsole zur&uuml;ckkehren, &Auml;nderungen an Administrationskonfigurationen speichern, Konsolenvorgaben
definieren, sich von der Konsole abmelden und auf Produktinformationen zugreifen.</p>

<p>Die Task-Leiste ist im oberen Abschnitt der Administrationskonsole von WebSphere Application Server
horizontal angeordnet.
Die Task-Leiste erm&ouml;glicht verschiedene Aktionen.</p>

<dl>
<dt>
<strong><a name="menu_workspace_home"></a>Home</strong>
</dt>
<dd>Zeigt die Homepage der Administrationskonsole im Arbeitsbereich an. Der Arbeitsbereich befindet
sich auf der rechten Seite der Konsole.
Die Homepage enth&auml;lt Links mit Informationen zur Verwendung von WebSphere Application Server.


</dd>
<dt>
<strong><a name="menu_save_changes"></a>Speichern</strong>
</dt>
<dd>Zeigt die Seite "Speichern" an, auf der Sie die in
der Administrationskonsole durchgef&uuml;hrte Arbeit speichern k&ouml;nnen.
<p>Die &Auml;nderungen, die Sie an der Administrationskonfiguration vorgenommen
haben, werden im Master-Repository gespeichert, das sich aus
.xml-Konfigurationsdateien zusammensetzt. Wenn Sie sehen m&ouml;chten, welche &Auml;nderungen gespeichert werden,
blenden Sie <strong>Ge&auml;nderte Eintr&auml;ge anzeigen</strong> ein. Sie
m&uuml;ssen Ihre Arbeit in regelm&auml;&szlig;igen Abst&auml;nden speichern, um sicherzustellen, dass
&Auml;nderungen, die Sie vorgenommen haben, nicht versehentlich verloren gehen.</p>

</dd>
<dt>
<strong><a name="menu_preferences"></a>Vorgaben</strong>
</dt>
<dd>Zeigt die Seite "Vorgaben" an, auf der Sie angeben k&ouml;nnen, ob die Seite Arbeitsbereichsseite der
Administrationskonsole nach &Auml;nderungen automatisch aktualisiert, Best&auml;tigungsdialoge angezeigt und der
Standardbereich als Knoten der Administrationskonsole verwendet werden sollen. 

</dd>
<dt>
<strong><a name="menu_logout"></a>Abmelden</strong>
</dt>
<dd>F&uuml;hrt die Abmeldung von der Sitzung der Administrationskonsole durch
und zeigt die Seite "Anmelden" an. Wenn Sie die Administrationskonfiguration seit dem letzten Speichern der
Konfiguration im Master-Repository ge&auml;ndert haben, wird die Seite "Speichern" angezeigt, bevor die
Seite "Anmelden" wieder erscheint. Klicken Sie auf <strong>Speichern</strong>, um die &Auml;nderungen am Master-Repository zu
speichern, auf <strong>L&ouml;schen</strong>, um die Sitzung ohne Speichern der &Auml;nderungen zu beenden, oder auf <strong>Abmelden</strong>,
um die Sitzung zu verlassen, ohne die &Auml;nderungen zu speichern. Im letzten Fall haben Sie die M&ouml;glichkeit, die
&Auml;nderungen wiederherzustellen, wenn Sie in die Konsole zur&uuml;ckkehren. 

</dd>
<dt>
<strong><a name="menu_help"></a>Hilfe</strong>
</dt>
<dd>&Ouml;ffnet einen neuen Webbrowser f&uuml;r die Onlinehilfe von WebSphere Application Server.


</dd>
<dt>
<strong><a name="menu_help"></a>Feld- und Seitenbeschreibungen anzeigen/verdecken </strong>
</dt>
<dd>Mit dieser Option k&ouml;nnen Sie angeben, ob Informationen zu
Konsolseiten und -felder auf der Seite angezeigt werden. Mit den Symbolen auf der
rechten Seite der Task-Leiste k&ouml;nnen Sie hin- und herschalten.

</dd>
</dl>
<div>
<p>
<strong>Zugeh&ouml;rige Informationen</strong>
</p>
<a href="ucon_rpref.html">Einstellungen f&uuml;r Vorgaben</a>
<br>

<a href="ucon_rlogin.html">Einstellungen f&uuml;r Anmeldung</a>
<br>

</div>
</body>
</html>
