<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Web Services: Sicherheitsbindungen des Clients </title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_wsclientbind"></a>
<h2>
<img alt="[Fixpack 5.0.2 und h&ouml;her]" src="v502.gif" border="0">Web Services: Sicherheitsbindungen des Clients </h2>

<p>Verwenden Sie diese Seite, um eine Liste der clientseitigen Bindungskonfigurationen f&uuml;r
die Web-Services-Sicherheit anzuzeigen. Diese Bindungen werden verwendet, wenn ein Webservice
ein Client eines anderen Webservice ist. </p>

<p>Gehen Sie zum Anzeigen dieser Seite der Administrationskonsole wie folgt vor:<ol>

<li>Klicken Sie auf <strong>Enterprise-Anwendungen &gt;</strong><em>Name_der_Anwendung</em>.</li>

<li>Klicken Sie unter
"Zugeh&ouml;rige Elemente" auf <strong>Webmodule &gt; </strong><em>Name_der_URI-Datei</em><strong> &gt;
Web Services: Sicherheitsbindungen des Clients</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_port"></a>Port</strong>
</dt>
<dd>Der Port, der zum Senden und Empfangen von Nachrichten eines Servers verwendet wird. </dd>
<dt>
<strong><a name="sec_websvc"></a>Webservice</strong>
</dt>
<dd>Der Name des Webservice. </dd>
<dt>
<strong><a name="sec_req"></a>Bindung f&uuml;r Anforderungssender
</strong>
</dt>
<dd>Die Bindungskonfiguration, die zum Senden von Anforderungsnachrichten an den Anforderungsempf&auml;nger
verwendet wird. 
<p>Klicken Sie auf <strong>Bearbeiten</strong>, um die Signaturdaten, die Verschl&uuml;sselungsdaten und die Anmeldebindungen f&uuml;r
den Anforderungssender zu konfigurieren und eine Liste der Key Locator im Keystore anzuzeigen.</p>

<p>Die Bindungsdaten f&uuml;r den Anforderungssender, die f&uuml;r den Client angegeben werden, m&uuml;ssen mit den Bindungsdaten
f&uuml;r den Anforderungsempf&auml;nger, die f&uuml;r den Server angegeben werden, &uuml;bereinstimmen. </p>

</dd>
<dt>
<strong><a name="sec_resp"></a>Bindung f&uuml;r Antwortempf&auml;nger
</strong>
</dt>
<dd>Die Bindungskonfiguration, die f&uuml;r den Empfang von Antwortnachrichten vom Antwortsender verwendet wird.

<p>Klicken Sie auf <strong>Bearbeiten</strong>, um die Signatur- und Verschl&uuml;sselungsdaten zu konfigurieren
und eine Liste der Trust Anchor, tempor&auml;ren Zertifikate im Collection Certificate Store und der
Key-Locator-Objekte f&uuml;r den Antwortempf&auml;nger anzuzeigen.</p>

<p>Die Bindungsdaten f&uuml;r den Antwortempf&auml;nger, die f&uuml;r den Client angegeben werden, m&uuml;ssen mit den Bindungsdaten
f&uuml;r den Antwortsender, die f&uuml;r den Server angegeben werden, &uuml;bereinstimmen. </p>

</dd>
<dt>
<strong><a name="sec_httpbasicauth"></a>HTTP-Basisauthentifizierung</strong>
</dt>
<dd>Die Benutzer-ID/Kennwort-Kombination, die bei der HTTP-Basisauthentifizierung auf Transportebene f&uuml;r diesen Port
zu verwenden ist.
Sie k&ouml;nnen die Authentifizierungssicherheit auf Transportebene unabh&auml;ngig von der Sicherheit auf Nachrichtenebene aktivieren.

<p>Klicken Sie auf <strong>Bearbeiten</strong>, um die ID und das Kennwort f&uuml;r die Basisauthentifizierung
auf Transportebene zu konfigurieren.
</p>

</dd>
<dt>
<strong><a name="sec_httpsslconfig"></a>HTTP-SSL-Konfiguration</strong>
</dt>
<dd>Aktiviert und konfiguriert die SSL-Sicherheit auf Transportebene f&uuml;r diesen Port.
Sie k&ouml;nnen die SSL-Sicherheit auf Transportebene unabh&auml;ngig von der Sicherheit auf Nachrichtenebene aktivieren.

<p>Klicken Sie auf <strong>Bearbeiten</strong>, um die Einstellungen f&uuml;r die HTTP-SSL-Konfiguration auf Transportebene f&uuml;r diesen Port festzulegen.
</p>

</dd>
</dl>
<div>
<p>
<strong>Zugeh&ouml;rige Informationen</strong>
</p>
<a href="uwbs_reqsend.html">Bindung f&uuml;r Anforderungssender</a>
<br>

<a href="uwbs_resprecvr.html">Bindungen f&uuml;r Antwortempf&auml;nger</a>
<br>

<a href="uwbs_signinfo.html">Signaturdaten</a>
<br>

<a href="uwbs_encrypt.html">Verschl&uuml;sselungsdaten</a>
<br>

<a href="uwbs_keyl.html">Key Locator</a>
<br>

<a href="uwbs_loginbnd.html">Konfigurationseinstellungen f&uuml;r die Anmeldebindungen</a>
<br>

</div>
</body>
</html>
