<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>nonce &#12398;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12398;&#27083;&#25104;</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="twbs_confnoncecell"></a>
<h2>
<img alt="[&#12522;&#12522;&#12540;&#12473; 5.1 &#20197;&#38477;]" src="v51.gif" border="0">nonce &#12398;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12398;&#27083;&#25104;</h2>


<div>  &#12371;&#12398;&#12479;&#12473;&#12463;&#12391;&#12399;&#12289;WebSphere Application Server
&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12434;&#20351;&#29992;&#12375;&#12390;&#12289;nonce &#12434;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12395;&#27083;&#25104;&#12377;&#12427;&#26041;&#27861;&#12395;&#12388;&#12356;&#12390;&#35500;&#26126;&#12375;&#12414;&#12377;&#12290;
nonce &#12399;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12289;&#12362;&#12424;&#12403;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391;&#27083;&#25104;&#12391;&#12365;&#12414;&#12377;&#12290;
&#12383;&#12384;&#12375;&#12289;&#20778;&#20808;&#38918;&#20301;&#12395;&#12388;&#12356;&#12390;&#32771;&#24942;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#27425;&#12398;&#12522;&#12473;&#12488;&#12399;&#12289;&#20778;&#20808;&#38918;&#20301;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;<ol>

<li>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;</li>

<li>&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;</li>

<li>&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;</li>

</ol>nonce &#12434;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12362;&#12424;&#12403;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12395;&#27083;&#25104;&#12377;&#12427;&#22580;&#21512;&#12395;&#12399;&#12289;
&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12364;&#12289;
&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12424;&#12426;&#20778;&#20808;&#12375;&#12414;&#12377;&#12290;
&#21516;&#27096;&#12395;&#12289;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12524;&#12505;&#12523;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12399;&#12289;
&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12362;&#12424;&#12403;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12424;&#12426;&#12418;&#20778;&#20808;&#12375;&#12414;&#12377;&#12290;
WebSphere Application Server Network Deployment &#12398;
&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#12289;&#12300;<strong>Nonce Maximum Age</strong>&#12301;&#12289;
&#12362;&#12424;&#12403;&#12300;<strong>Nonce Clock Skew</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;
nonce &#12434;&#21177;&#26524;&#30340;&#12395;&#20351;&#29992;&#12377;&#12427;&#12383;&#12417;&#12395;&#24517;&#38920;&#12391;&#12377;&#12290;
&#12383;&#12384;&#12375;&#12289;&#12371;&#12428;&#12425;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12391;&#12377;&#12290;
. &#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391; nonce &#12434;&#27083;&#25104;&#12377;&#12427;&#12395;&#12399;&#12289;&#20197;&#19979;&#12398;&#12473;&#12486;&#12483;&#12503;&#12434;&#23455;&#34892;&#12375;&#12414;&#12377;&#12290;
</div>

<div>
<p class="sectiontitle">&#12371;&#12398;&#12479;&#12473;&#12463;&#12398;&#12473;&#12486;&#12483;&#12503;</p>
<ol>

<li>Web &#12502;&#12521;&#12454;&#12470;&#12540;&#12391; http://localhost:9090/admin (&#12509;&#12540;&#12488;&#30058;&#21495;&#12434;&#22793;&#26356;&#12375;&#12390;&#12356;&#12394;&#12356;&#22580;&#21512;) &#12392;&#20837;&#21147;&#12375;&#12390;&#12289;
&#31649;&#29702;&#12467;&#12531;&#12477;&#12540;&#12523;&#12395;&#25509;&#32154;&#12375;&#12414;&#12377;&#12290;</li>

<li>&#12300;<strong>&#12469;&#12540;&#12496;&#12540;</strong>&#12301;&gt;&#12300;<strong>&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12469;&#12540;&#12496;&#12540;</strong>&#12301;&gt;&#12300;<strong>server1</strong>&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
</li>

<li>&#12300;&#36861;&#21152;&#12503;&#12525;&#12497;&#12486;&#12451;&#12540;&#12301;&#12398;&#19979;&#12398;&#12300;<strong>Web Services: Default Bindings for Web Services Security</strong>&#12301;&#12434;&#12463;&#12522;&#12483;&#12463;&#12375;&#12414;&#12377;&#12290;
</li>

<li>&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20516; (&#31186;) &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
<div>&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12399;&#12289;
nonce &#12364;&#12461;&#12515;&#12483;&#12471;&#12517;&#12363;&#12425;&#28040;&#21435;&#12373;&#12428;&#12427;&#12414;&#12391;&#20445;&#25345;&#12373;&#12428;&#12427;&#26399;&#38291;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#26368;&#20302;&#38480; 300 &#31186;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391; 600 &#31186;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12391;&#12377;&#12364;&#12289;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
</div>
</li>

<li>&#12300;<strong>Nonce Maximum Age</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20516; (&#31186;) &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
<div>&#12300;<strong>Nonce Maximum Age</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12399;&#12289;nonce &#12364;&#26377;&#21177;&#12391;&#12354;&#12427;&#26399;&#38291;&#12434;&#31034;&#12375;&#12390;&#12356;&#12414;&#12377;&#12290;
&#26368;&#20302;&#38480; 300 &#31186;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;&#12383;&#12384;&#12375;&#12289;
&#21069;&#12398;&#12473;&#12486;&#12483;&#12503;&#12391;&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;
&#20197;&#19978;&#12398;&#31186;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391; 600 &#31186;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
 WebSphere Application Server Network Deployment &#29872;&#22659; &#12362;&#12424;&#12403;
WebSphere Application Server for z/OS &#29872;&#22659;&#12391;&#12289;&#12300;<strong>Nonce Cache Timeout</strong>&#12301;
&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12391;&#20516;&#12434;&#25351;&#23450;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;
&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391;&#25351;&#23450;&#12375;&#12383;&#20197;&#19978;&#12398;&#20516;&#12434;
&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12391;&#12377;&#12364;&#12289;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
</div>
</li>

<li>&#12300;<strong>Nonce Clock Skew</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#20516; (&#31186;) &#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;
<div>&#12300;<strong>Nonce Clock Skew</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#20516;&#12399;&#12289;
&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#21463;&#20449;&#20596;&#12364;&#20516;&#12398;&#39854;&#24230;&#12398;&#26908;&#26619;&#12395;&#35201;&#12377;&#12427;&#26178;&#38291; (&#31186;) &#12434;&#31034;&#12375;&#12414;&#12377;&#12290;
&#12371;&#12398;&#20516;&#12434;&#35373;&#23450;&#12377;&#12427;&#22580;&#21512;&#12399;&#12289;&#20197;&#19979;&#12398;&#24773;&#22577;&#12395;&#27880;&#24847;&#12375;&#12390;&#12367;&#12384;&#12373;&#12356;&#12290;
<ul>

<li>&#12463;&#12525;&#12483;&#12463;&#12364;&#38750;&#21516;&#26399;&#12398;&#22580;&#21512;&#12289;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#36865;&#20449;&#20596;&#12392;&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#21463;&#20449;&#20596;&#12392;&#12398;&#38291;&#12398;&#26178;&#24046;&#12290;
</li>

<li>&#12513;&#12483;&#12475;&#12540;&#12472;&#12398;&#26263;&#21495;&#21270;&#12362;&#12424;&#12403;&#20253;&#36865;&#12395;&#35201;&#12377;&#12427;&#26178;&#38291;&#12290;</li>

<li>&#12493;&#12483;&#12488;&#12527;&#12540;&#12463;&#36667;&#36659;&#12398;&#36890;&#36942;&#12395;&#35201;&#12377;&#12427;&#26178;&#38291;&#12290;</li>

</ul>&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#12399;&#12289;&#26368;&#20302;&#38480; 0 &#31186;&#12434;&#25351;&#23450;&#12377;&#12427;&#24517;&#35201;&#12364;&#12354;&#12426;&#12414;&#12377;&#12290;
&#12383;&#12384;&#12375;&#12289;&#26368;&#22823;&#20516;&#12392;&#12375;&#12390;&#12289;&#12300;<strong>Nonce Maximum Age</strong>&#12301;&#12501;&#12451;&#12540;&#12523;&#12489;&#12395;&#25351;&#23450;&#12375;&#12383;&#20197;&#19978;&#12398;&#31186;&#25968;&#12434;&#25351;&#23450;&#12377;&#12427;&#12371;&#12392;&#12399;&#12391;&#12365;&#12414;&#12379;&#12435;&#12290;
&#20516;&#12434;&#25351;&#23450;&#12375;&#12394;&#12356;&#22580;&#21512;&#12395;&#12399;&#12289;&#12487;&#12501;&#12457;&#12523;&#12488;&#12391; 0 &#31186;&#12395;&#12394;&#12426;&#12414;&#12377;&#12290;
&#12371;&#12398;&#12501;&#12451;&#12540;&#12523;&#12489;&#12399;&#12289;&#12469;&#12540;&#12496;&#12540;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#12458;&#12503;&#12471;&#12519;&#12490;&#12523;&#12391;&#12377;&#12364;&#12289;&#12475;&#12523;&#12539;&#12524;&#12505;&#12523;&#12391;&#12399;&#24517;&#38920;&#12391;&#12377;&#12290;
</div>

</li>

<li>&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#22987;&#21205;&#12375;&#12414;&#12377;&#12290;<div>&#12300;<strong>Nonce Cache Timeout</strong>&#12301;&#20516;&#12398;&#22793;&#26356;&#24460;&#12395;&#12469;&#12540;&#12496;&#12540;&#12434;&#20877;&#22987;&#21205;&#12375;&#12394;&#12356;&#12392;&#12289;
&#12469;&#12540;&#12496;&#12540;&#12399;&#22793;&#26356;&#12434;&#35469;&#35672;&#12375;&#12414;&#12379;&#12435;&#12290;</div>
</li>

</ol>
</div>

</body>
</html>
