<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Services Web : Collection de liaisons de s&eacute;curit&eacute; du serveur</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_wsservrbind"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Services Web : Collection de liaisons de s&eacute;curit&eacute; du serveur</h2>

<p>Cette page permet d'afficher une liste des configurations de liaison
au niveau serveur pour la s&eacute;curit&eacute; des services Web.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Applications d'entreprise &gt; </strong><em>nom_application</em>.</li>

<li>Dans la section Articles li&eacute;s, cliquez sur <strong>Module
Web &gt; </strong><em>nom_fichier_URI</em><strong>&gt; Services Web : Liaisons de s&eacute;curit&eacute; du serveur</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_port"></a>Port</strong>
</dt>
<dd>Indique le port de r&eacute;ception des messages envoy&eacute;s par
l'&eacute;metteur de la demande</dd>
<dt>
<strong><a name="sec_websvc"></a>Service Web</strong>
</dt>
<dd>Indique le nom du service Web.</dd>
<dt>
<strong><a name="sec_reqrec"></a>Liaison de r&eacute;cepteur de demande</strong>
</dt>
<dd>Indique la configuration de liaison utilis&eacute;e pour
recevoir les messages de demande envoy&eacute;es par l'&eacute;metteur de la
demande.
<p>Cliquez sur <strong>Edition</strong> pour configurer les informations de
signature et de chiffrement et visualiser une liste des ancres de
s&eacute;curisation, des certificats interm&eacute;diaires dans le magasin de
certificats de collection, des localisateurs de cl&eacute;, des &eacute;valuateurs d'ID
dignes de confiance et des mappages de connexion.</p>

<p>Les informations de liaison (pour le r&eacute;cepteur de la demande) indiqu&eacute;es pour
le serveur doivent correspondre aux informations de liaison (pour l'&eacute;metteur de la
demande) indiqu&eacute;es pour le client.</p>

</dd>
<dt>
<strong><a name="sec_respsend"></a>Liaison d'&eacute;metteur de r&eacute;ponse</strong>
</dt>
<dd>Indique la configuration de liaison utilis&eacute;e pour
envoyer les messages de demande au r&eacute;cepteur de la r&eacute;ponse.
<p>Cliquez sur <strong>Edition</strong> pour configurer les informations de connexion
et de chiffrement et afficher une liste des pointeurs de cl&eacute; pour le
r&eacute;cepteur de la r&eacute;ponse.</p>

<p>Les informations de liaison (pour l'&eacute;metteur de la demande) indiqu&eacute;es pour
le serveur doivent correspondre aux informations de liaison (pour le r&eacute;cepteur de la
demande) indiqu&eacute;es pour le client.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_reqrecvr.html">Collection de liaisons de r&eacute;cepteur de demande</a>
<br>

<a href="uwbs_respsend.html">Collection de liaisons de r&eacute;cepteur de r&eacute;ponse</a>
<br>

</div>
</body>
</html>
