<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection des adresses de cl&eacute;s</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_keyl"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Collection des adresses de cl&eacute;s</h2>

<p>Cette page permet de visualiser la liste des adresses de
cl&eacute;s disponibles. Les adresses de cl&eacute;s identifient les cl&eacute;s
n&eacute;cessaires &agrave; la signature num&eacute;rique et au chiffrement. Une adresse de cl&eacute;s
doit impl&eacute;menter l'interface com.ibm.wsspi.wssecurity.config.KeyLocator. Les deux impl&eacute;mentations par d&eacute;faut sont :
com.ibm.wsspi.wssecurity.config.WSldKeyStoreMapKeyLocator et
com.ibm.wsspi.wssecurity.config.KeyStoreKeyLocator.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Serveurs &gt; Serveurs d'applications &gt; </strong><em>nom_serveur</em>.</li>

<li>Dans la
section Propri&eacute;t&eacute;s suppl&eacute;mentaires, cliquez sur <strong>Services Web :
Liaisons par d&eacute;faut pour la s&eacute;curit&eacute; des services Web &gt;
Adresse de cl&eacute;s</strong>.</li>

<li>Cliquez sur <strong>Nouveau</strong> pour cr&eacute;er une adresse de cl&eacute;s. Cliquez sur <strong>Supprimer</strong> pour supprimer une adresse de
cl&eacute;s.</li>

</ol>
</p>

<p></p>

<p></p>

<p>A partir de ce panneau, suivez la proc&eacute;dure ci-apr&egrave;s.<ol>

<li>Indiquez un nom d'adresse de cl&eacute;s et un nom de classe d'adresse de cl&eacute;s dans le panneau</li>

<li>Sauvegardez vos modifications en cliquant sur <strong>Sauvegarder</strong> dans la partie sup&eacute;rieure de
la console d'administration. Lorsque vous cliquez sur <strong>Sauvegarder</strong>, vous revenez au panneau
d'accueil de la console d'administration. </li>

<li>Apr&egrave;s sauvegarde, revenez au panneau <strong>Adresses de cl&eacute;s</strong> pour mettre &agrave; jour l'ex&eacute;cution de la s&eacute;curit&eacute; des
services Web avec les informations de liaison par d&eacute;faut figurant
dans le fichier <samp>ws_security.xml</samp>. </li>

<li>Pour mettre &agrave; jour
l'ex&eacute;cution de la s&eacute;curit&eacute; des services Web, cliquez sur <strong>Mettre &agrave;
jour l'ex&eacute;cution</strong>.
Lorsque vous cliquez sur <strong>Mettre &agrave; jour l'ex&eacute;cution</strong>, les modifications de configuration apport&eacute;es aux autres services Web sont &eacute;galement mis &agrave; jour dans l'environnement d'ex&eacute;cution de s&eacute;curit&eacute; des services Web.</li>

<li>Lorsque vous d&eacute;finissez des adresses de cl&eacute;s, cliquez sur le
nom de l'adresse de cl&eacute;s pour d&eacute;finir des propri&eacute;t&eacute;s et des cl&eacute;s dans
<strong>Propri&eacute;t&eacute;s suppl&eacute;mentaires</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_keylname"></a>Nom
de l'adresse de cl&eacute;s</strong>
</dt>
<dd>Indique le nom unique de
l'adresse de cl&eacute;s.</dd>
<dt>
<strong><a name="sec_keylclass"></a>Nom
de la classe de l'adresse de cl&eacute;s </strong>
</dt>
<dd>Indique le
nom de la classe de l'adresse de cl&eacute;s dans le
fichier du magasin de cl&eacute;s.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_keyln.html">Param&egrave;tres de configuration des adresses de cl&eacute;</a>
<br>

</div>
</body>
</html>
