<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Services Web : Collection de liaisons de s&eacute;curit&eacute; du client</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_wsclientbind"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Services Web : Collection de liaisons de s&eacute;curit&eacute; du client</h2>

<p>Cette page permet de visualiser une liste de
configurations de liaisons c&ocirc;t&eacute; client pour la s&eacute;curit&eacute; des services
Web. Ces liaisons
sont utilis&eacute;es lorsqu'un service Web est un client d'un autre service Web.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Applications d'entreprise &gt; </strong><em>nom_application</em>.</li>

<li>Dans la
section Articles li&eacute;s, cliquez sur <strong>Module Web &gt;
</strong><em>nom_fichier_URI</em><strong> &gt; Services Web : Liaisons de s&eacute;curit&eacute; du client</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_port"></a>Port</strong>
</dt>
<dd>Indique le port utilis&eacute; pour envoyer et recevoir des messages &agrave;
partir d'un serveur.</dd>
<dt>
<strong><a name="sec_websvc"></a>Service Web</strong>
</dt>
<dd>Indique le nom du service Web.</dd>
<dt>
<strong><a name="sec_req"></a>Liaison d'&eacute;metteur de demande</strong>
</dt>
<dd>Indique la configuration de liaison utilis&eacute;e pour envoyer les
messages de demande au destinataire de la demande.
<p>Cliquez sur <strong>Editer</strong> pour configurer les informations de
signature et de chiffrement, ainsi que les liaisons de connexion pour
l'&eacute;metteur de la demande, et visualiser une liste des localisateurs
de cl&eacute; dans le magasin de cl&eacute;s.</p>

<p>Les informations de liaison de l'&eacute;metteur de la demande indiqu&eacute;es pour
le client doivent correspondre aux informations de liaison du r&eacute;cepteur de
la demande indiqu&eacute;es pour le serveur.</p>

</dd>
<dt>
<strong><a name="sec_resp"></a>Liaison de r&eacute;cepteur de r&eacute;ponse</strong>
</dt>
<dd>Indique la configuration de liaison utilis&eacute;e pour recevoir les
messages de r&eacute;ponse envoy&eacute;s par l'&eacute;metteur de la r&eacute;ponse.
<p>Cliquez sur <strong>Editer</strong> pour configurer les informations de chiffrement
et de signature et pour afficher une liste de points d'ancrage dignes de confiance,
des certificats interm&eacute;diaires se trouvant dans le magasin de certificats de collection
et les objets d'adresse de cl&eacute; pour le r&eacute;cepteur de la r&eacute;ponse.</p>

<p>Les informations de liaison du r&eacute;cepteur de la demande indiqu&eacute;es pour
le client doivent correspondre aux informations de liaison de l'&eacute;metteur de
la demande indiqu&eacute;es pour le serveur.</p>

</dd>
<dt>
<strong><a name="sec_httpbasicauth"></a>Authentification HTTP de base </strong>
</dt>
<dd>Indique l'ID utilisateur et le mot de passe pour ce port avec une
authentification HTTP de base au niveau du transport. Vous pouvez activer la s&eacute;curit&eacute; d'authentification au niveau du
transport ind&eacute;pendamment de celle au niveau des messages.
<p>Cliquez sur <strong>Editer</strong> pour configurer l'ID et le mot de passe
d'authentification de base pour l'authentification au niveau du
transport.</p>

</dd>
<dt>
<strong><a name="sec_httpsslconfig"></a>Configuration SSL HTTP</strong>
</dt>
<dd>Active et d&eacute;sactive la s&eacute;curit&eacute; SSL au niveau du transport pour ce port.
Vous pouvez activer la s&eacute;curit&eacute; SSL au niveau du transport ind&eacute;pendamment de la s&eacute;curit&eacute;
au niveau des messages.
<p>Cliquez sur <strong>Editer</strong> pour sp&eacute;cifier les param&egrave;tres pour la
configuration SSL HTTP au niveau du transport de ce port.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_reqsend.html">Collection de liaisons d'&eacute;metteur de demande</a>
<br>

<a href="uwbs_resprecvr.html">Collection de liaisons de r&eacute;cepteur de r&eacute;ponse</a>
<br>

<a href="uwbs_signinfo.html">Collection d'informations de signature</a>
<br>

<a href="uwbs_encrypt.html">Collection des informations de chiffrement</a>
<br>

<a href="uwbs_keyl.html">Collection d'adresses de cl&eacute;</a>
<br>

<a href="uwbs_loginbnd.html">Param&egrave;tres de configuration des liaisons de connexion</a>
<br>

</div>
</body>
</html>
