<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de magasins de certificats de collection</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_colcertst"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Collection de magasins de certificats de collection</h2>

<p>Cette page permet de visualiser une liste des magasins de
certificats non s&eacute;curis&eacute;s contenant des fichiers de certificat
interm&eacute;diaires en attente de validation. La validation peut consister &agrave;
v&eacute;rifier si le certificat se trouve dans une liste de retrait de certificats
(CRL), s'il n'est pas arriv&eacute; &agrave; expiration et s'il a &eacute;t&eacute; &eacute;mis par un
signataire s&eacute;curis&eacute;.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Serveurs &gt; Serveurs d'applications </strong><em> nom_serveur</em>. </li>

<li>Sous <strong>Articles li&eacute;s</strong>, cliquez sur <strong>Services Web : Liaisons par d&eacute;faut pour la s&eacute;curit&eacute;
des services Web &gt; Magasin de certificats de collection</strong>.</li>

<li>Cliquez sur <strong>Nouveau</strong> pour sp&eacute;cifier un nom de magasin et un
fournisseur pour un nouveau magasin de certificats.</li>

<li>Cliquez sur <strong>Supprimer</strong> pour supprimer un magasin de
certificats de collection.</li>

</ol>
</p>

<p>A partir de ce panneau, suivez la proc&eacute;dure ci-apr&egrave;s.<ol>

<li>D&eacute;finissez un nom de magasin de certificats et un fournisseur de magasin
de certificats.</li>

<li>Sauvegardez vos modifications en cliquant sur <strong>Sauvegarder</strong> dans la partie sup&eacute;rieure de
la console d'administration. Lorsque vous cliquez sur <strong>Sauvegarder</strong>, vous revenez au panneau
d'accueil de la console d'administration. </li>

<li>Retournez au panneau des magasins de certificats et cliquez sur l'option permettant de mettre
&agrave; jour l'environnement d'ex&eacute;cution <strong></strong>pour mettre &agrave; jour l'environnement d'ex&eacute;cution de s&eacute;curit&eacute;
des services Web avec les informations de liaison par d&eacute;faut qui se trouvent dans le fichier <samp>ws_security.xml</samp>.</li>

</ol>
</p>

<p>
<b>Important: </b>Lorsque vous cliquez sur <strong>Mettre &agrave; jour l'ex&eacute;cution</strong>, les modifications de configuration apport&eacute;es aux autres services Web sont &eacute;galement mis &agrave; jour dans l'environnement d'ex&eacute;cution de s&eacute;curit&eacute; des services Web.</p>

<dl>
<dt>
<strong><a name="sec_colcertname"></a>Nom du magasin de certificats</strong>
</dt>
<dd>Indique le nom du magasin de certificats.</dd>
<dt>
<strong><a name="sec_colcertprv"></a>Fournisseur du magasin de certificats </strong>
</dt>
<dd>Indique le fournisseur du magasin de certificats.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_colcertstn.html">Param&egrave;tres de configuration des magasins de certificats de configuration</a>
<br>

<a href="uwbs_x509cert.html">Collection de certificats X.509</a>
<br>

<a href="uwbs_x509certn.html">Param&egrave;tres de configuration des certificats X.509</a>
<br>

</div>
</body>
</html>
