<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de m&oacute;dulo Web</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uweb_rwebmc"></a>
<h2>Valores de m&oacute;dulo Web</h2>

<p> Utilice esta p&aacute;gina para configurar los valores de m&oacute;dulos Web. </p>

<p>Para acceder a esta p&aacute;gina, recorra la siguiente v&iacute;a de acceso en la consola administrativa:</p>

<pre>
<strong>Aplicaciones</strong> &gt; <strong>Aplicaci&oacute;n de empresa</strong> &gt;
<em>instancia_aplicaci&oacute;n</em> &gt; <strong>M&oacute;dulo Web</strong>
</pre>

<dl>
<dt>
<strong><a name="rwebm_uri"></a>URI</strong>
</dt>
<dd>Especifica un URI que, cuando resuelve con respecto al URL de la aplicaci&oacute;n, especifica la
ubicaci&oacute;n del contenido del archivador de m&oacute;dulos de un sistema de archivos.
Si el m&oacute;dulo se
empaqueta como parte de una aplicaci&oacute;n desplegada o de un archivo EAR (Enterprise Archive), el URI debe coincidir con el URI de un
URI ModuleRef en el descriptor de despliegue de la aplicaci&oacute;n.  </dd>
<dt>
<strong><a name="rwebm_name"></a>Nombre</strong>
</dt>
<dd>Especifica el nombre de visualizaci&oacute;n exclusivo del m&oacute;dulo.</dd>
<dt>
<strong><a name="rweb_altdd"></a>ADD alternativo</strong>
</dt>
<dd>Especifica el nombre de archivo de un archivo descriptor de despliegue alternativo que se debe utilizar en lugar del archivo descriptor de despliegue original en el archivo JAR
del m&oacute;dulo.
<p> Este archivo es la versi&oacute;n <em>postensamblaje</em> del archivo descriptor de despliegue. Puede editar el archivo descriptor de despliegue original para que resuelva las dependencias y la informaci&oacute;n de seguridad.  Si especifica el uso del descriptor de despliegue alternativo mantendr&aacute; intacto el archivo descriptor de despliegue.</p>

<p>El valor de la propiedad <em>ADD alternativo</em> debe ser el nombre completo de la v&iacute;a de acceso del archivo descriptor de despliegue relativo al directorio ra&iacute;z del m&oacute;dulo.
 Por convenio, el archivo se encuentra en el directorio <samp>ALT-INF</samp>. Si no se especifica esta propiedad, el archivo descriptor de despliegue se lee desde el archivo JAR del m&oacute;dulo.</p>

</dd>
<dt>
<strong><a name="rwebm_wt"></a>Peso inicial</strong>
</dt>
<dd>Especifica el orden en que se inician los m&oacute;dulos.  Los m&oacute;dulos de menor peso se inician antes que los de m&aacute;s peso.</dd>
<dt>
<strong><a name="rwebm_webinf"></a>Preferencia de clases WEB-INF</strong>
</dt>
<dd>
Especifica las clases que deben cargarse en WEB-INF antes que ninguna
otra. Se recomienda implantar el cargador de clases de aplicaciones para que las clases y los recursos empaquetados en el archivo WAR se carguen antes que las clases y los recursos que residan en los archivos JAR de la biblioteca de contenedores.</dd>
<dt>
<strong><a name="rwebm_init"></a>Estado inicial</strong>
</dt>
<dd>Especifica el estado por omisi&oacute;n de esta aplicaci&oacute;n al arrancar el servidor. </dd>
</dl>
</body>
</html>
