<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de entrada de datos de autenticaci&oacute;n del conector Java 2</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="usecj2cauthdata"></a>
<h2>Valores de entrada de datos de autenticaci&oacute;n del conector Java 2</h2>

<p>Utilice esta p&aacute;gina como punto principal para que los administradores definan los datos de autenticaci&oacute;n, que incluyen las contrase&ntilde;as e identidades de usuario. Estos datos
pueden hacer referencia a entradas de datos de autenticaci&oacute;n de adaptadores de recursos,
or&iacute;genes de datos y otras configuraciones que requieran datos de autenticaci&oacute;n mediante un
alias.</p>

<p>Puede visualizar esta p&aacute;gina directamente desde la p&aacute;gina de configuraci&oacute;n de JAAS o desde otras p&aacute;ginas para recursos que utilicen entradas de datos de autenticaci&oacute;n de J2C. Por ejemplo, para ver esta p&aacute;gina de la consola administrativa, puede pulsar <strong>Seguridad</strong> &gt; <strong>Configuraci&oacute;n JAAS</strong> &gt; <strong>Entradas de datos de autenticaci&oacute;n de J2C</strong> o <strong>Recursos</strong> &gt; <strong>Proveedor de JMS de WebSphere &gt; F&aacute;bricas de conexiones de cola WebSphere</strong> &gt; <strong>f&aacute;brica-conexiones</strong> &gt; <strong>Entradas de datos de autenticaci&oacute;n de J2C</strong>.<p>
<b>Nota: </b>Tenga cuidado al suprimir las entradas de datos de autenticaci&oacute;n. Si otras configuraciones utilizan los datos de autenticaci&oacute;n suprimidos, el proceso de recursos de inicializaci&oacute;n no se realiza adecuadamente.</p>
</p>

<p>Para definir una nueva entrada de datos de autenticaci&oacute;n, pulse <strong>Nueva</strong>.</p>

<dl>
<dt>
<strong><a name="JAASAuthData_alias_description"></a>Alias</strong>
</dt>
<dd>Especifica el nombre de la entrada de datos de autenticaci&oacute;n.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos:</td>
<td align="left" valign="top" class="base">String</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unidades:</td>
<td align="left" valign="top" class="base">String</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n:</td>
<td align="left" valign="top" class="base">Ninguno</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="JAASAuthData_userId_description"></a>ID de usuario</strong>
</dt>
<dd>Especifica la identidad de usuario.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos:</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="JAASAuthData_description_description"></a>Descripci&oacute;n</strong>
</dt>
<dd>Especifica una descripci&oacute;n opcional de la entrada de datos de autenticaci&oacute;n.
Por ejemplo, esta entrada de datos de autenticaci&oacute;n se utiliza para conectarse a DB2.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos:</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="rcon_scope.html">Valores de &aacute;mbito de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

</div>
</body>
</html>
