<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de seguridad del servidor</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="usecrgswc"></a>
<h2>Valores de seguridad del servidor</h2>

<p>Utilice esta p&aacute;gina para configurar la seguridad del servidor y alterar temporalmente los valores de seguridad global. Si necesita regresar a los valores de
seguridad global por omisi&oacute;n, deseleccione el recuadro de selecci&oacute;n correspondiente de la
consola administrativa.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Servidores</strong> &gt; <strong>Servidores de aplicaciones</strong> &gt; <em>nombre_servidor</em> &gt; <strong>Seguridad de servidor</strong>. 
Tenga en cuenta de estos valores s&oacute;lo son aplicables a Network Deployment.</p>

<p>Se puede
inhabilitar la seguridad en servidores de aplicaciones individuales mientras est&aacute; habilitada
la seguridad global. No obstante, no se puede habilitar la
seguridad en el servidor de aplicaciones individual mientras la seguridad global est&eacute; inhabilitada. Aunque la seguridad del
servidor de aplicaciones est&eacute; inhabilitada para las peticiones de
usuario, la seguridad de administraci&oacute;n y de nombres contin&uacute;a
habilitada para ese servidor de aplicaciones, por lo que la
infraestructura de administraci&oacute;n y de nombres permanece segura. Para evitar problemas, verifique que la seguridad de denominaci&oacute;n tenga el tipo de acceso <strong>Todos</strong> a la funci&oacute;n de denominaci&oacute;n que se utiliza en el c&oacute;digo de usuario. No es necesario que configure la seguridad de administraci&oacute;n, ya que el c&oacute;digo de usuario no accede directamente a las funciones administrativas. El c&oacute;digo de usuario accede a las funciones administrativas a trav&eacute;s de las herramientas de scripts soportadas.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="ServerSecurity_overrideCellSecurity_description"></a>Seguridad a nivel de servidor</strong>
</dt>
<dd>Especifica si el servidor alterar&aacute; temporalmente c&eacute;lulas por omisi&oacute;n para seguridad.
<p>Pera volver a los valores por omisi&oacute;n de Seguridad a nivel de servidor, pulse
<strong>Utilizar seguridad de c&eacute;lulas</strong>. Pulse <strong>Aplicar</strong> y seleccione <strong>Guardar</strong> para validar
los cambios a nivel de servidor.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ServerSecurity_overrideCellCSI_description"></a>CSI</strong>
</dt>
<dd>Especifica si el servidor altera temporalmente los valores por omisi&oacute;n de c&eacute;lula
para el protocolo CSI.
<p>Para volver a los valores por omisi&oacute;n de la c&eacute;lula para el protocolo CSI, pulse
<strong>Utilizar CSI de c&eacute;lulas</strong>. Pulse <strong>Aplicar</strong> y seleccione <strong>Guardar</strong> para validar
los cambios a nivel de servidor.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ServerSecurity_overrideCellIBM_description"></a>SAS</strong>
</dt>
<dd>Especifica si el servidor altera temporalmente los valores por
omisi&oacute;n de c&eacute;lula para el protocolo
.
<p>Para volver a los valores por omisi&oacute;n de la c&eacute;lula para el protocolo SAS, pulse
<strong>Utilizar SAS de c&eacute;lulas</strong>. Pulse <strong>Aplicar</strong> y seleccione <strong>Guardar</strong> para validar
los cambios a nivel de servidor.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="rcon_scope.html">Valores de &aacute;mbito de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

</div>
</body>
</html>
