# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#CMVCPATHNAME ws/code/webui.servermanagement/src/servermanagement/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE
#

nav.webSphere.servermanagement.configuration=Server
nav.webSphere.servers=Server
nav.view.ApplicationServer=Anwendungsserver
nav.view.JMSServer=JMS-Server
Server.node.displayName=Knoten  
Server.node.description=Knoten  
Server.status.displayName=Status
Server.status.description=Status
ExecutionState.STARTED=Gestartet
ExecutionState.STOPPED=Gestoppt
ExecutionState.UNAVAILABLE=Nicht verf\u00fcgbar
attribute.not.found=JMX-Fehler: Attribut wurde nicht gefunden

Server.type.displayName=Typ
Server.type.description=Der Typ des Servers.
Server.mbean.pid.displayName=Prozess-ID
Server.mbean.pid.description=Die Prozess-ID des nativen Betriebssystems f\u00fcr diesen Server.
Server.mbean.cellName.displayName=Zellenname
Server.mbean.cellName.description=Der Name der Zelle, in der der Server ausgef\u00fchrt wird.
Server.mbean.nodeName.displayName=Knotenname
Server.mbean.nodeName.description=Der Name des Knotens, auf dem der Server ausgef\u00fchrt wird.
Server.mbean.state.displayName=Status
Server.mbean.state.description=Der Ausf\u00fchrungsstatus des Servers zur Laufzeit.
ServerManagement.logsAndTrace.displayName=Protokollierung und Tracing
ServerManagement.logsAndTrace.description=Protokoll- und Trace-Einstellungen f\u00fcr diesen Server festlegen.
ServerManagement.RASLoggingService.displayName=IBM Serviceprotokolle
ServerManagement.RASLoggingService.description=Das IBM Serviceprotokoll konfigurieren, das auch als Aktivit\u00e4tenprotokoll bezeichnet wird.

ServerManagement.TraceService.displayName=Diagnostic Trace Service
ServerManagement.TraceService.description=Merkmale des Diagnostic Trace Service anzeigen und \u00e4ndern.

task.manage.server=Lokale Server verwalten

TransactionService.displayName=Transaction Service
TransactionService.description=Der Transaction Service ist eine Laufzeitkomponente des Servers, die die Aktualisierungen mehrerer Resource Manager koordinieren kann, damit autarke Aktualisierungen von data.Transactions von Anwendungen oder dem Container, in dem die Anwendungen implementiert sind, gestartet und beendet werden.
TransactionService.smallIcon=TransactionService.gif
TransactionService.largeIcon=TransactionService32X32.gif
TransactionService.transactionLogDirectory.displayName=Verzeichnis f\u00fcr Transaktionsprotokoll
TransactionService.transactionLogDirectory.description=Gibt den Namen eines Verzeichnisses an, in dem der Transaction Service die Protokolldateien f\u00fcr die Wiederherstellung speichert. Leere Werte in der Serverkonfiguration werden beim Serverstart vom Transaktionsprotokoll zu einem Verzeichnis erweitert (Installationsstammverzeichnis)/tranlog/(Servername).
TransactionService.totalTranLifetimeTimeout.displayName=Zeitlimit f\u00fcr Gesamtlebensdauer der Transaktion
TransactionService.totalTranLifetimeTimeout.description=Die maximale Dauer (in Sekunden) f\u00fcr Transaktionen in diesem Anwendungsserver. Alle Transaktionen, die nicht abgeschlossen sein m\u00fcssen, bevor das Zeitlimit abl\u00e4uft, werden r\u00fcckg\u00e4ngig gemacht.
TransactionService.clientInactivityTimeout.displayName=Zeitlimit f\u00fcr Clientinaktivit\u00e4t
TransactionService.clientInactivityTimeout.description=Der maximale Zeitraum (in Sekunden) zwischen den Transaktionsanforderungen eines fernen Client. Alle Clientinaktivit\u00e4tszeitr\u00e4ume, die dieses Zeitlimit \u00fcberschreiten, f\u00fchren dazu, dass die Transaktion in diesem Anwendungsserver r\u00fcckg\u00e4ngig gemacht wird.
TransactionService.enableLoggingForHeuristicReporting.displayName=Protokollierung f\u00fcr heuristische Berichte aktivieren
TransactionService.enableLoggingForHeuristicReporting.description=Aktiviert die Protokollierung f\u00fcr heuristische Berichte (eine erweiterte Funktion ist im Add-on-Paket EEx verf\u00fcgbar). Falls Anwendungen so konfiguriert sind, dass einphasige Ressourcen an zweiphasigen Transaktionen teilnehmen k\u00f6nnen, m\u00fcssen beim Erstellen von heuristischen Ausgabeberichten im Falle eines Fehlers des Anwendungsservers zus\u00e4tzliche Informationen in das Transaktionsprotokoll geschrieben werden. Wenn diese Einstellung aktiviert ist, wird f\u00fcr alle Transaktionen, die ein- und zweiphasige Ressourcen umfassen, ein zus\u00e4tzlicher Schreibvorgang durchgef\u00fchrt. Es werden keine zus\u00e4tzlichen Datens\u00e4tze f\u00fcr Transaktionen geschrieben, die keine einphasige Ressource umfassen. Die Einstellung ist standardm\u00e4\u00dfig nicht aktiviert.
TransactionService.mbean.transactionLogDirectory.displayName=Verzeichnis f\u00fcr Transaktionsprotokoll
TransactionService.mbean.transactionLogDirectory.description=Gibt den Namen eines Verzeichnisses f\u00fcr den Server an, in dem der Transaction Service die Protokolldateien f\u00fcr die Wiederherstellung speichert.
TransactionService.mbean.totalTranLifetimeTimeout.displayName=Zeitlimit f\u00fcr Gesamtlebensdauer der Transaktion
TransactionService.mbean.totalTranLifetimeTimeout.description=
TransactionService.mbean.clientInactivityTimeout.displayName=Zeitlimit f\u00fcr Clientinaktivit\u00e4t
TransactionService.mbean.clientInactivityTimeout.description=
Transaction.displayName=Transaktionen verwalten
Transaction.description=Transaktionen verwalten, die derzeit im Anwendungsserver ausgef\u00fchrt werden.
Transaction.localId.displayName=Lokale ID
Transaction.status.displayName=Status

Transaction.globalId.displayName=Globale ID
button.transactionlist=Transaktionen verwalten
Transaction.noactivetransaction.exists=Es ist keine aktiven Transaktionen auf dem Server vorhanden.
jmx.malformedobject.error=Es wurde kein MBean des Typs {0} gefunden.
jmx.instancenotfound.error=Die Operation {0} f\u00fcr MBean des Typs {1} ist fehlgeschlagen.

ApplicationServer.installedApps.displayName=Installierte Anwendungen
ApplicationServer.installedApps.description=In diesem Server installierte Anwendungen verwalten.

ApplicationServer.displayName=Anwendungsserver
ApplicationServer.description=Ein Anwendungsserver ist ein Server, der die erforderlichen Services f\u00fcr die Ausf\u00fchrung von Enterprise-Anwendungen bereitstellt.
ApplicationServer.name.displayName=Name
ApplicationServer.name.description=Der Anzeigenname des Servers.
ApplicationServer.smallIcon=ApplicationServer.gif
ApplicationServer.largeIcon=ApplicationServer32X32.gif
ApplicationServer.locationServiceDaemon.displayName=Location Service Daemon
ApplicationServer.locationServiceDaemon.description=
ApplicationServer.components.DynamicCache.displayName=Dynamic Cache Service
ApplicationServer.components.DynamicCache.description=Einstellungen f\u00fcr den Dynamic Cache Service des Servers festlegen.
ApplicationServer.applicationServerServices.displayName=Application Server Services
ApplicationServer.applicationServerServices.description=Services f\u00fcr den Anwendungsserver. Lesen Sie die Informationen zu den von der Container-Superklasse \u00fcbernommenen Services.
ApplicationServer.applicationServerServices.TransactionService.displayName=Transaction Service
ApplicationServer.applicationServerServices.TransactionService.description=Einstellungen f\u00fcr den Transaction Service festlegen und aktive Transaktionssperren verwalten.
ApplicationServer.components.WebContainer.displayName=Webcontainer
ApplicationServer.components.WebContainer.description= Einstellungen f\u00fcr den Thread-Pool und den dynamischen Cache des Containers, sowie Einstellungen f\u00fcr den Session Manager, wie z. B. Persistenz- und Optimierungsparameter, und f\u00fcr HTTP-Transporte festlegen.
ApplicationServer.components.EJBContainer.displayName=EJB-Container
ApplicationServer.components.EJBContainer.description=Cache- und Datenquelleninformationen f\u00fcr den Container festlegen.
Server.services.ObjectRequestBroker.displayName=ORB-Service
Server.services.ObjectRequestBroker.description=Einstellungen f\u00fcr den ORB-Service (Object Request Broker) festlegen.
ApplicationServer.id.displayName=ID
ApplicationServer.id.description=Einem Server kann eine eindeutige Kennung (ID) zugeordnet werden.
ApplicationServer.applicationClassLoaderPolicy.displayName=Klassenlader-Policy der Anwendung
ApplicationServer.applicationClassLoaderPolicy.description=Gibt an, ob ein Klassenlader f\u00fcr alle Anwendungen (\"Einer\") oder ein Klassenlader pro Anwendung (\"Mehrere\") verwendet wird.
ApplicationServer.applicationClassLoadingMode.displayName=Modus f\u00fcr das Laden der Anwendungsklassen
ApplicationServer.applicationClassLoadingMode.description=Gibt den Modus f\u00fcr das Laden der Klassen an, wenn als Klassenlader-Policy f\u00fcr die Anwendung \"Einer\" festgelegt ist.
ClassLoaderPolicy.SINGLE=Anwendung
ClassLoaderPolicy.MULTIPLE=Modul
ServerClassLoaderPolicy.SINGLE=Einer
ServerClassLoaderPolicy.MULTIPLE=Mehrere
applicationClassLoadingMode.PARENT_FIRST=Elternklasse zuerst
applicationClassLoadingMode.PARENT_LAST=Elternklasse zuletzt

ApplicationContainer.displayName=Anwendungscontainer
ApplicationContainer.description=
ApplicationContainer.smallIcon=ApplicationContainer.gif
ApplicationContainer.largeIcon=ApplicationContainer32X32.gif
DynamicCache.displayName=Dynamic Cache Service
DynamicCache.description=Dynamic Cache Service
DynamicCache.smallIcon=DynamicCache.gif
DynamicCache.largeIcon=DynamicCache32X32.gif
DynamicCache.cacheGroups.description=Gruppen von externen Caches definieren, die von WebSphere Application Server gesteuert werden.
DynamicCache.cacheReplication.displayName=Cache-Replikation
DynamicCache.cacheReplication.description=
DynamicCache.cacheSize.units=Eintr\u00e4ge
DynamicCache.cacheSize.description=Eine positive ganze Zahl, die die maximale Anzahl der Eintr\u00e4ge im Cache definiert.
DynamicCache.defaultPriority.description=Die Standardpriorit\u00e4t f\u00fcr Cache-Eintr\u00e4ge. Diese Priorit\u00e4t legt fest, wie lange ein Eintrag in einem ausgelasteten Cache verbleibt.
DynamicCache.replicationType.displayName=Replikationstyp
DynamicCache.replicationType.description=Der Algorithmus f\u00fcr die Verteilung von Eintr\u00e4gen aus dem gemeinsamen Cache an die zugeh\u00f6rigen dynamischen Caches, die \u00fcber DRS verbunden sind. Diese Einstellung muss auf einen der dynamicCacheReplicationKind-Werte gesetzt werden.
DynamicCache.pushFrequency.displayName=Push-Intervall
DynamicCache.pushFrequency.description=Ein Zeitintervall (in Sekunden), das verwendet wird, wenn der Replikationstyp auf PUSH gesetzt ist. Der Standardwert ist 0.
DynamicCache.enableDiskOffload.displayName=Auslagerung auf die Platte aktivieren
DynamicCache.enableDiskOffload.description=Aktiviert die Auslagerung der Daten auf die Platte.
DynamicCache.diskOffloadLocation.displayName=Auslagerungsverzeichnis
DynamicCache.diskOffloadLocation.description=Gibt ein Verzeichnis f\u00fcr die Auslagerung auf die Platte an.
DynamicCache.hashSize.displayName=Hash-Gr\u00f6\u00dfe
DynamicCache.hashSize.description=Gibt die Hash-Gr\u00f6\u00dfe an, wenn die Auslagerung auf die Platte aktiviert ist. G\u00fcltige Werte sind 2er-Potenzen (1, 2, 4, 8...).
ExternalCacheGroup.description=Auf dieser Seite k\u00f6nnen Sie die externen Caches definieren, die WebSphere Application Server in Webservern wie IBM Edge Server und IBM HTTP Server steuert.
ExternalCacheGroup.smallIcon=ExternalCacheGroup.gif
ExternalCacheGroup.largeIcon=ExternalCacheGroup32X32.gif
ExternalCacheGroup.members.description=Member einer externen Cache-Gruppe, die von WebSphere Application Server gesteuert wird.
ExternalCacheGroup.name.description=Name der externen Cache-Gruppe.
ExternalCacheGroup.type.description=Derzeit werden nur gemeinsam benutzte externe Cache-Gruppen unterst\u00fctzt.
ExternalCacheGroupMember.displayName=Member der externen Cache-Gruppe
ExternalCacheGroupMember.description=Ein einzelner externer Cache, den WebSphere steuern soll.
ExternalCacheGroupMember.smallIcon=ExternalCacheGroupMember.gif
ExternalCacheGroupMember.largeIcon=ExternalCacheGroupMember32X32.gif
ExternalCacheGroupMember.address.description=Der Hostname und gegebenenfalls die Port-Nummer eines externen Cache.
ExternalCacheGroupMember.adapterBeanName.description=Der Name einer Klasse im Klassenpfad von WebSphere Application Server f\u00fcr den Adapter, der zwischen WebSphere Application Server und diesem externen Cache eingesetzt wird.
ExternalCacheGroupKind.SHARED=SHARED
ExternalCacheGroupKind.NOT_SHARED=NOT_SHARED
DynamicCacheReplicationKind.NONE=NONE
DynamicCacheReplicationKind.PUSH=PUSH
DynamicCacheReplicationKind.PULL=PULL
DynamicCacheReplicationKind.PUSH_PULL=PUSH_PULL
EJBCache.displayName=Einstellungen des EJB-Cache
EJBCache.description=Jeder EJB-Container verwaltet einen Cache mit Bean-Instanzen f\u00fcr einen schnellen Zugriff. In diesem Abschnitt k\u00f6nnen Sie die Parameter f\u00fcr die Konfiguration des Cache angeben.
EJBCache.smallIcon=EJBCache.gif
EJBCache.largeIcon=EJBCache32X32.gif
EJBCache.cleanupInterval.displayName=Bereinigungsintervall
EJBCache.cleanupInterval.units=Millisekunden
EJBCache.cleanupInterval.description=Das Intervall, in dem der Container versucht, nicht verwendete Eintr\u00e4ge aus dem Cache zu entfernen, um die Gesamtanzahl der Eintr\u00e4ge auf den Wert der Cache-Gr\u00f6\u00dfe zu verringern.
EJBCache.cacheSize.displayName=Cache-Gr\u00f6\u00dfe
EJBCache.cacheSize.units=Buckets
EJBCache.cacheSize.description=Gibt die Anzahl der Buckets in der Liste der aktiven Instanzen im EJB-Container an.
EJBContainer.displayName=EJB-Container
EJBContainer.description=Ein EJB-Container ist eine Komponente eines J2EE-Anwendungsservers, der den EJB-Modulen, die im Container implementiert werden k\u00f6nnen, Laufzeitservices zur Verf\u00fcgung stellt.
EJBContainer.smallIcon=EJBContainer.gif
EJBContainer.largeIcon=EJBContainer32X32.gif
EJBContainer.cacheSettings.displayName=Einstellungen des EJB-Cache
EJBContainer.cacheSettings.description=Jeder EJB-Container verwaltet einen Cache mit Bean-Instanzen f\u00fcr einen schnellen Zugriff. In diesem Abschnitt k\u00f6nnen Sie die Parameter f\u00fcr die Konfiguration des Cache angeben.
EJBContainer.passivationDirectory.displayName=Verzeichnis f\u00fcr Passivierung
EJBContainer.passivationDirectory.description=Das Verzeichnis, in dem der Container den persistenten Status der inaktivierten Stateful-Session-Beans speichert.
EJBContainer.inactivePoolCleanupInterval.displayName=Bereinigungsintervall f\u00fcr inaktive Pools
EJBContainer.inactivePoolCleanupInterval.description=Das Intervall, in dem der Container die Pools auf verf\u00fcgbare Bean-Instanzen durchsucht, um festzustellen, ob Instanzen zur Entlastung des Speichers gel\u00f6scht werden k\u00f6nnen.
EJBContainer.defaultDatasourceJNDIName.displayName=JNDI-Name der Standarddatenquelle
EJBContainer.defaultDatasourceJNDIName.description=Der JNDI-Name der zu verwendenden Datenquelle, wenn beim Deployment der Anwendung keine Datenquelle angegeben wird. Diese Einstellung ist f\u00fcr EJB-2.x-kompatible CMP-Beans nicht g\u00fcltig.
MessageListenerService.displayName=Message Listener Service
MessageListenerService.description=Konfiguration des Message Listener Service. Dieser Service ist der Listener-Prozess f\u00fcr Message-Driven Beans (MDB). Dabei werden die MDBs an den Listener-Ports implementiert, die die JMS-Zieladresse definieren, auf die gewartet wird. Die Listener-Ports werden in diesem Service zusammen mit den Einstellungen f\u00fcr den zugeh\u00f6rigen Thread-Pool definiert.
MessageListenerService.smallIcon=MessageListenerService.gif
MessageListenerService.largeIcon=MessageListenerService32X32.gif
MessageListenerService.listenerPorts.displayName=Listener-Ports
MessageListenerService.listenerPorts.description=Die in der Administrationsdom\u00e4ne konfigurierten Ports f\u00fcr den Message-Listener.
MessageListenerService.threadPool.displayName=Thread-Pool
MessageListenerService.threadPool.description=Die Einstellungen f\u00fcr den MDB-Thread-Pool des Message Listener Service.
MessageListenerService.name.displayName=Name
MessageListenerService.name.description=Der Name, unter dem der Message Listener Service bekannt ist (f\u00fcr Verwaltungszwecke).
MessageListenerService.description.displayName=Beschreibung
MessageListenerService.description.description=Der Message Listener Service ist eine Erweiterung der JMS-Funktionen des JMS-Provider. Der Service stellt einen Listener Manager bereit, der einen oder mehrere JMS-Listener steuert und \u00fcberwacht, die eine JMS-Zieladresse f\u00fcr eine implementierte Message-Driven Bean \u00fcberwachen.
ListenerPort.name.description=Name des Listener-Port
ListenerPort.displayName=Listener-Ports
ListenerPort.description=Listener-Ports, an denen MDBs auf Nachrichten warten. Jeder Port gibt die JMS-Verbindungs-Factory und die JMS-Zieladresse an, auf die eine f\u00fcr diesen Port implementierte MDB wartet.
ListenerPort.smallIcon=ListenerPort.gif
ListenerPort.largeIcon=ListenerPort32X32.gif
ListenerPort.description.displayName=Beschreibung
ListenerPort.description.description=Eine Beschreibung des Listener-Port (f\u00fcr Verwaltungszwecke)
ListenerPort.connectionFactoryJNDIName.displayName=JNDI-Name der Verbindungs-Factory
ListenerPort.connectionFactoryJNDIName.description=Der JNDI-Name der vom Listener-Port zu verwendenden JMS-Verbindungs-Factory, z. B. jms/connFactory1.
ListenerPort.destinationJNDIName.displayName=JNDI-Name der Zieladresse
ListenerPort.destinationJNDIName.description=Der JNDI-Name der vom Listener-Port zu verwendenden Zieladresse, z. B. jms/destn1.
ListenerPort.maxSessions.displayName=Maximale Anzahl Sitzungen
ListenerPort.maxSessions.description=Die maximale Anzahl gleichzeitiger JMS-Serversitzungen, die der Listener f\u00fcr die Verarbeitung von Nachrichten verwenden kann. G\u00fcltige Werte sind 1 bis 2147483647.
ListenerPort.maxRetries.displayName=Maximale Anzahl Wiederholungen
ListenerPort.maxRetries.description=Gibt an, wie oft der Listener maximal versucht, eine Nachricht zuzustellen, bevor er gestoppt wird. G\u00fcltige Wert sind 0 bis 2147483647.
ListenerPort.maxMessages.displayName=Maximale Anzahl Nachrichten
ListenerPort.maxMessages.description=Die maximale Anzahl an Nachrichten, die der Listener in einer JMS-Serversitzung verarbeiten kann. G\u00fcltige Werte sind 0 bis 2147483647.
ListenerPort.mbean.started.displayName=Gestartet
ListenerPort.mbean.started.description=Der Ausf\u00fchrungsstatus des Listener-Port
ListenerPort.mbean.jmsConnJNDIName.displayName=JNDI-Name der Verbindungs-Factory
ListenerPort.mbean.jmsConnJNDIName.description=JNDI-Name der JMS-Verbindungs-Factory, die der Listener-Thread verwenden soll.
ListenerPort.mbean.jmsDestJNDIName.displayName=JNDI-Name der Zieladresse
ListenerPort.mbean.jmsDestJNDIName.description=JNDI-Name der vom Listener-Thread zu verwendenden Zieladresse.
ListenerPort.mbean.maxSessions.displayName=Maximale Anzahl Sitzungen
ListenerPort.mbean.maxSessions.description=Die maximale Anzahl gleichzeitig ausgef\u00fchrter JMS-Serversitzungen, die von einem MDB-Listener f\u00fcr die Verarbeitung von Nachrichten verwendet werden. Die g\u00fcltigen Werte liegen im Bereich von 1 bis MAX_INT_VALUE.
ListenerPort.mbean.maxRetries.displayName=Maximale Anzahl Wiederholungen
ListenerPort.mbean.maxRetries.description=Gibt an, wie oft versucht wird, eine Nachricht zuzustellen, bevor die MDB-Listener-Instanz gestoppt wird. Die g\u00fcltigen Werte liegen im Bereich von 0 bis MAX_INT_VALUE.
ListenerPort.mbean.maxMessages.displayName=Maximale Anzahl Nachrichten
ListenerPort.mbean.maxMessages.description=Die maximale Anzahl von Nachrichten, die zu einer Zeit von einer JMS-Serversitzung verarbeitet werden kann. Die g\u00fcltigen Werte liegen im Bereich von 1 bis MAX_INT_VALUE.
ListenerPort.must.be.selected=Sie m\u00fcssen mindestens einen Listener-Port ausw\u00e4hlen, um diese Aktion ausf\u00fchren zu k\u00f6nnen.
ListenerPort.started.succussfully=Der Listener-Port {0} wurde gestartet.
could.not.start.ListenerPort=Der Listener-Port {0} konnte nicht gestartet werden.
ListenerPort.stopped.succussfully=Der Listener-Port {0} wurde gestoppt.
could.not.stop.ListenerPort=Der Listener-Port {0} konnte nicht gestoppt werden.

WebContainer.displayName=Webcontainer
WebContainer.description=Ein Webcontainer bearbeitet Clientanforderungen f\u00fcr Webanwendungsressourcen, wie z. B. Servlets und JSP-Dateien. Der Webcontainer erstellt Servlet-Instanzen, l\u00e4dt und entl\u00e4dt Servlets, erstellt und verwaltet Anforderungs- und Antwortobjekte und \u00fcbernimmt weitere Aufgaben f\u00fcr die effiziente Verwaltung der Komponenten einer Webanwendung. Ein Anwendungsserver enth\u00e4lt nur einen oder gar keinen Webcontainer. Die von WebSphere Application Server bereitgestellten Webserver-Plug-ins erm\u00f6glichen es den Webservern, Ressourcenanforderungen an den Webcontainer von WebSphere Application Server zu \u00fcbergeben.

WebContainer.smallIcon=WebContainer.gif
WebContainer.largeIcon=WebContainer32X32.gif
WebContainer.transports.displayName=Transporte
WebContainer.transports.description=Eine Liste der f\u00fcr den Webcontainer definierten Transporte.
webcontainer.threadpool.description=Die Einstellungen f\u00fcr den Thread-Pool des Webcontainers.
WebContainer.sessionAffinityTimeout.displayName=sessionAffinityTimeout
WebContainer.sessionAffinityTimeout.description=Wenn Sie f\u00fcr diese Einstellung einen Wert ungleich null angeben, kann WebSphere die HTTP-Sitzungsaffinit\u00e4t f\u00fcr Anforderungen nach Ablauf der festgelegten Zeitspanne auf einen anderen Server setzen. In bestimmten Situationen kann dadurch ein besserer Lastausgleich erreicht werden. Der Standardwert ist 0. Die g\u00fcltigen Werte liegen im Bereich von 0 bis MAX_INT.
WebContainer.sessionAffinityFailoverServer.displayName=sessionAffinityFailoverServer
WebContainer.sessionAffinityFailoverServer.description=Wenn WLM verwendet wird und ein Server in einer Servergruppe abgest\u00fcrzt ist, leitet WLM Anforderungen mit einer Affinit\u00e4t zum abgest\u00fcrzten Server normalerweise an einen anderen zuf\u00e4llig ausgew\u00e4hlten Server in der Servergruppe weiter. In diesem Feld kann der Administrator den Namen eines Servers in der Servergruppe angeben, an den Affinit\u00e4tsanforderungen weitergeleitet werden. Die zuf\u00e4llige Auswahl eines Servers unterbleibt in diesem Fall.
WebContainer.defaultVirtualHostName.displayName=defaultVirtualHostName
WebContainer.defaultVirtualHostName.description=Der virtuelle Host, der standardm\u00e4\u00dfig f\u00fcr Webanwendungen verwendet wird. Diese Angabe kann w\u00e4hrend der Anwendungsinstallation \u00fcberschrieben werden.
WebContainer.enableServletCaching.displayName=enableServletCaching
WebContainer.enableServletCaching.description=Gibt an, ob das Servlet- und JSP-Caching aktiviert ist.
DB2RowSizeEnum.ROW_SIZE_4KB=ROW_SIZE_4KB
DB2RowSizeEnum.ROW_SIZE_8KB=ROW_SIZE_8KB
DB2RowSizeEnum.ROW_SIZE_16KB=ROW_SIZE_16KB
DB2RowSizeEnum.ROW_SIZE_32KB=ROW_SIZE_32KB
TuningParams.displayName=Benutzerdefinierte Optimierungsparameter
TuningParams.description=Optimierungsparameter f\u00fcr die Sitzungsverwaltung.
TuningParams.smallIcon=TuningParams.gif
TuningParams.largeIcon=TuningParams32X32.gif
TuningParams.invalidationSchedule.displayName=Zeitplan f\u00fcr Invalidierung
TuningParams.invalidationSchedule.description=Wenn diese Einstellung aktiviert ist, gibt sie die beiden Stunden am Tag an, zu denen der Invalidierungsprozess invalidierte persistente Sitzungen aus der Datenbank l\u00f6scht. Legen Sie Zeiten fest, zu denen die wenigsten Aktivit\u00e4ten auf der Site durchgef\u00fchrt werden. Das Ziel ist, die Aktivit\u00e4ten in der Sitzungsdatenbank zu reduzieren. Durch Auswahl dieser Option wird die Anzahl der in der Datenbank vorgenommenen Aktualisierungen reduziert, die erforderlich sind, um die HTTP-Sitzungen aktiv zu halten. Ist die Option inaktiviert, wird der Invalidierungsprozess st\u00e4ndig im Abstand von nur wenigen Minuten ausgef\u00fchrt, um invalidierte HTTP-Sitzungen zu entfernen.
TuningParams.usingMultiRowSchema.displayName=Mehrzeilenschema verwenden
TuningParams.usingMultiRowSchema.description=Gibt an, ob jede Instanz von Anwendungsdaten in eine separate Zeile der Datenbank geschrieben werden soll, wodurch gr\u00f6\u00dfere Datenmengen pro Sitzung gespeichert werden k\u00f6nnen. Mit diesem Verfahren kann in bestimmten Verwendungsszenarien eine bessere Leistung erzielt werden. Bei Auswahl dieses Feldes wird jede Instanz der Anwendungsdaten in eine separate Zeile der Datenbank geschrieben. Ist das Feld abgew\u00e4hlt, k\u00f6nnen mehrere Instanzen der Anwendungsdaten in eine Zeile geschrieben werden.

TuningParams.maxInMemorySessionCount.displayName=Maximale Anzahl der Sitzungen im Speicher
TuningParams.maxInMemorySessionCount.description=Gibt die maximale Anzahl von Sitzungen an, die im Speicher verwaltet werden k\u00f6nnen.
TuningParams.allowOverflow.displayName=\u00dcberlauf zulassen
TuningParams.allowOverflow.description=Gibt an, ob die Anzahl der Speichersitzungen den Wert f\u00fcr die Anzahl der Speichersitzungen \u00fcberschreiten darf. Ja bedeutet \u00dcberlauf zulassen. Nein bedeutet, die Anzahl der Sitzungen im Speicher auf die festgelegte Anzahl der Speichersitzungen zu beschr\u00e4nken.

TuningParams.scheduleInvalidation.displayName=Invalidierung planen
TuningParams.scheduleInvalidation.description=Gibt an, wann die ung\u00fcltigen Sitzungen aus dem persistenten Speicher gel\u00f6scht werden sollen.
TuningParams.writeFrequency.description=Diese Option steuert, wann die Sitzung in den persistenten Speicher geschrieben wird.
TuningParams.writeInterval.displayName=Schreibintervall
TuningParams.writeInterval.description=Wird f\u00fcr das Schreibintervall TIME_BASED_WRITE angegeben, gibt dieser Wert an, wie oft die Sitzungsdaten in die Datenbank geschrieben werden. Der Wert muss eine positive Ganzzahl im Bereich von 5 bis 9999 sein, die einen Zeitraum in Sekunden angibt. Wenn Sie diese Option konfigurieren, muss das Zeitlimit f\u00fcr Inaktivit\u00e4t mindestens doppelt so lang sein wie das Schreibintervall.
TuningParams.writeContents.description=Gibt an, ob nur die aktualisierten Attribute oder alle Sitzungsattribute, unabh\u00e4ngig davon, ob sie ge\u00e4ndert wurden oder nicht, in den persistenten Speicher geschrieben werden sollen.
TuningParams.invalidationTimeout.displayName=Invalidierungszeitlimit
TuningParams.invalidationTimeout.description=Gibt das Zeitintervall an, in dem eine Sitzung unbenutzt bleiben kann, bevor Sie als ung\u00fcltig eingestuft wird. Wenn Sie den Wert -1 angeben, wird die Sitzung nicht invalidiert. Dieser Wert wird standardm\u00e4\u00dfig verwendet, wenn kein Sitzungszeitlimit im Deployment-Deskriptor einer Webanwendung festgelegt ist. Beachten Sie, dass der Zeitgeber f\u00fcr die G\u00fcltigkeitsdauer nicht sekundengenau arbeitet. Der Spielraum macht etwa zwei Minuten aus. Ist die Schreibfrequenz zeitgest\u00fctzt, muss dieser Wert mindestens zweimal so hoch sein wie der Wert f\u00fcr das Schreibintervall.
WriteFrequencyEnum.END_OF_SERVLET_SERVICE=END_OF_SERVLET_SERVICE
WriteFrequencyEnum.MANUAL_UPDATE=MANUAL_UPDATE
WriteFrequencyEnum.TIME_BASED_WRITE=TIME_BASED_WRITE
WriteContentsEnum.ONLY_UPDATED_ATTRIBUTES=ONLY_UPDATED_ATTRIBUTES
WriteContentsEnum.ALL_SESSION_ATTRIBUTES=ALL_SESSION_ATTRIBUTES
InvalidationSchedule.displayName=Invalidierungszeitplan
InvalidationSchedule.description=Wenn diese Einstellung aktiviert ist, gibt sie die beiden Stunden am Tag an, zu denen der Invalidierungsprozess invalidierte persistente Sitzungen aus der Datenbank l\u00f6scht. Legen Sie Zeiten fest, zu denen die wenigsten Aktivit\u00e4ten auf der Site durchgef\u00fchrt werden. Das Ziel ist, die Aktivit\u00e4ten in der Sitzungsdatenbank zu reduzieren. Durch Auswahl dieser Option wird die Anzahl der in der Datenbank vorgenommenen Aktualisierungen reduziert, die erforderlich sind, um die HTTP-Sitzungen aktiv zu halten. Ist die Option inaktiviert, wird der Invalidierungsprozess st\u00e4ndig im Abstand von nur wenigen Minuten ausgef\u00fchrt, um invalidierte HTTP-Sitzungen zu entfernen.
InvalidationSchedule.smallIcon=InvalidationSchedule.gif
InvalidationSchedule.largeIcon=InvalidationSchedule32X32.gif
InvalidationSchedule.firstHour.displayName=Erste Stunde
InvalidationSchedule.firstHour.description=Die erste Stunde, in der die ung\u00fcltige Sitzungen aus dem externen Verzeichnis gel\u00f6scht werden. Dieser Wert muss eine positive Ganzzahl von 0 bis 23 sein. Diese Einstellung ist nur g\u00fcltig, wenn die Invalidierung von Zeitpl\u00e4nen aktiviert ist.
InvalidationSchedule.secondHour.displayName=Zweite Stunde
InvalidationSchedule.secondHour.description=Die zweite Stunde, in der die ung\u00fcltige Sitzungen aus dem externen Verzeichnis gel\u00f6scht werden. Dieser Wert muss eine positive Ganzzahl von 0 bis 23 sein. Diese Einstellung ist nur g\u00fcltig, wenn die Invalidierung von Zeitpl\u00e4nen aktiviert ist.
HTTPTransport.displayName=HTTP-Transport
HTTPTransport.description=Ein HTTP-Transport f\u00fcr die \u00dcbertragung von Anforderungen an den Webcontainer.
HTTPTransport.smallIcon=HTTPTransport.gif
HTTPTransport.largeIcon=HTTPTransport32X32.gif
DRSSettings.displayName=Internal Messaging
DRSSettings.description=Replikation von Speicher-zu-Speicher-Sitzungen konfigurieren.
DRSSettings.smallIcon=DRSSettings.gif
DRSSettings.largeIcon=DRSSettings32X32.gif
DRSSettings.dataReplicationMode.displayName=Modus f\u00fcr Datenreplikation
DRSSettings.dataReplicationMode.description=Legt fest, ob eine WebSphere-Instanz Daten nur \u00fcber interne Replikation sendet, empf\u00e4ngt oder sendet und empf\u00e4ngt. Standardm\u00e4\u00dfig empf\u00e4ngt und sendet die Instanz die Daten.
DRSSettings.messageBrokerDomainName.displayName=Dom\u00e4nenname des Nachrichten-Broker
DRSSettings.messageBrokerDomainName.description=Die interne Replikationsdom\u00e4ne, die von dieser WebSphere-Instanz verwendet wird.
DRSSettings.preferredLocalDRSBrokerName.displayName=Name des bevorzugten lokalen DRS-Broker
DRSSettings.preferredLocalDRSBrokerName.description=Der Replikator in einer Replikationsdom\u00e4ne, zu der die WebSphere-Instanz die erste Verbindung herstellt.
DRSSettings.overrideHostConnectionPoints.displayName=Verbindungspunkte des Host au\u00dfer Kraft setzen
DRSSettings.overrideHostConnectionPoints.description=Mit dieser Option k\u00f6nnen Sie die IP-Adresse und die Ports eines bestimmten Replikators festlegen (anstatt einen beliebigen Replikator aus der Replikationsdom\u00e4ne in der Zelle ausw\u00e4hlen zu lassen).
DRSSettings.hostPort.error=Ung\u00fcltige oder nicht \u00fcbereinstimmende Hosts und Ports. Jedem angegebenen Host muss eine Port-Nummer zugeordnet werden.
SessionPersistenceKind.NONE=KEINE
SessionPersistenceKind.DATABASE=DATENBANK
SessionPersistenceKind.DATA_REPLICATION=DATENREPLIKATION

Server.displayName=Server
Server.description=Ein Merkmal im Servermodell, dass den Kontextnamen f\u00fcr einen Modellkontext angibt. Damit wird das Konzept der \u00dcbernahme von Konfigurationswerten unterst\u00fctzt, so dass die Laufzeit in dem Fall, dass ein Konfigurationswert im Serverkontext nicht definiert ist, das mit dem Merkmal modelId (sofern vorhanden) angegebene Modell nach der Einstellung abfragen kann.
Server.smallIcon=Server.gif
Server.largeIcon=Server32X32.gif
Server.customServices.displayName=Benutzerdefinierte Services
Server.customServices.description=Benutzerdefinierte Serviceklassen und die zugeh\u00f6rigen Konfigurationsmerkmale f\u00fcr diesen Server definieren.
Server.components.displayName=Serverkomponenten
Server.components.description=Weitere konfigurierbare Laufzeitkomponenten.
Server.components.ServerComponent.displayName=Serverkomponenten
Server.extensions.displayName=Erweiterungen
Server.started=Gestartet
Server.stopped=Gestoppt
Service.displayName=Service
Service.description=Gibt die Konfigurationseinstellungen f\u00fcr einen Service an, der im Anwendungsserver ausgef\u00fchrt wird.
Service.smallIcon=Service.gif
Service.largeIcon=Service32X32.gif
Service.context.displayName=Kontext
Service.context.description=Der Kontext oder die Umgebung, in dem bzw. der der Service ausgef\u00fchrt wird.
Service.context.Component.displayName=Komponenten
Service.context.Server.displayName=Server
Service.properties.displayName=Benutzerdefinierte Merkmale
Service.properties.description=Weitere benutzerdefinierte und konfigurierbare Merkmale f\u00fcr diesen Service.
Service.enable.displayName=Start
Service.enable.description=Gibt an, ob der Server den angegebenen Service beim Start des Servers aufrufen soll.
CustomService.displayName=Benutzerdefinierte Services
CustomService.description=Ein Erweiterungspunkt f\u00fcr die Konfigurationsdaten von Plug-in-Services. Erlaubt dem Benutzer, benutzerdefinierten Code einzuf\u00fcgen, der w\u00e4hrend der Prozessinitialisierung ausgef\u00fchrt wird.
CustomService.smallIcon=CustomService.gif
CustomService.largeIcon=CustomService32X32.gif
CustomService.prerequisiteServices.displayName=Vorausgesetzte Services
CustomService.prerequisiteServices.description=Eine Liste von Referenzen auf andere in diesem Prozess definierte benutzerdefinierte Services, auf die dieser benutzerdefinierte Service wartet, bevor er initialisiert wird.
CustomService.externalConfigURL.displayName=Externer Konfigurations-URL
CustomService.externalConfigURL.description=Der URL f\u00fcr die Konfigurationsdatei eines benutzerdefinierten Service.
CustomService.classname.displayName=Klassenname
CustomService.classname.description=Der Klassenname der Serviceimplementierung. Diese Klasse muss das Interface f\u00fcr den benutzerdefinierten Service implementieren.
CustomService.displayName.displayName=Anzeigenname
CustomService.displayName.description=Der Name des Service.
CustomService.description.displayName=Beschreibung
CustomService.description.description=Beschreibt den benutzerdefinierten Service.
CustomService.classpath.displayName=Klassenpfad
CustomService.classpath.description=Der Klassenpfad, in dem die Klassen und JARs f\u00fcr diesen Service abgelegt werden.
ThreadPool.displayName=Thread-Pool
ThreadPool.description=Ein Thread-Pool gibt den Komponenten des Servers die M\u00f6glichkeit, Threads wiederzuverwenden. Mit dieser Methode wird verhindert, dass zur Laufzeit neue Threads erstellt werden m\u00fcssen. Das Erstellen neuer Threads ist in der Regel eine zeit- und ressourcenintensive Operation.
ThreadPool.smallIcon=ThreadPool.gif
ThreadPool.largeIcon=ThreadPool32X32.gif
ThreadPool.minimumSize.displayName=Mindestgr\u00f6\u00dfe
ThreadPool.minimumSize.description=Die zul\u00e4ssige Mindestanzahl an Threads im Pool.
ThreadPool.maximumSize.displayName=Maximale Gr\u00f6\u00dfe
ThreadPool.maximumSize.description=Die maximal zul\u00e4ssige Anzahl an Threads im Pool.
ThreadPool.inactivityTimeout.description=Gibt an, wie lange (in Millisekunden) ein Thread inaktiv sein darf, bevor er erneut angefordert werden kann.
ThreadPool.isGrowable.displayName=Ist erweiterbar
ThreadPool.isGrowable.description=Gibt an, um wie viele Threads die f\u00fcr den Thread-Pool konfigurierte maximale Gr\u00f6\u00dfe \u00fcberschritten werden kann.
MessageFormatKind.BASIC=BASIC
MessageFormatKind.ADVANCED=ADVANCED
ServiceContext.displayName=Servicekontext
ServiceContext.description=Der Kontext oder die Umgebung, in dem bzw. der der Service ausgef\u00fchrt wird.
ServiceContext.smallIcon=ServiceContext.gif
ServiceContext.largeIcon=ServiceContext32X32.gif
ServiceContext.services.displayName=Services
ServiceContext.services.description=Die Services, die der Container den Komponenten bereitstellt, die im Kontext des Container ausgef\u00fchrt werden. Die Arten der vom Container bereitgestellten Services werden durch einen Vergleich von Servicebereich und Containerbereich ermittelt.

ServiceContext.services.CustomService.displayName=Benutzerdefinierte Services
Component.displayName=Komponente
Component.description=Ein Prozess, der fern aufrufbare Komponenten enth\u00e4lt. Ein Server stellt die Konfigurationsdaten einer Komponente bereit, die unabh\u00e4ngig von einer \u00fcbergeordneten Komponente in einem eigenen Prozess (wie ein Service) ausgef\u00fchrt werden kann. Es k\u00f6nnen mehrere Server in der JVM ausgef\u00fchrt werden.
Component.smallIcon=Component.gif
Component.largeIcon=Component32X32.gif
Component.properties.displayName=Benutzerdefinierte Merkmale
Component.properties.description=Weitere benutzerdefinierte Merkmale f\u00fcr diese Laufzeitkomponente. Einige Komponenten k\u00f6nnen benutzerdefinierte Konfigurationsmerkmale verwenden, die Sie hier definieren k\u00f6nnen.
Component.parentComponent.displayName=Elternkomponente
Component.parentComponent.description=Eine gr\u00f6\u00dfere Laufzeitkomponente, die diese Konfigurationseinstellungen enth\u00e4lt.
Component.parentComponent.ServerComponent.displayName=Serverkomponenten
Component.components.displayName=Komponenten
Component.components.description=Weitere konfigurierbare Laufzeitkomponenten.
Component.components.ServerComponent.displayName=Serverkomponenten
Component.server.displayName=Server
Component.server.description=Ein Prozess (oder eine Gruppe von Prozessen, die als ein logischer Prozess auftreten), der auf einem Knoten ausgef\u00fchrt wird, der den Anwendungen \u00fcber die Container und Services, die in der Anwendung ausgef\u00fchrt werden, Services und Ressourcen bereitstellt.
Agent.displayName=Agent
Agent.description=
Agent.smallIcon=Agent.gif
Agent.largeIcon=Agent32X32.gif
Server.stateManagement.displayName=Statusverwaltung
Server.stateManagement.description=Die M\u00f6glichkeit, den Status der verwalteten Ressource zu steuern, d. h. sie zu starten und zu stoppen.
Server.statisticsProvider.displayName=Statistikprovider
Server.statisticsProvider.description=Die F\u00e4higkeit der verwalteten Ressource, Leistungsmessdaten zu generieren.
ManagedObject.name.displayName=Name
ManagedObject.name.description=Der Name, der f\u00fcr das verwaltete Objekt verwendet werden soll, das dieses Live-Objekt darstellt. Dieses verwaltete Objekt stellt eine Komponente eines berechneten hierarchischen Namens dar, die der Management-Agent-Prozess verwenden kann, um das aktive Steuer-Interface des Live-Objekts zur Laufzeit zu ermitteln.
ExecutionState.START=START
ExecutionState.STOP=STOP
StateManageable.displayName=Verwaltbarer Status
StateManageable.description=Die Konfigurationseinstellungen f\u00fcr verwaltete Objekte, die einen Lebenszyklus haben (starten, stoppen usw.).
StateManageable.smallIcon=StateManageable.gif
StateManageable.largeIcon=StateManageable32X32.gif
StateManageable.managedObject.displayName=Verwaltetes Objekt
StateManageable.managedObject.description=Das Objekt, das gestartet oder gestoppt werden kann.
StateManageable.managedObject.ServiceContext.displayName=Servicekontexte
StateManageable.initialState.displayName=Ausgangsstatus
StateManageable.initialState.description=Der Ausf\u00fchrungsstatus, der beim Erststart des Servers angefordert wird.
ServerComponent.StateManageable.initialState.description=Der Ausf\u00fchrungsstatus f\u00fcr die Komponente, der beim Erststart des Servers angefordert wird.
StatisticsProvider.displayName=Statistikprovider
StatisticsProvider.description=Die Konfigurationseinstellungen f\u00fcr verwaltete Objekte, die statistische Informationen wie Leistungsdaten bereitstellen.
StatisticsProvider.smallIcon=StatisticsProvider.gif
StatisticsProvider.largeIcon=StatisticsProvider32X32.gif
StatisticsProvider.managedObject.displayName=Verwaltetes Objekt
StatisticsProvider.managedObject.description=Das Objekt, das die Leistungsmessdaten bereitstellt.
StatisticsProvider.managedObject.ServiceContext.displayName=Servicekontexte
StatisticsProvider.specification.displayName=Spezifikation
StatisticsProvider.specification.description=Eine Spezifikationszeichenfolge, die verwendet werden kann, um die PM-Einstellungen f\u00fcr das verwaltete Objekt festzulegen.
Extension.displayName=Erweiterung
Extension.description=
Extension.smallIcon=Extension.gif
Extension.largeIcon=Extension32X32.gif
Extension.name.displayName=Name
Extension.name.description=
Extension.configURI.displayName=Konfigurations-URI
Extension.configURI.description=
ServerComponent.displayName=Serverkomponente
ServerComponent.description=In dieser Anzeige k\u00f6nnen Sie auf die Konfigurationseinstellungen zugreifen, die sich auf bestimmte Arten von Serverfunktionalit\u00e4t beziehen, z. B. Anwendungsserver, JMS-Server und Name-Namensserver. Je nach Prim\u00e4rtyp des Servers kann die Liste der konfigurierten Serverkomponenten variieren.
ServerComponent.smallIcon=ServerComponent.gif
ServerComponent.largeIcon=ServerComponent32X32.gif
Server.name.displayName=Name
Server.name.description=Der Name des Servers.
Server.adminService.displayName=Administration Services
Server.adminService.description=Verschiedene Einstellungen f\u00fcr das Administrationstool dieses Servers, wie z. B. Einstellungen und Zeitlimits f\u00fcr das in der Administration verwendete DFV-Protokoll.

AdminService.displayName=Administration Service
AdminService.description=Die Servicelogik, die alle Verwaltungsfunktionen in dem verwalteten Prozess steuert.
AdminService.smallIcon=AdminService.gif
AdminService.largeIcon=AdminService32X32.gif
AdminService.connectors.displayName=JMX-Connector
AdminService.connectors.description=Ein Connector ist ein \u00dcbertragungskanal zwischen den von WebSphere verwalteten Prozessen. Die Art des Connector wird anhand des verwendeten \u00dcbertragungsprotokolls festgelegt.
AdminService.connectors.HTTPConnector.displayName=HTTP-Connector
AdminService.connectors.JMSConnector.displayName=JMS-Connector
AdminService.connectors.RMIConnector.displayName=RMI-Connector
AdminService.connectors.SOAPConnector.displayName=SOAP-Connector
AdminService.preferredConnector.displayName=Bevorzugter Connector
AdminService.preferredConnector.description=Der bevorzugte JMX-Connector-Typ. Die verf\u00fcgbaren Optionen wie SOAP-Connector und RMI-Connector werden auf der Seite "JMX-Connector" definiert.
AdminService.preferredConnector.HTTPConnector.displayName=HTTP-Connector
AdminService.preferredConnector.JMSConnector.displayName=JMS-Connector
AdminService.preferredConnector.RMIConnector.displayName=RMI-Connector
AdminService.preferredConnector.SOAPConnector.displayName=SOAP-Connector
AdminService.extensionMBeanProviders.displayName=Provider f\u00fcr Erweiterungs-MBeans
AdminService.extensionMBeanProviders.description=Eine Liste der Bibliotheken, die Elemente enthalten, die ExtensionMBean-Mechanismen f\u00fcr die Erweiterung des Admininistration Service durch weitere JMX-MBeans unterst\u00fctzen.
AdminService.configRepository.displayName=Repository Service
AdminService.configRepository.description=Die Konfigurationsdaten, die von der Implementierung des Repository Service verwendet werden.
AdminService.standalone.displayName=Eigenst\u00e4ndig
AdminService.standalone.description=Gibt an, ob der Serverprozess zu einer Network-Deployment-Zelle geh\u00f6rt oder nicht. Wenn der Server zu einer Network-Deployment-Zelle geh\u00f6rt, nimmt der Server nicht an der verteilten Verwaltung teil. Geh\u00f6rt der Server nicht zu einer Network-Deployment-Zelle, ist der Server Teil des Network-Deployment-Systems.
JMXConnector.displayName=JMX-Connector
JMXConnector.description=Ein Connector ist ein \u00dcbertragungskanal zwischen den von WebSphere verwalteten Prozessen. Die Art des Connector wird anhand des verwendeten \u00dcbertragungsprotokolls festgelegt.
JMXConnector.smallIcon=JMXConnector.gif
JMXConnector.largeIcon=JMXConnector32X32.gif
JMXConnector.properties.displayName=Benutzerdefinierte Merkmale
JMXConnector.properties.description=Vom Benutzer ausgew\u00e4hlte Konfigurationswerte f\u00fcr diesen JMX-Connector.
jmx=JMX-Connector
ExtensionMBean.displayName=Erweiterungs-MBean
ExtensionMBean.description=Gibt an, wo die Metadaten f\u00fcr die MBean abgelegt sind.
ExtensionMBean.smallIcon=ExtensionMBean.gif
ExtensionMBean.largeIcon=ExtensionMBean32X32.gif
ExtensionMBean.descriptorURI.displayName=Deskriptor-URI
ExtensionMBean.descriptorURI.description=Die Position des MBean-Deskriptors.

ExtensionMBean.type.displayName=Typ
ExtensionMBean.type.description=Der Typ der MBean.
HTTPConnector.displayName=HTTP-Connector
HTTPConnector.description=Ein JMX-Connector, der das \u00dcbertragungsprotokoll HTTP unterst\u00fctzt.
HTTPConnector.smallIcon=HTTPConnector.gif
HTTPConnector.largeIcon=HTTPConnector32X32.gif
JMSConnector.displayName=JMS-Connector
JMSConnector.description=In Version 5.0 ist kein JMS-Connector implementiert. Dieser Punkt wird erst in sp\u00e4teren Releases ber\u00fccksichtigt.
JMSConnector.smallIcon=JMSConnector.gif
JMSConnector.largeIcon=JMSConnector32X32.gif
RMIConnector.displayName=RMI-Connector
RMIConnector.description=Ein JMX-Connector, der das \u00dcbertragungsprotokoll RMI unterst\u00fctzt.
RMIConnector.smallIcon=RMIConnector.gif
RMIConnector.largeIcon=RMIConnector32X32.gif
SOAPConnector.displayName=SOAP-Connector
SOAPConnector.description=Ein JMX-Connector, der das \u00dcbertragungsprotokoll SOAP unterst\u00fctzt.
SOAPConnector.smallIcon=SOAPConnector.gif
SOAPConnector.largeIcon=SOAPConnector32X32.gif
RepositoryService.displayName=Repository Service
RepositoryService.description=Die Servicelogik, die das Konfigurations-Repository verwaltet.
RepositoryService.smallIcon=RepositoryService.gif
RepositoryService.largeIcon=RepositoryService32X32.gif
RepositoryService.lockTimeout.displayName=Zeitlimit f\u00fcr Sperren
RepositoryService.lockTimeout.units=Minuten
RepositoryService.lockTimeout.description=Gibt die Anzahl der Minuten an, die vergehen m\u00fcssen, bevor eine Repository-Sperre, die nicht manuell freigegeben wurde, automatisch freigegeben wird.
RepositoryService.auditEnabled.displayName=Pr\u00fcfung aktiviert
RepositoryService.auditEnabled.description=Repository-Aktualisierungen in der Protokolldatei \u00fcberpr\u00fcfen.
ExtensionMBeanProvider.displayName=Provider f\u00fcr Erweiterungs-MBeans
ExtensionMBeanProvider.description=Eine Bibliothek, die eine Implementierung einer JMX-MBean und die zugeh\u00f6rige XML-Deskriptordatei f\u00fcr die MBean enth\u00e4lt und die vorhandenen von WebSphere verwalteten Ressourcen im Hauptadministrationssystem erweitert.

ExtensionMBeanProvider.smallIcon=ExtensionMBeanProvider.gif
ExtensionMBeanProvider.largeIcon=ExtensionMBeanProvider32X32.gif
ExtensionMBeanProvider.extensionMBeans.displayName=Erweiterungs-MBeans
ExtensionMBeanProvider.extensionMBeans.description=MBean-Definitionen, die nicht mit dem WebSphere-Basisprodukt bereitgestellt werden.
ExtensionMBeanProvider.classpath.displayName=Klassenpfad
ExtensionMBeanProvider.classpath.description=Der Klassenpfad in der Providerbibliothek, in dem Sie den Deskriptor der MBean finden. Der Klassenlader ben\u00f6tigt diese Informationen, um die XML-Deskriptordatei der Erweiterungs-MBean zu laden und syntaktisch zu analysieren.
ExtensionMBeanProvider.description.displayName=Beschreibung
ExtensionMBeanProvider.description.description=Ein beliebiger beschreibender Text f\u00fcr die Konfiguration des Provider der Erweiterungs-MBean. In diesem Feld k\u00f6nnen Sie eine Beschreibung f\u00fcr die Providerkonfiguration eingeben.
ExtensionMBeanProvider.name.displayName=Name
ExtensionMBeanProvider.name.description=Ein Name f\u00fcr die Providerbibliothek der Erweiterungs-MBean.
JMXConnector.type.displayName=Typ
JMXConnector.type.description=Der Typ des JMX-Connector.

JavaProcessDef.displayName=Java-Prozessdefinition
JavaProcessDef.description=Java-Prozesse erfordern zus\u00e4tzliche Informationen, die beim Erzeugen des Prozesses an die JVM (Java Virtual Machine) \u00fcbergeben werden k\u00f6nnen.
JavaProcessDef.smallIcon=JavaProcessDef.gif
JavaProcessDef.largeIcon=JavaProcessDef32X32.gif
JavaProcessDef.jvmEntries.displayName=JVM-Eintr\u00e4ge
JavaProcessDef.jvmEntries.description=Eine Liste der Konfigurationen f\u00fcr Java Virtual Machines, die diesem Server zugeordnet sind.
JavaProcessDef.executableTargetKind.displayName=Art des ausf\u00fchrbaren Zielobjekts
JavaProcessDef.executableTargetKind.description=Gibt an, ob ein Java-Klassenname oder der Name einer ausf\u00fchrbaren JAR-Datei als ausf\u00fchrbares Ziel dieses Java-Prozesses verwendet werden soll.
JavaProcessDef.executableTarget.displayName=Ausf\u00fchrbares Zielobjekt
JavaProcessDef.executableTarget.description=In Abh\u00e4ngigkeit von der Einstellung des Feldes 'Art des ausf\u00fchrbaren Zielobjekts' der Name des ausf\u00fchrbaren Ziels (eine Java-Klasse mit der Methode main() oder der Name einer ausf\u00fchrbaren JAR-Datei).
ProcessDef.displayName=Prozessdefinition
ProcessDef.description=In einer Prozessdefinition sind die Befehlszeileninformationen enthalten, die zum Starten und Initialisieren eines Prozesses erforderlich sind.
ProcessDef.smallIcon=ProcessDef.gif
ProcessDef.largeIcon=ProcessDef32X32.gif
ProcessDef.execution.displayName=Prozessausf\u00fchrung
ProcessDef.execution.description=Merkmale, die die Ausf\u00fchrung des Betriebssystemprozesses steuern, wie z. B. RunAs-Berechtigungen, Umask, Prozesspriorit\u00e4t.
ProcessDef.ioRedirect.displayName=Prozessprotokolle
ProcessDef.ioRedirect.description=Merkmale, die die Weiterleitung der nativen Ein-/Ausgabedatenstr\u00f6me von Prozessen steuern.
ProcessDef.environment.displayName=Umgebungseintr\u00e4ge
ProcessDef.environment.description=Eine Liste mit Eintr\u00e4gen, die der Ausf\u00fchrungsumgebung f\u00fcr den Prozess hinzugef\u00fcgt werden soll.
ProcessDef.monitoringPolicy.displayName=\u00dcberwachungs-Policy
ProcessDef.monitoringPolicy.description=Merkmale, die die \u00dcberwachung des Prozesses durch den Node Agent steuern.
ProcessDef.executableName.displayName=Name der ausf\u00fchrbaren Datei.
ProcessDef.executableName.description=Der Name der ausf\u00fchrbaren Datei des Prozesses.
ProcessDef.executableArguments.displayName=Argumente f\u00fcr ausf\u00fchrbare Datei
ProcessDef.executableArguments.description=Gibt die ausf\u00fchrbaren Befehle an, die ausgef\u00fchrt werden, wenn der Prozess gestartet wird.
ProcessDef.workingDirectory.displayName=Arbeitsverzeichnis
ProcessDef.workingDirectory.description=Das Verzeichnis im Dateisystem, in dem der Prozess ausgef\u00fchrt wird.
ProcessExecution.displayName=Prozessausf\u00fchrung
ProcessExecution.description=Konfiguration weiterer Einstellungen f\u00fcr die Prozessausf\u00fchrung. Diese Werte werden auf der Windows-Plattform nicht verwendet.
ProcessExecution.smallIcon=ProcessExecution.gif
ProcessExecution.largeIcon=ProcessExecution32X32.gif
ProcessExecution.processPriority.displayName=Prozesspriorit\u00e4t
ProcessExecution.processPriority.description=Gibt die Betriebssystempriorit\u00e4t f\u00fcr den Prozess an. Dieser Wert kann nur vom Benutzer root ge\u00e4ndert werden.
ProcessExecution.umask.displayName=UMASK
ProcessExecution.umask.description=Die Benutzermaske, unter der der Prozess ausgef\u00fchrt wird (die Berechtigungsmaske f\u00fcr den Dateimodus).
ProcessExecution.runAsUser.displayName=RunAs-Benutzer
ProcessExecution.runAsUser.description=Der Benutzername, unter dem der Prozess ausgef\u00fchrt wird.
ProcessExecution.runAsGroup.displayName=RunAs-Gruppe
ProcessExecution.runAsGroup.description=Die Gruppe, zu der der Prozess geh\u00f6rt und unter der er ausgef\u00fchrt wird.
ProcessExecution.runInProcessGroup.displayName=Ausf\u00fchren in Prozessgruppe
ProcessExecution.runInProcessGroup.description=Gibt einen Prozess f\u00fcr eine bestimmte Prozessgruppe an. Die Verwendung dieses Attributs empfiehlt sich beispielsweise f\u00fcr die Einteilung von Prozessoren. Der Systemadministrator kann eine Prozessgruppe beispielsweise so zuordnen, dass sie auf 6 von 12 Prozessoren ausgef\u00fchrt wird. Bei Auswahl des Standardwerts (0) wird der Prozess keiner bestimmten Gruppe zugeordnet.
OutputRedirect.displayName=Umleitung der Ausgabe
OutputRedirect.description=Leitet die Standardeingabe, die Standardausgabe und Fehlerdatenstr\u00f6me in die hier angegebenen Dateien um.
OutputRedirect.smallIcon=OutputRedirect.gif
OutputRedirect.largeIcon=OutputRedirect32X32.gif
OutputRedirect.stdinFilename.displayName=Dateiname f\u00fcr Standardeingabe
OutputRedirect.stdinFilename.description=Leitet die Dateiein- und -ausgabe f\u00fcr Standarddatenstr\u00f6me um.
OutputRedirect.stdoutFilename.displayName=Dateiname f\u00fcr Standardausgabe
OutputRedirect.stdoutFilename.description=Die Datei, in die der Standardausgabedatenstrom umgeleitet wird. Der Dateiname kann einen symbolischen Pfadnamen enthalten, der in den Variableneintr\u00e4gen definiert ist.
OutputRedirect.stderrFilename.displayName=Dateiname f\u00fcr Standardfehler
OutputRedirect.stderrFilename.description=Die Datei, in die der Standardfehlerdatenstrom umgeleitet wird. Der Dateiname kann einen symbolischen Pfadnamen enthalten, der in den Variableneintr\u00e4gen definiert ist.
JavaVirtualMachine.displayName=Java Virtual Machine
JavaVirtualMachine.description=Erweiterte Einstellungen f\u00fcr die JVM.
JavaVirtualMachine.smallIcon=JavaVirtualMachine.gif
JavaVirtualMachine.largeIcon=JavaVirtualMachine32X32.gif
JavaVirtualMachine.systemProperties.displayName=Benutzerdefinierte Merkmale
JavaVirtualMachine.systemProperties.description=Java-Systemmerkmale, die im Speicher f\u00fcr diese JVM gesetzt werden sollen.
ManagedObject.stateManagement.description=Die M\u00f6glichkeit, den Status der verwalteten Ressource zu steuern, d. h. sie zu starten und zu stoppen.
JavaVirtualMachine.classpath.displayName=Klassenpfad
JavaVirtualMachine.classpath.description=Der Standardklassenpfad, in dem die JVM nach Klassen sucht.
JavaVirtualMachine.bootClasspath.displayName=Boot-Klassenpfad
JavaVirtualMachine.bootClasspath.description=Die Bootstrap-Klassen und -Ressourcen f\u00fcr eine JVM. Diese Option ist nur f\u00fcr JVMs verf\u00fcgbar, die Bootstrap-Klassen und -Ressourcen unterst\u00fctzen. Wenn Sie mehrere Pfad angeben, k\u00f6nnen Sie diese durch einen Doppelpunkt (:) oder ein Semikolon (;) trennen. Das zu verwendende Trennzeichen ist abh\u00e4ngig vom Betriebssystem des Knotens.
JavaVirtualMachine.verboseModeClass.displayName=Ausf\u00fchrliche Ausgabe zum Laden der Klasse
JavaVirtualMachine.verboseModeClass.description=Bei Auswahl dieser Option werden ausf\u00fchrliche Debug-Nachrichten zum Laden der Klasse ausgegeben. Standardm\u00e4\u00dfig ist die ausf\u00fchrliche Ausgabe nicht aktiviert.
JavaVirtualMachine.verboseModeGarbageCollection.displayName=Ausf\u00fchrliche Ausgabe zur Garbage-Collection
JavaVirtualMachine.verboseModeGarbageCollection.description=Bei Auswahl dieser Option werden ausf\u00fchrliche Debug-Nachrichten zur Garbage-Collection ausgegeben. Standardm\u00e4\u00dfig ist die ausf\u00fchrliche Ausgabe nicht aktiviert.
JavaVirtualMachine.verboseModeJNI.displayName=Ausf\u00fchrliche Ausgabe zu JNI
JavaVirtualMachine.verboseModeJNI.description=Bei Auswahl dieser Option werden ausf\u00fchrliche Debug-Nachrichten zu den Aufrufen nativer Methoden ausgegeben. Standardm\u00e4\u00dfig ist die ausf\u00fchrliche Ausgabe nicht aktiviert.
JavaVirtualMachine.initialHeapSize.displayName=Ausgangsgr\u00f6\u00dfe des Heap-Speichers
JavaVirtualMachine.initialHeapSize.description=Gibt die Ausgangsgr\u00f6\u00dfe des Heap-Speichers an, die der JVM (in MB) zur Verf\u00fcgung steht.

JavaVirtualMachine.maximumHeapSize.displayName=Maximale Gr\u00f6\u00dfe des Heap-Speichers
JavaVirtualMachine.maximumHeapSize.description=Gibt die maximale Gr\u00f6\u00dfe des Heap-Speichers f\u00fcr die JVM (in MB) an. Der Standardwert ist 256.
JavaVirtualMachine.runHProf.displayName=HProf ausf\u00fchren
JavaVirtualMachine.runHProf.description=Bei Auswahl dieser Option wird die Unterst\u00fctzung f\u00fcr den HProf-Profiler aktiviert. Wenn Sie einen anderen Profiler verwenden m\u00f6chten, geben Sie im Feld "HProf-Argumente" die Einstellungen f\u00fcr den benutzerdefinierten Profiler an. Standardm\u00e4\u00dfig ist die Unterst\u00fctzung f\u00fcr den HProf-Profiler nicht aktiviert.
JavaVirtualMachine.hprofArguments.displayName=HProf-Argumente
JavaVirtualMachine.hprofArguments.description=Gibt die Argumente f\u00fcr den Befehlszeilen-Profiler an, die an die JVM \u00fcbergeben werden, die den Anwendungsserverprozess startet. Sie k\u00f6nnen nur dann Argumente angeben, wenn die Unterst\u00fctzung f\u00fcr HProf-Profiler aktiviert ist.
JavaVirtualMachine.debugMode.displayName=Debug-Modus
JavaVirtualMachine.debugMode.description=Bei Auswahl dieser Option wird die Debug-Ausgabe der JVM aktiviert. Standardm\u00e4\u00dfig ist die Unterst\u00fctzung des Debug-Modus nicht aktiviert.
JavaVirtualMachine.debugArgs.displayName=Debug-Argumente
JavaVirtualMachine.debugArgs.description=Gibt die Befehlszeilenparameter f\u00fcr den Debugger an, die an die JVM \u00fcbergeben werden, die den Anwendungsserverprozess startet. Sie k\u00f6nnen nur dann Argumente angeben, wenn der Debug-Modus aktiviert ist.
JavaVirtualMachine.genericJvmArguments.displayName=Generische JVM-Argumente
JavaVirtualMachine.genericJvmArguments.description=Weitere Befehlszeilenparameter f\u00fcr die JVM.
JavaVirtualMachine.executableJarFileName.displayName=Name der ausf\u00fchrbaren JAR-Datei
JavaVirtualMachine.executableJarFileName.description=Der vollst\u00e4ndige Pfad einer ausf\u00fchrbaren JAR-Datei, die die JVM verwendet.
JavaVirtualMachine.disableJIT.displayName=JIT inaktivieren
JavaVirtualMachine.disableJIT.description=Bei Auswahl dieser Option wird die JVM so konfiguriert, dass der JIT-Compiler (Just-In-Time) inaktiviert ist.
JavaVirtualMachine.osName.displayName=Name des Betriebssystems
JavaVirtualMachine.osName.description=Die JVM-Einstellungen f\u00fcr ein bestimmtes Betriebssystem. Der Prozess verwendet beim Starten die JVM-Einstellungen f\u00fcr das Betriebssystem des Knotens.
MonitoringPolicy.displayName=\u00dcberwachungs-Policy
MonitoringPolicy.description=Policy-Einstellungen f\u00fcr die Leistungs\u00fcberwachung des Anwendungsservers.
MonitoringPolicy.smallIcon=MonitoringPolicy.gif
MonitoringPolicy.largeIcon=MonitoringPolicy32X32.gif
MonitoringPolicy.maximumStartupAttempts.displayName=Maximale Anzahl der Startversuche
MonitoringPolicy.maximumStartupAttempts.units=Versuche
MonitoringPolicy.maximumStartupAttempts.description=Gibt an, wie oft maximal versucht wird, den Anwendungsserver zu starten.
MonitoringPolicy.pingInterval.displayName=Ping-Intervall
MonitoringPolicy.pingInterval.units=Sekunden
MonitoringPolicy.pingInterval.description=Gibt an, in welchen Abst\u00e4nden versucht wird, eine Verbindung zwischen Elternprozess (z. B. Node Agent) und dem erzeugten Prozess (z. B. ein Anwendungsserver) herzustellen. Passen Sie diesen Wert den Anforderungen f\u00fcr den Neustart von fehlgeschlagenen Serverprozessen entsprechend an. Wenn Sie einen kleineren Wert w\u00e4hlen, werden Fehler eher festgestellt. Ein h\u00f6herer Wert verringert die Anzahl der Ping-Aufrufe und damit auch den Systemaufwand.
MonitoringPolicy.pingTimeout.displayName=Ping-Zeitlimit
MonitoringPolicy.pingTimeout.units=Sekunden
MonitoringPolicy.pingTimeout.description=Der Zeitraum, nach dem ein \u00fcberwachter Prozess als fehlerhaft eingestuft wird, falls keine Anwort erhalten wird.
MonitoringPolicy.pingInitialTimeout.displayName=Ping-Ausgangszeitlimit
MonitoringPolicy.pingInitialTimeout.units=Sekunden
MonitoringPolicy.pingInitialTimeout.description=Gibt das Zeitlimit (in Sekunden) f\u00fcr die Durchf\u00fchrung der Serverinitialisierung an. Nach Ablauf dieses Zeitlimits versucht der Administrationsserver, den Server erneut zu starten.
MonitoringPolicy.autoRestart.displayName=Automatischer Neustart
MonitoringPolicy.autoRestart.description=Bei Auswahl dieser Option wird der Prozess nach einem Fehler automatisch erneut gestartet. Dies ist auch die Standardeinstellung.
MonitoringPolicy.nodeRestartState.displayName=Neustartstatus des Knotens
MonitoringPolicy.nodeRestartState.description=Gibt den Verarbeitungsstatus an, der gesetzt wird, wenn die Option f\u00fcr automatischen Neustart aktiviert ist. Die g\u00fcltigen Optionen sind GESTOPPT, AKTIV und RUNNING und VORHERIG. Der Standardwert ist GESTOPPT.
ExecutableTargetKind.JAVA_CLASS=JAVA-KLASSE
ExecutableTargetKind.EXECUTABLE_JAR=AUSF\u00dcHRBARES JAR
RestartStateKind.STOPPED=GESTOPPT
RestartStateKind.RUNNING=AKTIV
RestartStateKind.PREVIOUS=VORHERIG

Server.services.DebugService.displayName=Debugging Service
Server.services.DebugService.description=Geben Sie die Einstellungen f\u00fcr den Debugging Service ein, die zusammen mit einer Debug-Clientanwendung f\u00fcr den Arbeitsbereich verwendet werden sollen.
DebugService.displayName=Debugging Service
DebugService.description=Ein Modell der Attribute, die f\u00fcr das Debugging einer JVM und verschiedener Komponenten wie dem BSF-Manager erforderlich sind.
DebugService.smallIcon=DebugService.gif
DebugService.largeIcon=DebugService32X32.gif
DebugService.jvmDebugPort.displayName=JVM-Debug-Port
DebugService.jvmDebugPort.description=Der Port, an dem die JVM auf Debug-Verbindungen wartet.

DebugService.jvmDebugArgs.displayName=JVM-Debug-Argumente
DebugService.jvmDebugArgs.description=Die Zeichenfolge f\u00fcr das Debug-Argument, mit der die JVM angewiesen wird, um Debug-Modus zu starten.

DebugService.debugClassFilters.displayName=Filter f\u00fcr Debug-Klassen
DebugService.debugClassFilters.description=Der Bereich von Klassen, die vom Debugging ausgeschlossen werden sollen. Wenn Sie den Debugger im Step-Modus ausf\u00fchren, stoppt er nicht bei den Klassen, die einem Filtereintrag entsprechen.

DebugService.BSFDebugPort.displayName=BSF-Debug-Port
DebugService.BSFDebugPort.description=Der Port, an dem der BSF Debug Manager empfangsbereit ist.

DebugService.BSFLoggingLevel.displayName=BSF-Protokollstufe
DebugService.BSFLoggingLevel.description=Die Protokollstufe, die der BSF Debug Manager bereitstellt.
servermanagement.button.add=Hinzuf\u00fcgen>
BSFLoggingLevel.NOLOGGING=0 - Keine Protokollierung
BSFLoggingLevel.SOMELOGGING=1 - Teilprotokollierung

BSFLoggingLevel.MORELOGGING=2 - Ausf\u00fchrlichere Protokollierung
BSFLoggingLevel.LOTOFLOGGING=3 - Ausf\u00fchrliche Protokollierung
DebugService.portchanged.info1=Die JVM-Debug-Argumente des Debugging Service wurden mit denen des angegebenen Debug-Port f\u00fcr den Debug-Service synchronisiert.
DebugService.portchanged.info2= Der JVM-Debug-Port wurde mit dem mit der Adresse angegebenen JVM-Debug-Port synchronisiert.

JMSServer.displayName=JMS-Server
JMSServer.description=Die JMS-Funktionen auf einem Knoten in der WAS-Administrationsdom\u00e4ne werden vom JMS-Server auf diesem Knoten bereitgestellt. Verwenden Sie diese Anzeige, um die Konfigurationsmerkmale des ausgew\u00e4hlten JMS-Servers anzuzeigen und zu \u00e4ndern.
JMSServer.smallIcon=JMSServer.gif
JMSServer.largeIcon=JMSServer32X32.gif
JMSServer.securityPort.displayName=Endpoint f\u00fcr Sicherheits-Port
JMSServer.securityPort.description=Der TCP/IP-Port des Listener, der intern vom JMS-Server verwendet wird.
JMSServer.description.displayName=Beschreibung
JMSServer.description.description=Eine Beschreibung des JMS-Servers (f\u00fcr Verwaltungszwecke).
JMSServer.numThreads.displayName=Anzahl Threads
JMSServer.numThreads.description=Die Anzahl der von der Steuerkomponente f\u00fcr Pub/Sub-Abgleich gleichzeitig ausf\u00fchrbaren Threads.
JMSServer.queueNames.displayName=Warteschlangennamen
JMSServer.queueNames.description=Die Namen der Warteschlangen auf diesem JMS-Server.
JMSServer.must.be.selected=Sie m\u00fcssen zur Ausf\u00fchrung dieser Aktion mindestens einen JMS-Server ausw\u00e4hlen.
jmsserver.cannot.be.started=Der JMS-Server kann nicht gestartet werden, weil Embedded Messaging nicht auf Knoten {0} installiert ist.
JMSTransport.displayName=JMS-Transport
JMSTransport.description=
JMSTransport.smallIcon=JMSTransport.gif
JMSTransport.largeIcon=JMSTransport32X32.gif
EndPoint.displayName=Endpoint f\u00fcr Sicherheits-Port
EndPoint.description=Beschreibung des Endpoint f\u00fcr Sicherheits-Port
EndPoint.host.displayName=Host
EndPoint.host.description=Die IP-Adresse, der DNS-Hostname mit Dom\u00e4nennamenssuffix oder einfach der DNS-Hostname, der von einem Client verwendet wird, um eine Web-Anwendungsressource (z. B. ein Servlet, eine JSP oder eine HTML-Seite) anzufordern.
EndPoint.port.displayName=Port            
EndPoint.port.description=Der Port, der f\u00fcr den Webserver konfiguriert wurde, um Clientanforderungen entgegen zu nehmen. Geben Sie einen Port-Wert zusammen mit dem Hostnamen an.

NameServer.displayName=Namensserver
NameServer.description=Die Einstellungen des Namensserviceprovider f\u00fcr den Anwendungsserver.
NameServer.smallIcon=NameServer.gif
NameServer.largeIcon=NameServer32X32.gif
NameServer.bootstrapServerAddress.displayName=Adresse des Bootstrap-Servers
NameServer.bootstrapServerAddress.description=Die Adresse des Bootstrap-Servers ist der Endpoint f\u00fcr den Bootstrap-Server des Namensservers. Ein Endpoint setzt sich aus einem Hostnamen und einer Port-Nummer zusammen. Clients des Namensservice geben Host und Port des Bootstrap-Servers an, um einen Ausgangsnamenskontext vom zugeordneten Namensserver abzurufen.

Service.type.displayName=Servicetyp
Service.type.description=Der Typ des Service.
nav.websphere.servers    
Domain.webcontainers.displayName=Webcontainer

webcontainer.description=Webcontainer konfigurieren
webcontainer.detail.title=Webcontainer
webcontainer.displayName=Webcontainer
webcontainer.threadpool.displayName=Thread-Pool
webcontainer.sessionmanager.displayName=Sitzungsverwaltung
webcontainer.sessionmanager.description=Den Session Manager konfigurieren, der diesem Webcontainer zugeordnet ist.
webcontainer.httptransports.displayName=HTTP-Transporte
webcontainer.httptransports.description=Die HTTP-Transporte konfigurieren, die diesem Webcontainer zugeordnet sind.
webcontainer.virtualhost.displayName=Virtueller Standardhost:
webcontainer.virtualhost.description=Der virtuelle Standardhost f\u00fcr diesen Server.
webcontainer.enableServletCaching.displayName=Servlet-Caching
webcontainer.enableServletCaching.description=Servlet-Caching aktivieren.
webcontainer.enableServletCaching.units=Servlet-Caching aktivieren


ThreadPool.size.units=Threads
ThreadPool.inactivityTimeout.displayName=Zeitlimit f\u00fcr Thread-Inaktivit\u00e4t
ThreadPool.inactivityTimeout.units=Millisekunden
ThreadPool.isGrowable.units=Thread-Zuordnung \u00fcber die maximale Gr\u00f6\u00dfe des Thread-Pools hinaus zulassen

SessionManager.sessionTracking.displayName=Verfahren der Sitzungs\u00fcberwachung:
SessionManager.displayName=Sitzungsverwaltung
SessionManager.sessionDatabasePersistence.description=Optimierungsparameter f\u00fcr eine verteilte Umgebung definieren.
SessionManager.tuningParams.displayName=Benutzerdefinierte Optimierungsparameter
SessionManager.description=Mit den Konfigurationsmerkmalen des Session Manager k\u00f6nnen Sie die Unterst\u00fctzung f\u00fcr HTTP-Sitzungen steuern.
SessionManager.sessionTracking.description=Ein Verfahren f\u00fcr die Verwaltung von HTTP-Sitzungen.
SessionManager.overflow.displayName=\u00dcberlauf:
SessionManager.overflow.description=Bei Auswahl dieser Option werden mehr Sitzungen im Speicher zugelassen, als mit dem Merkmal "Maximale Anzahl der Sitzungen im Speicher" festgelegt wurden. Diese Einstellung gilt nur f\u00fcr nicht persistente Sitzungen.
SessionManager.overflow.units=\u00dcberlauf zulassen
SessionManager.sessionCount.displayName=Maximale Anzahl der Sitzungen im Speicher:
SessionManager.sessionCount.description=Gibt die maximale Anzahl von Sitzungen an, die im Speicher verwaltet werden k\u00f6nnen.
SessionManager.sessionTimeout.displayName=Sitzungszeitlimit:
SessionManager.sessionTimeout.description=Gibt den Zeitraum an, in dem eine Sitzung ungenutzt bleiben kann. Nach Ablauf dieses Zeitraums wird die Sitzung als ung\u00fcltig betrachtet. Die g\u00fcltigen Optionen sind "Zeitlimit festlegen" und "Kein Zeitlimit". Wenn Sie das Zeitlimit festlegen, m\u00fcssen Sie einen Wert von mindestens zwei Minuten angeben.
SessionManager.sessionTimeout.noTimeout=Kein Zeitlimit
SessionManager.sessionTimeout.setTimeout=Zeitlimit festlegen
SessionManager.sessionTimeout.units=Minuten
SessionManager.sessionTracking.sslEnabled=\u00dcberwachung von SSL-IDs aktivieren
SessionManager.sessionTracking.cookiesEnabled=Cookies aktivieren
SessionManager.sessionTracking.urlRewritingEnabled=Umschreiben von URLs aktivieren
SessionManager.sessionTracking.protocolRewritingEnabled=Umschreiben von URLs bei Protokollwechsel aktivieren
SessionManager.sessionCount.units=Sitzungen
SessionManager.button.modify=\u00c4ndern...
SessionManager.defaultCookieSettings.displayName=Cookie-Einstellungen
SessionManager.persistence.displayName=Einstellungen f\u00fcr eine verteilte Umgebung
SessionManager.persistence.description=Der Persistenztyp f\u00fcr Sitzungen.
SessionManager.serialAccess.displayName=Sitzungszugriff serialisieren:
SessionManager.serialAccess.description=Bei Auswahl dieser Option wird der gleichzeitige Zugriff auf Sitzungen in einem bestimmten Server (JVM) nicht zugelassen.
SessionManager.serialAccess.units=Seriellen Zugriff zulassen
SessionManager.maxWaitTime.displayName=Maximale Wartezeit
SessionManager.maxWaitTime.description=Beschreibung der maximalen Wartezeit
SessionManager.maxWaitTime.units=Sekunden
SessionManager.accessOnTimeout.displayName=Sitzungszugriff bei Zeitlimit\u00fcberschreitung
SessionManager.accessOnTimeout.description=Beschreibung des Zeitlimits
SessionManager.accessOnTimeout.units=Zugriff bei Zeitlimit\u00fcberschreitung zulassen
SessionManager.enable.displayName=Sitzungsverwaltung \u00fcberschreiben
SessionManager.enable.description=Gibt an, ob diese Einstellungen f\u00fcr den Session Manager f\u00fcr das aktuelle Modul verwendet werden sollen. Standardm\u00e4\u00dfig werden die im Elternobjekt definierten Einstellungen f\u00fcr den Session Manager verwendet.
SessionManager.enable.units=\u00dcberschreiben
SessionManager.securityIntegration.displayName=Sicherheitsintegration
SessionManager.securityIntegration.description=Wenn die Sicherheitsintegration aktiviert ist, ordnet der Session Manager die Identit\u00e4t der Benutzer ihren HTTP-Sitzungen zu.
SessionManager.securityIntegration.units=Aktivieren

Cookie.displayName=Cookies
Cookie.description=Cookie-Einstellungen f\u00fcr die Verwaltung von HTTP-Sitzungen angeben.
Cookie.secure.displayName=Sichere Cookies
Cookie.secure.units=Cookies auf HTTPS-Sitzungen beschr\u00e4nken
Cookie.domain.displayName=Cookie-Dom\u00e4ne
Cookie.maximumAge.displayName=Maximale Cookie-Lebensdauer
Cookie.path.displayName=Cookie-Pfad
Cookie.name.displayName=Cookie-Name
Cookie.name.description=Der f\u00fcr die Sitzungsverwaltung zu verwendende eindeutige Name des Cookie. Gem\u00e4\u00df Servlet-Spezifikation ist der Name JSESSIONID zu verwenden. Aus Flexibilit\u00e4tsgr\u00fcnden ist dieser Wert jedoch konfigurierbar.
Cookie.secure.description=Gibt an, ob Sitzungs-Cookies das Feld f\u00fcr sichere \u00dcbertragung beinhalten. Wenn Sie diese Funktion aktivieren, wird der Austausch von Cookies auf HTTPS-Sitzungen beschr\u00e4nkt.
Cookie.domain.description=Der Wert des Dom\u00e4nenfelds eines Cookie zur Sitzungs\u00fcberwachung. Dieser Wert gibt dem Browser vor, ob ein Cookie an bestimmte Server gesendet werden soll. Wenn Sie beispielsweise eine bestimmte Dom\u00e4ne angeben, werden die Sitzungs-Cookies nur an Hosts in dieser Dom\u00e4ne gesendet. Die Standarddom\u00e4ne ist der Server.
Cookie.maximumAge.description=Die Lebensdauer des Cookie im Client-Browser. Dieser Wert entspricht der in der Cookie-Spezifikation beschriebenen Lebensdauer (TTL, Time to Live).

Cookie.path.description=Diese Einstellung gibt dem Browser anhand des Pfades vor, ob ein Cookie an den angeforderten URI gesendet werden soll. Geben Sie eine beliebige Zeichenfolge ein, die einen Pfad auf dem Server darstellt. Der Schr\u00e4gstrich (/) steht f\u00fcr das Stammverzeichnis. Geben Sie einen Wert an, um die Pfade einzuschr\u00e4nken, an die das Cookie gesendet wird. Auf diese Weise k\u00f6nnen Sie auch verhindern, dass das Cookie an bestimmte URLs auf dem Server gesendet wird. Wenn Sie das Stammverzeichnis angeben, wird das Cookie immer gesendet. Dabei spielt keine Rolle, auf welchen Pfad auf dem angegebenen Server zugegriffen wird.
Cookie.age.browserSession=Aktuelle Browser-Sitzung 

Cookie.age.maximumAge=Maximale Lebensdauer festlegen
Cookie.age.units=Sekunden

Persistence.displayName=Verteilte Sitzungen
Persistence.description=Methode f\u00fcr das Speichern von Sitzungen in einer verteilten Umgebung.
Persistence.button.modify=\u00c4ndern...
Persistence.button.advanced=Erweitert...
Persistence.none=Keine
Persistence.database=Datenbank
Persistence.messaging=Replikation zwischen Speichern
Persistence.domain=Internal-Messaging-Dom\u00e4ne:

SessionManager.sessionDRSPersistence.displayName=DRS-Einstellungen
DRSSettings.both=Client und Server
DRSSettings.bothpp=Push und Pull
DRSSettings.pull=Nur Pull
DRSSettings.push=Nur Push
DRSSettings.none=Nicht gemeinsam benutzt
DRSSettings.client=Nur Client
DRSSettings.server=Nur Server
DRSSettings.replication.domainSelection=Replikator aus der folgenden Dom\u00e4ne ausw\u00e4hlen
DRSSettings.replication.replicators=Replikatoren:

DRSSettings.replication.otherDomain=Replikator aus einer anderen Dom\u00e4ne ausw\u00e4hlen
DRSSettings.replication.address=IP-Adresse:
DRSSettings.replication.port=Port:
DRSSettings.replication.description=W\u00e4hlen Sie einen Replikator f\u00fcr die Speicher-zu-Speicher-Replikation aus.
DRSSettings.replication.displayName=Replikation:
DRSSettings.partition.displayName=F\u00fcr die folgenden Partition-IDs empfangsbereit sein:
DRSSettings.partition.description=Partitionen, auf deren Anforderungen f\u00fcr die Speicher-zu-Speicherreplikation der Session Manager im Servermodus wartet. Die Anzahl der Partitionen wird auf den Seiten 'Interne Replikation verwalten' definiert. Standardm\u00e4\u00dfig wird auf die Anforderungen aller Partitionen gewartet.
DRSSettings.mode.displayName=Laufzeitmodus:
DRSSettings.mode.description=Gibt den Modus f\u00fcr die Steuerung der Datenreplikation an.
DRSSettings.frequency.displayName=Push-Intervall
DRSSettings.frequency.description=Gibt das Intervall an, in dem neue oder ge\u00e4nderte Cache-Eintr\u00e4ge im Push-Modus an andere Server \u00fcbertragen werden.
DRSSettings.frequency.units=Sekunden
DRSSettings.messaging.displayName=Interner Messaging-Server
DRSSettings.messaging.description=Gibt eine Dom\u00e4ne an, aus der Ihre Daten repliziert werden.
DRSSettings.noDomains.error=Es wurden keine Replikationsdom\u00e4nen definiert.


SessionDatabasePersistence.displayName=Datenbankeinstellungen
SessionDatabasePersistence.description=Beschreibung der Datenbankeinstellungen
SessionDatabasePersistence.datasourceJNDIName.displayName=JNDI-Name der Datenquelle:
SessionDatabasePersistence.datasourceJNDIName.description=Gibt den JNDI-Namen der Datenquelle an, aus der der Session Manager Datenbankverbindungen entnimmt.
SessionDatabasePersistence.userId.displayName=Benutzer-ID:
SessionDatabasePersistence.userId.description=Die Benutzer-ID f\u00fcr den Datenbankzugriff.
SessionDatabasePersistence.password.displayName=Kennwort:
SessionDatabasePersistence.password.description=Das Kennwort f\u00fcr den Datenbankzugriff.
SessionDatabasePersistence.password2.displayName=Kennwort best\u00e4tigen:
SessionDatabasePersistence.password2.description=Geben Sie des Kennwort zur Best\u00e4tigung ein zweites Mal ein.
SessionDatabasePersistence.db2RowSize.displayName=DB2-Zeilenl\u00e4nge:
SessionDatabasePersistence.db2RowSize.description=Bei Verwendung einer DB2-Datenbank die Seitengr\u00f6\u00dfe des Tabellenbereichs, die f\u00fcr die Sitzungstabelle konfiguriert wurde. G\u00fcltige Werte sind 4, 8, 16 und 32 K. Die Standardzeilenl\u00e4nge sind 4K.
SessionDatabasePersistence.tableSpaceName.displayName=Name des Tabellenbereichs:
SessionDatabasePersistence.tableSpaceName.description=Tabellenbereich, der f\u00fcr die Sitzungstabelle verwendet werden soll.
SessionDatabasePersistence.multiRowSchema.displayName=Mehrzeiliges Schema
SessionDatabasePersistence.multiRowSchema.description=Gibt an, ob jede Instanz von Anwendungsdaten in eine separate Zeile der Datenbank geschrieben werden soll.
SessionDatabasePersistence.multiRowSchema.units=Mehrzeiliges Schema verwenden
SessionDatabasePersistence.passwords.match.error=Die Kennw\u00f6rter stimmen nicht \u00fcberein. F\u00fcllen Sie beide Kennwortfelder erneut aus.


Tuning.displayName=Optimierungsparameter
Tuning.description=Der Session Manager bietet verschiedene Optimierungsoptionen f\u00fcr die Verwaltung von Sitzungsdaten in einer verteilten Umgebung.
Tuning.level.displayName=Optimierungsebene:
Tuning.level.description=Der Session Manager bietet einige vordefinierte Einstellungen, die sich auf die Leistung auswirken.
Tuning.setting.veryHigh=Sehr hoch (Leistung verbessern)
Tuning.setting.high=Hoch
Tuning.setting.medium=Mittel
Tuning.setting.low=Niedrig (f\u00fcr Ausfall optimieren)
Tuning.setting.custom=Benutzerdefinierte Einstellungen
Tuning.button.modify=\u00c4ndern...

TuningParams.contents.all=Alle Sitzungsattribute
TuningParams.contents.updated=Nur aktualisierte Attribute
TuningParams.frequency.servlet=Ende des Servlet Service
TuningParams.frequency.manual=Manuelle Aktualisierung
TuningParams.frequency.units=Sekunden
TuningParams.frequency.timeBased=Zeitgest\u00fctzt:
TuningParams.database.displayName=Plan f\u00fcr die Bereinigung verteilter Sitzungen erstellen
TuningParams.database.first=Erste Uhrzeit (0-23):
TuningParams.database.second=Zweite Uhrzeit (0-23):
TuningParams.writeFrequency.displayName=Schreibfrequenz
TuningParams.writeContents.displayName=Zu schreibender Inhalt
TuningParams.cleanup.displayName=Plan f\u00fcr die Bereinigung von Sitzungen erstellen:
TuningParams.cleanup.description=In diesem Feld legen Sie fest, wann ung\u00fcltige Sitzungen aus externen Verzeichnissen gel\u00f6scht werden.

Transport.host.displayName=Host
Transport.port.displayName=Port            

Transport.host.description=Die IP-Adresse des Host, an den die Bindung f\u00fcr den Transport erfolgen soll.
Transport.port.description=Der Port, an den die Bindung f\u00fcr den Transport erfolgen soll. Geben Sie eine Port-Nummer zwischen 1 und 65535 an. Sie m\u00fcssen f\u00fcr jede Instanz des Anwendungsservers auf einer Maschine eine eindeutige Port-Nummer festlegen.
Transport.sslEnabled.units=SSL aktivieren

DynamicCache.startup.displayName=Startstatus:
DynamicCache.startup.description=Bei Auswahl dieses Feldes wird der Dynamic Cache Service beim Starten des Servers aktiviert.
DynamicCache.startup.units=Service beim Serverstart aktivieren
DynamicCache.cacheSize.displayName=Cache-Gr\u00f6\u00dfe
DynamicCache.defaultPriority.displayName=Standardpriorit\u00e4t
DynamicCache.diskoffload.displayName=Auslagerung auf die Platte:
DynamicCache.diskoffload.description=Standardm\u00e4\u00dfig verwaltet der Dynamic Cache Service maximal die Anzahl der im Speicher konfigurierten Eintr\u00e4ge. Wenn der Cache ausgesch\u00f6pft ist und neue Eintr\u00e4ge erstellt werden, wird auf der Basis der f\u00fcr jeden Cache-Eintrag konfigurierten Priorit\u00e4t und des zuletzt verwendeten Algorithmus ermittelt, welche Eintr\u00e4ge aus dem Cache gel\u00f6scht werden. Alternativ kann die Auslagerung der Eintr\u00e4ge auf die Platte konfiguriert werden. In diesem Fall werden die Eintr\u00e4ge aus dem Cache in das Dateisystem kopiert (das Verzeichnis ist konfigurierbar) und k\u00f6nnen sp\u00e4ter wieder verwendet werden.
DynamicCache.diskoffload.enable=Auslagerung auf die Platte aktivieren
DynamicCache.diskoffload.location=Auslagerungsverzeichnis:
DynamicCache.diskoffload.hashSize=Hash-Gr\u00f6\u00dfe:
DynamicCache.cachereplication.displayName=Cache-Replikation:
DynamicCache.cachereplication.description=Durch Auswahl dieses Feldes aktivieren Sie die Replikation des Cache.
DynamicCache.cachereplication.enable=Cache-Replikation aktivieren
DynamicCache.cachereplication.advanced=Erweitert...
DynamicCache.cacheGroups.displayName=Externe Cache-Gruppen

ExternalCacheGroup.name.displayName=Name
ExternalCacheGroup.type.displayName=Typ
ExternalCacheGroup.displayName=Externe Cache-Gruppe
ExternalCacheGroup.members.displayName=Member der externen Cache-Gruppe

ExternalCacheGroupMember.address.displayName=Adresse
ExternalCacheGroupMember.adapterBeanName.displayName=Name der Adapter-Bean

ObjectRequestBroker.displayName=ORB-Service
ObjectRequestBroker.description=Konfigurationseinstellungen f\u00fcr den Object Request Broker (ORB).
ObjectRequestBroker.smallIcon=ObjectRequestBroker.gif
ObjectRequestBroker.largeIcon=ObjectRequestBroker32X32.gif
ObjectRequestBroker.interceptors.displayName=Interceptor
ObjectRequestBroker.interceptors.description=Liste der Interceptor, die der ORB bei jeder IIOP-Anforderung aufruft.
ObjectRequestBroker.plugins.displayName=Plug-ins
ObjectRequestBroker.plugins.description=Liste der Plug-ins, die der ORB w\u00e4hrend der ORB-Initialisierung aufruft.
ObjectRequestBroker.lsdConnection.displayName=LSD-Verbindung
ObjectRequestBroker.lsdConnection.description=Eine Referenz auf den Location Service Daemon (LSD), den der ORB verwendet, wenn indirekte IORs aufgel\u00f6st werden m\u00fcssen.
ObjectRequestBroker.threadPool.displayName=Thread-Pool
ObjectRequestBroker.threadPool.description=Die Einstellungen f\u00fcr den Thread-Pool des ORB.
ObjectRequestBroker.ssl.displayName=SSL
ObjectRequestBroker.ssl.description=Die SSL-Einstellungen des Servers.
ObjectRequestBroker.requestTimeout.displayName=Zeitlimit f\u00fcr Anforderung
ObjectRequestBroker.requestTimeout.units=Sekunden
ObjectRequestBroker.requestTimeout.description=Gibt an, wie lange auf eine Anforderungsnachricht gewartet wird.
ObjectRequestBroker.requestRetriesCount.displayName=Anzahl der Anforderungswiederholungen
ObjectRequestBroker.requestRetriesCount.units=Wiederholungen
ObjectRequestBroker.requestRetriesCount.description=Gibt an, wie oft der ORB versucht, eine Anforderung zu senden, wenn ein Server ausf\u00e4llt. Durch die Sendewiederholung k\u00f6nnen tempor\u00e4re Netzfehler manchmal behoben werden.
ObjectRequestBroker.requestRetriesDelay.displayName=Verz\u00f6gerung zwischen Anforderungswiederholungen
ObjectRequestBroker.requestRetriesDelay.units=Millisekunden
ObjectRequestBroker.requestRetriesDelay.description=Der Zeitraum (in Millisekunden) zwischen den Anforderungswiederholungen.
ObjectRequestBroker.connectionCacheMaximum.displayName=Maximalgr\u00f6\u00dfe des Verbindungs-Cache
ObjectRequestBroker.connectionCacheMaximum.units=Verbindungen
ObjectRequestBroker.connectionCacheMaximum.description=Die maximal Anzahl von Verbindungen, die im Verbindungs-Cache des Service zugelassen wird.
ObjectRequestBroker.connectionCacheMinimum.displayName=Mindestgr\u00f6\u00dfe des Verbindungs-Cache
ObjectRequestBroker.connectionCacheMinimum.units=Verbindungen
ObjectRequestBroker.connectionCacheMinimum.description=Die Mindestanzahl von Verbindungen, die im Verbindungs-Cache des Service zugelassen wird.
ObjectRequestBroker.commTraceEnabled.displayName=ORB-Tracing
ObjectRequestBroker.commTraceEnabled.description=Aktiviert das Tracing f\u00fcr ORB-GIOP-Nachrichten. Diese Einstellung wird ignoriert, wenn das ORB-Tracing nicht aktiviert ist.
ObjectRequestBroker.locateRequestTimeout.displayName=Zeitlimit f\u00fcr Anforderung lokalisieren
ObjectRequestBroker.locateRequestTimeout.description=Die maximale Anzahl von Sekunden, die auf eine LocateRequest-Nachricht gewartet wird.
ObjectRequestBroker.forceTunnel.displayName=Tunnel erzwingen
ObjectRequestBroker.forceTunnel.description=Steuert, wie der Client-ORB die HTTP-Tunnelung verwendet.
ForceTunnelMode.WHENREQUIRED=BEI BEDARF
ForceTunnelMode.ALWAYS=IMMER
ForceTunnelMode.NEVER=NIE

ObjectRequestBroker.tunnelAgentURL.displayName=URL des Tunnel Agent
ObjectRequestBroker.tunnelAgentURL.description=Der URL des Servlet, das f\u00fcr die Unterst\u00fctzung der HTTP-Tunnelung verwendet wird. Der URL muss nur angegeben werden, wenn das Feld \"Tunnel erzwingen\" die Einstellung IMMER oder BEI BEDARF enth\u00e4lt. Andernfalls wird der Wert vom ORB ignoriert.
ObjectRequestBroker.noLocalCopies.displayName=Durch Referenz \u00fcbergeben
ObjectRequestBroker.noLocalCopies.description=Bei Auswahl dieser Option \u00fcbergibt der ORB die Parameter auf der Basis von Referenzen und nicht auf der Basis von Werten. Auf diese Weise werden Kopieroperationen \u00fcbergangen. Verwenden Sie dieses Merkmal mit Sorgfalt, da sonst unerw\u00fcnschte Verhaltensmuster auftreten k\u00f6nnten.
ObjectRequestBroker.externalConfigURL.displayName=URL der externen Konfiguration
ObjectRequestBroker.externalConfigURL.description=Es ist keine Beschreibung f\u00fcr dieses Merkmal verf\u00fcgbar.
ObjectRequestBroker.properties.description=Weitere benutzerdefinierte und konfigurierbare Merkmale f\u00fcr diesen Service. \
In dieser Anzeige k\u00f6nnen Sie weitere eigene ORB-Merkmale hinzuf\u00fcgen. Es wird jedoch dringend empfohlen, die Standardwerte, die w\u00e4hrend der Produktinstallation definiert werden, weder zu \u00e4ndern noch zu l\u00f6schen, sofern Sie von der IBM Benutzerunterst\u00fctzung nicht explizit dazu aufgefordert werden.
ORBPlugin.displayName=ORB-Plug-in
ORBPlugin.description=Sie k\u00f6nnen zur Erg\u00e4nzung des ORB benutzerdefinierten Code angegeben. Ein Plug-in erfasst die Klasse, die die benutzerdefinierte Logik enth\u00e4lt. W\u00e4hrend der Serverinitialisierung stellt h\u00e4ngt der Server dem Namen des Plug-in die Angabe com.ibm.CORBA.ORBPluginClass.XXX voran.
ORBPlugin.smallIcon=ORBPlugin.gif
ORBPlugin.largeIcon=ORBPlugin32X32.gif
ORBPlugin.name.displayName=Name
ORBPlugin.name.description=Der ***nicht qualifizierte*** Klassenname des zu ladenden und zu initialisierenden Plug-ins.
Interceptor.displayName=Interceptor
Interceptor.description=Interceptor werden vom ORB bei jeder IIOP-Anforderung aufgerufen.
Interceptor.smallIcon=Interceptor.gif
Interceptor.largeIcon=Interceptor32X32.gif
Interceptor.name.displayName=Name
Interceptor.name.description=Klassenname des Interceptor.
LSDConnection.displayName=LSD-Verbindung
LSDConnection.description=Die Merkmale, die f\u00fcr die Verbindungsherstellung zum Location Service Daemon verwendet werden sollen. Ein LSD ist ein Server, der an einem festgelegten Port empfangsbereit ist, die Anforderungen zur Lokalisierung persistenter Objektreferenzen verarbeitet und Clients an den entsprechenden Anwendungsserver umleitet. N\u00e4here Informationen zur Konfiguration des LSD-Serverprozesses finden Sie in den Informationen zum LocationServiceDaemonServer-Server.
LSDConnection.smallIcon=LSDConnection.gif
LSDConnection.largeIcon=LSDConnection32X32.gif
LSDConnection.endPoint.displayName=Endpoint
LSDConnection.endPoint.description=
LSDConnection.mode.displayName=Modus
LSDConnection.mode.description=Der Modus des Location Service Daemon.
LSDMode.NONE=KEIN
LSDMode.IMPLICIT_CLIENT=IMPLIZITER CLIENT
LSDMode.EXPLICIT_CLIENT=EXPLIZITER CLIENT
LSDMode.PROVIDER=PROVIDER

Server.errorStreamRedirect.displayName=Fehler beim Umleiten des Datenstroms
Server.errorStreamRedirect.description=Einstellungen f\u00fcr die Datenstromumleitung f\u00fcr System.err
Server.outputStreamRedirect.displayName=Umleiten des Ausgabedatenstroms
Server.outputStreamRedirect.description=Einstellungen f\u00fcr die Datenstromumleitung f\u00fcr System.out
Server.clusterName.displayName=Cluster-Name
Server.clusterName.description=Geben Sie den Namen des Cluster an, wenn der Server zu einem Cluster geh\u00f6rt.
Server.modelId.displayName=Modell-ID
Server.modelId.description=
StreamRedirect.displayName= Umleiten des Datenstroms
StreamRedirect.description=Gibt die Einstellungen f\u00fcr das Umleiten von Java-Standardein- und -ausgabedatenstr\u00f6men an.
StreamRedirect.smallIcon=StreamRedirect.gif
StreamRedirect.largeIcon=StreamRedirect32X32.gif
StreamRedirect.fileName.displayName=Dateiname
StreamRedirect.fileName.description=Geben Sie den Namen der Datei an, an die der Datenstrom umgeleitet werden soll.
StreamRedirect.rolloverType.displayName=\u00dcberlauftyp
StreamRedirect.rolloverType.description=Gibt an, welche Art von \u00dcberlaufalgorithmus wirksam ist.
StreamRedirect.maxNumberOfBackupFiles.displayName=Maximale Anzahl der Sicherungsdateien
StreamRedirect.maxNumberOfBackupFiles.description=Anzahl der Archivierungsdateien.
StreamRedirect.rolloverSize.displayName=\u00dcberlaufgr\u00f6\u00dfe
StreamRedirect.rolloverSize.description=Gibt die Gr\u00f6\u00dfe in MB f\u00fcr gr\u00f6\u00dfenbasierten \u00dcberlauf.
StreamRedirect.baseHour.displayName=Basisstunde
StreamRedirect.baseHour.description=Gibt die Stunden an, zu denen der zeitbasierte \u00dcberlauf gestartet wird.
StreamRedirect.rolloverPeriod.displayName=Rollover-Intervall
StreamRedirect.rolloverPeriod.description=Gibt das Rollover-Intervall an.
StreamRedirect.formatWrites.displayName=Schreibvorg\u00e4nge formatieren
StreamRedirect.formatWrites.description=Gibt an, ob Schreibvorg\u00e4nge wie WebSphere-Protokolleintr\u00e4ge formatiert werden sollen.
StreamRedirect.messageFormatKind.displayName=Art des Nachrichtenformats
StreamRedirect.messageFormatKind.description=Das gew\u00fcnschte Format f\u00fcr Nachrichten. G\u00fcltige Werte sind Basis und Erweitert. Der Standardwert ist Basis.
StreamRedirect.suppressWrites.displayName=Schreibvorg\u00e4nge unterdr\u00fccken
StreamRedirect.suppressWrites.description=Gibt an, ob Schreibvorg\u00e4nge in diesen Datenstrom unterdr\u00fcckt werden sollen.
StreamRedirect.suppressStackTrace.displayName=Stack-Trace unterdr\u00fccken
StreamRedirect.suppressStackTrace.description=Gibt an, ob Stack-Traces in Nachrichten nur durch die Ausnahme ersetzt werden sollen. Der Standardwert ist Nein (nicht unterdr\u00fccken).
ManagedObject.displayName=Verwaltetes Objekt
ManagedObject.description=Die Konfiguration eines Objekts, das von einem Agent-Prozess verwaltet werden kann.
ManagedObject.smallIcon=ManagedObject.gif
ManagedObject.largeIcon=ManagedObject32X32.gif
ManagedObject.stateManagement.displayName=Statusverwaltung
ManagedObject.statisticsProvider.displayName=Statistikprovider
ManagedObject.statisticsProvider.description=Die F\u00e4higkeit der verwalteten Ressource, Leistungsmessdaten zu generieren.
server.stop.title=Server stoppen
server.stop.warning1=Der Server f\u00fchrt die Verwaltungsanwendung aus.
server.stop.warning2=Wenn Sie den Server stoppen, werden Sie von der aktuellen HTTP Sitzung abgemeldet und k\u00f6nnen diese Instanz der Administrationskonsole nicht mehr verwenden.
server.stop.warning3=Starten Sie den Server erneut, um die Administrationskonsole aufzurufen. Wenn die Sicherheit aktiviert ist, kann sich Ihr Browser beim n\u00e4chsten Mal m\u00f6glicherweise anmelden, ohne zur Eingabe von Daten aufgefordert werden, sofern das LTPA-Cookie noch g\u00fcltig ist. Weil das LTPA-Cookie f\u00fcr Single Sign-On (Verwendung durch mehrere Server) bestimmt ist, wird es beim Abmelden von der Administrationskonsole nicht aus dem Browser entfernt.
goodbye.title=Auf Wiedersehen
goodbye.message1=Herzlichen Dank f\u00fcr die Verwendung der WebSphere-Administrationskonsole.
Server.services.PMIService.displayName=Performance Monitoring Service
Server.services.PMIService.description=Einstellungen f\u00fcr die Leistungs\u00fcberwachung. Dazu geh\u00f6ren das Aktivieren der Leistungs\u00fcberwachung, die Auswahl des PMI-Moduls und das Festlegen der \u00dcberwachungsebenen.
PMIService.displayName=Performance Monitoring Service
PMIService.description=Konfigurations- und Laufzeiteinstellungen f\u00fcr Performance Monitoring Infrastructure (PMI)
PMIService.smallIcon=PMIService.gif
PMIService.largeIcon=PMIService32X32.gif
PMIService.initialSpecLevel.displayName=Ausgangsspezifikationsebene
PMIService.initialSpecLevel.description=Eine Spezifikationszeichenfolge f\u00fcr PMI (Performance Monitoring Infrastructure), die die PMI-Spezifikationsebenen f\u00fcr alle Komponenten im Server speichert: Die Ebenen N, L, M, H, X stehen f\u00fcr keine, niedrig, mittel, hoch, maximum.
PMIService.modules=PMI-Module
PMIService.monitoringLevel=\u00dcberwachungsstufe
PMIService.specification=Spezifikationen
PMIService.mbean.notFound=Die Einstellungen f\u00fcr die Leistungs\u00fcberwachung wurden nicht gefunden. Vergewissern Sie sich, dass der Performance Monitoring Service f\u00fcr diesen Server aktiviert ist.
PMIService.invalidSetting=Die Einstellung f\u00fcr dieses Modul ist nicht g\u00fcltig.
PMIService.thevalidSettings=Geben Sie N (Keine), L (Niedrig), M (Mittel), H (Hoch) oder X (Maximum) ein.
PMIService.LevelNone=Keine - Die folgenden Module wurden auf &quot;N&quot; (Keine) gesetzt.
PMIService.LevelStandard=Standard - Die folgenden Module wurden auf &quot;H&quot; (Hoch) gesetzt.
PMIService.LevelCustom=Benutzerdefiniert - Module in der folgenden Liste \u00e4ndern, hinzuf\u00fcgen oder entfernen.


distmanagement.appserver.create.new=Neuen Anwendungsserver erstellen
distmanagement.appserver.create.new.description=Neuen Anwendungsserver erstellen
appserver.new.step1=Schablone f\u00fcr den Anwendungsserver ausw\u00e4hlen
appserver.new.step2=Knoten ausw\u00e4hlen
appserver.new.step3=Neuen Anwendungsserver best\u00e4tigen
distmanagement.button.edit=Bearbeiten
appserver.selectAppServer.msg1=Sie k\u00f6nnen einen vorhandenen Anwendungsserver als Schablone f\u00fcr den neuen Server ausw\u00e4hlen oder die Standardschablone f\u00fcr Anwendungsserver verwenden.
appserver.selectAppServer.msg3=Knoten ausw\u00e4hlen
appserver.selectAppServer.msg4=Weitere Informationen zu diesem Schritt anzeigen
appserver.selectAppServer.msg5=Der in diesem Schritt ausgew\u00e4hlte Knoten legt fest, welche Serverprozesse im n\u00e4chsten Schritt verf\u00fcgbar sind.
appserver.selectAppServer.msg6=Logischer Name des Servers. Die Namen in einer Zelle m\u00fcssen eindeutig sein.
appserver.selectAppServer.msg7=Schablone ausw\u00e4hlen
appserver.selectAppServer.msg8=Vorhandener Anwendungsserver
appserver.selectAppServer.msg9=Wenn Sie einen vorhandenen Anwendungsserver als Schablone verwenden, wird im Prinzip die Konfiguration f\u00fcr den ausgew\u00e4hlten Server kopiert.
appserver.selectAppServer.msg10=Standardschablone f\u00fcr Anwendungsserver
appserver.selectAppServer.errormsg1=Es muss ein Servername angegeben werden.
appserver.selectAppServer.errormsg2={0} ist auf Knoten {1} vorhanden.
appserver.selectAppServer.copyApps1=Anwendungen zuordnen

appserver.selectAppServer.copyApps2=Anwendungen aus einer vorhandenen Serverschablone zuordnen
appserver.selectAppServer.copyApps3=Diese Option ist nur verf\u00fcgbar, wenn Sie als Schablone "Vorhandenen Anwendungsserver" ausw\u00e4hlen. Bei Auswahl dieser Option werden die Anwendungen, die zuvor im Quellenserver installiert und ausgef\u00fchrt wurden, automatisch auch im neuen Server ausgef\u00fchrt. Au\u00dferdem werden alle bereits definierten Bindungsinformationen (wie Benutzer- und Gruppenzuordnungen) beibehalten. Dies ist anders als beim Installieren der Bin\u00e4rdateien der Anwendung in einem neuen Server unter einem anderen Anwendungsnamen. In diesem Fall wird eine getrennte Kopie der Bindungsinformationen f\u00fcr die Anwendung verwaltet.
generate.unique.ports=Eindeutige HTTP-Ports generieren
generate.unique.ports.desc=Generiert f\u00fcr jeden HTTP-Transport, der auf dem Quellenserver definiert ist, eine eindeutige Port-Nummer, so dass auf dem erstellten Server keine HTTP-Transporte vorhanden sind, die mit dem urspr\u00fcnglichen Server oder anderen Servern, die auf demselben Knoten definiert sind, in Konflikt stehen.
generate.unique.ports.label=HTTP-Ports
appserver.selectAppServer.serverName=Servername
appserver.confirmAppServer.msg1=Im Folgenden finden Sie eine \u00dcbersicht \u00fcber die von Ihnen ausgew\u00e4hlten Optionen. Klicken Sie auf die Schaltfl\u00e4che \"Fertig stellen\", um die Erstellung des Anwendungsservers abzuschlie\u00dfen.
appserver.confirmAppServer.msg2=Wenn Sie Einstellungen \u00e4ndern m\u00f6chten, klicken Sie auf die Schaltfl\u00e4che \"Zur\u00fcck\", um die Servereinstellungen erneut anzuzeigen.
appserver.confirmAppServer.msg3=Die folgenden Aktionen werden ausgef\u00fchrt.
appserver.confirmAppServer.msg4=Der neue Anwendungsserver \"{0}\" wird auf Knoten \"{1}\" in einem neuen Serverprozess erstellt.
appserver.confirmAppServer.msg7=Von dieser Aktion m\u00f6glicherweise ausgel\u00f6ste Probleme.
appserver.confirmAppServer.msg8=Vergewissern Sie sich, dass der Knoten \"{0}\" \u00fcber gen\u00fcgend Speicher f\u00fcr die Unterst\u00fctzung mehrerer Prozesse verf\u00fcgt. Andernfalls k\u00f6nnte dies negative Auswirkungen auf die Leistung haben.
appserver.createAppServer.msg1=Der neue Server wurde erstellt.
appserver.createAppServer.msg2=\u00c4ndern Sie Variablen, Ressourcen und andere Einstellungen der Serverkonfiguration, z. B. die Namen der Warteschlangen des Nachrichten-Broker, bevor Sie den neu erstellten Server ausf\u00fchren.
ensure.unique.httpports=Vergewissern Sie sich, dass die HTTP-Ports f\u00fcr den Knoten eindeutig sind, bevor Sie den Server starten.
error.create.server=Beim Erstellen des neuen Servers ist ein Fehler aufgetreten.

application.server.already.started={0} wurde bereits gestartet.
node.agent.not.active=Der Node Agent auf Knoten {0} ist nicht aktiv. Der Server kann nicht erstellt werden.

synch.server.before.start=Die Serverkonfiguration hat sich ge\u00e4ndert. Sie m\u00fcssen die Konfiguration im Master-Repository sichern, bevor Sie den Server starten.

object.must.be.selected=Zur Ausf\u00fchrung dieser Aktion m\u00fcssen Sie mindestens einen Anwendungsserver ausw\u00e4hlen.
application.server.not.started={0} wurde nicht gestartet.
could.not.stop.server=Beim Stoppen von {0} ist ein Fehler aufgetreten. N\u00e4here Informationen finden Sie m\u00f6glicherweise in den Fehlerprotokollen.
server.started.successfully=Der Server {0} wurde gestartet.
server.view.jvm.logs1=JVM-Protokolle anzeigen</a> enth\u00e4lt weitere Einzelheiten.
could.not.start.server=Der Server {0} konnte nicht gestartet werden.
server.stopped.successfully=Der Server {0} wurde gestoppt.
server.should.be.stopped=Alle zu l\u00f6schenden Server stoppen
deleteserver.page.title=Server l\u00f6schen

deleteserver.page.msg1=Klicken Sie auf die Schaltfl\u00e4che OK, um die folgenden Server zu l\u00f6schen. Wenn Sie die Server nicht l\u00f6schen m\u00f6chten, klicken Sie auf die Schaltfl\u00e4che \"Abbrechen\", um zur vorherigen Seite zur\u00fcckzukehren.
error.createmq=createmq konnte nicht ausgef\u00fchrt werden. Deshalb kann auch der JMS-Server nicht gestartet werden.
error.deletemq=Die Operation deleteemq ist fehlgeschlagen.
NodeAgent.not.found=Das System konnte keine Verbindung zu dem Prozess herstellen, um den Server zu beenden. Vergewissern Sie sich, dass der Server beendet ist, bevor Sie ihn l\u00f6schen.

nodes.not.present=Es sind keine Knoten in der Konfiguration vorhanden, die WebSphere Application Server unterst\u00fctzen. F\u00fchren Sie den Befehl addNode aus der <a href="navigatorCmd.do?forwardName=Node.content.main">Nodes-Collection</a> oder in der Befehlszeile aus, bevor Sie versuchen, einen neuen WebSphere Application Server zu erstellen.

ExecutionState.PARTIAL_STOP=Teilweise stoppen
ExecutionState.PARTIAL_START=Teilweise starten
ExecutionState.STOPPING=Stoppen
ExecutionState.STARTING=Starten



NamedEndPoint.displayName=Endpoints
NamedEndPoint.description=Wichtige TCP/IP-Ports konfigurieren, die der Server f\u00fcr Verbindungen verwendet.
NamedEndPoint.smallIcon=NamedEndPoint.gif
NamedEndPoint.largeIcon=NamedEndPoint32X32.gif
NamedEndPoint.endPoint.displayName=Endpoint
NamedEndPoint.endPoint.description=
NamedEndPoint.endPointName.displayName=Name des Endpoint
NamedEndPoint.endPointName.description=
NamedEndPoints.not.available=Es sind keine zu konfigurierenden Endpoints verf\u00fcgbar.
SystemMessageServer.displayName=Systemnachrichtenserver
AppServer.displayName=Anwendungsserver

Server.productInfo.displayName=Produktinformationen
Server.productInfo.description=Produktinformationen f\u00fcr diese Installation von WebSphere Application Server
ProductInfo.components.dislayName=Komponenten
ProductInfo.components.description=Auf dem aktuellen System installierte Komponenten
ProductInfo.extensions.dislayName=Erweiterungen
ProductInfo.extensions.description=Auf dem aktuellen System installierte Erweiterungen
ProductInfo.eFixes.dislayName=e-Fixes
ProductInfo.eFixes.description=Auf dem aktuellen System installierte e-Fixes
ProductInfo.product.name=Produktname
ProductInfo.product.id=ID
ProductInfo.product.version=Version
ProductInfo.product.buildDate=Build-Datum
ProductInfo.product.buildLevel=Build-Version
ProductInfo.product.buildversion=Build-Version
ProductInfo.product.builddate=Build-Datum
ProductInfo.component.name=Komponentenname
ProductInfo.component.specversion=Spezifikationsversion
ProductInfo.extension.name=Name der Erweiterung
ProductInfo.efix.id=ID des e-Fix
ProductInfo.efix.buildversion=Build-Version
ProductInfo.efix.buildDate=Build-Datum
ProductInfo.efix.components=Komponenten
ProductInfo.efix.prereq=Vorausgesetzte e-Fixes
ProductInfo.efix.coreq=Zus\u00e4tzliche e-Fixes

ProductInfo.ptfs.dislayName=PTFs
ProductInfo.ptfs.description=Auf dem aktuellen System installierte PTFs
ProductInfo.ptf.id=PTF-ID
ProductInfo.ptf.products=Produkte
ProductInfo.productReport.dislayName=Produktbericht
ProductInfo.productReport.description=Zeigt einen detaillierten Produktbericht zum aktuellen Status des Systems an.
ProductInfo.historyReport.dislayName=Protokollbericht
ProductInfo.historyReport.description=Zeigt einen detaillierten Verlaufsbericht zu den Produktinformationen an.
Data.not.present=Keine

accessibility.needs=Benutzer, die auf Eingabehilfen angewiesen sind, k\u00f6nnen den Status durch Anklicken des Bildes abrufen.
