# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#CMVCPATHNAME ws/code/webui.servermanagement/src/servermanagement/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE
#

nav.webSphere.servermanagement.configuration=Servidores
nav.webSphere.servers=Servidores
nav.view.ApplicationServer=Servidores de aplicaciones
nav.view.JMSServer=Servidores JMS
Server.node.displayName=Nodo
Server.node.description=Nodo
Server.status.displayName=Estado
Server.status.description=Estado
ExecutionState.STARTED=Iniciado
ExecutionState.STOPPED=Parado
ExecutionState.UNAVAILABLE=No disponible
attribute.not.found=Error de JMX: No se ha encontrado el atributo 
Server.type.displayName=Tipo
Server.type.description=Tipo del servidor.
Server.mbean.pid.displayName=ID de proceso
Server.mbean.pid.description=ID de proceso del sistema operativo nativo para este servidor.
Server.mbean.cellName.displayName=Nombre de c\u00e9lula
Server.mbean.cellName.description=Nombre de la c\u00e9lula donde se est\u00e1 ejecutando el servidor.
Server.mbean.nodeName.displayName=Nombre de nodo
Server.mbean.nodeName.description=Nombre del nodo donde se est\u00e1 ejecutando el servidor.
Server.mbean.state.displayName=Estado
Server.mbean.state.description=Estado de ejecuci\u00f3n de este servidor.
ServerManagement.logsAndTrace.displayName=Registro cronol\u00f3gico y rastreo
ServerManagement.logsAndTrace.description=Especifica los valores de rastreo y de anotaciones cronol\u00f3gicas para este servidor.
ServerManagement.RASLoggingService.displayName=Anotaciones cronol\u00f3gicas de servicio de IBM
ServerManagement.RASLoggingService.description=Configura las anotaciones cronol\u00f3gicas de servicio de IBM, tambi\u00e9n conocidas como anotaciones cronol\u00f3gicas de actividad. 
ServerManagement.TraceService.displayName=Servicio de rastreo de diagn\u00f3stico
ServerManagement.TraceService.description=Ver y modificar las propiedades del servicio de rastreo de diagn\u00f3stico.

task.manage.server=Gestionar servidor local

TransactionService.displayName=Servicio de transacciones
TransactionService.description=El servicio de transacciones es un componente de tiempo de ejecuci\u00f3n del servidor que puede coordinar las actualizaciones en varios gestores de recursos para garantizar que las aplicaciones, o el contenedor en el que \u00e9stas se despliegan, inician o detienen actualizaciones at\u00f3micas de data.Transactions.
TransactionService.smallIcon=TransactionService.gif
TransactionService.largeIcon=TransactionService32X32.gif
TransactionService.transactionLogDirectory.displayName=Directorio de anotaciones cronol\u00f3gicas de transacciones
TransactionService.transactionLogDirectory.description=Especifica el nombre de un directorio de este servidor donde el servicio de transacciones almacena los archivos de anotaciones cronol\u00f3gicas para la recuperaci\u00f3n. El archivo de anotaciones cronol\u00f3gicas de transacciones ampl\u00eda un valor en blanco en la configuraci\u00f3n del servidor para que sea el directorio (ra\u00edz_instalaci\u00f3n)/tranlog/(server_name).
TransactionService.totalTranLifetimeTimeout.displayName=Tiempo de espera de actividad total de transacci\u00f3n
TransactionService.totalTranLifetimeTimeout.description=Duraci\u00f3n m\u00e1xima, en segundos, de las transacciones en este servidor de aplicaciones. Las transacciones que no se deban finalizar antes de este tiempo de espera se retrotraer\u00e1n.
TransactionService.clientInactivityTimeout.displayName=Tiempo de espera de inactividad de cliente
TransactionService.clientInactivityTimeout.description=Duraci\u00f3n m\u00e1xima, en segundos, entre las peticiones de transacci\u00f3n desde un cliente remoto. Cualquier per\u00edodo de inactividad de cliente que sobrepase este tiempo de espera har\u00e1 que la transacci\u00f3n se retrotraiga en este servidor de aplicaciones.
TransactionService.enableLoggingForHeuristicReporting.displayName=enableLoggingForHeuristicReporting
TransactionService.enableLoggingForHeuristicReporting.description=Habilita el registro cronol\u00f3gico de informes heur\u00edsticos (una funci\u00f3n avanzada disponible en el paquete EEx). Si las aplicaciones se configuran para permitir que los recursos de una fase participen en transacciones de dos fases, la notificaci\u00f3n de los resultados heur\u00edsticos que se dan al producirse un error del servidor de aplicaciones requiere que se grabe informaci\u00f3n adicional en el archivo de anotaciones cronol\u00f3gicas de transacciones.  Si est\u00e1 habilitado, se efectuar\u00e1 una grabaci\u00f3n m\u00e1s en el archivo de anotaciones cronol\u00f3gicas para cualquier transacci\u00f3n que implique recursos de una o dos fases.  No se graban registros adicionales de transacciones que no impliquen recursos de una fase.  Valor por omisi\u00f3n: false.
TransactionService.mbean.transactionLogDirectory.displayName=Directorio de anotaciones cronol\u00f3gicas de transacciones
TransactionService.mbean.transactionLogDirectory.description=Especifica el nombre de un directorio de este servidor donde el servicio de transacciones almacena los archivos de anotaciones cronol\u00f3gicas para la recuperaci\u00f3n.
TransactionService.mbean.totalTranLifetimeTimeout.displayName=Tiempo de espera de actividad total de transacci\u00f3n
TransactionService.mbean.totalTranLifetimeTimeout.description=
TransactionService.mbean.clientInactivityTimeout.displayName=Tiempo de espera de inactividad de cliente
TransactionService.mbean.clientInactivityTimeout.description=
Transaction.displayName=Gestionar transacciones
Transaction.description=Gestionar las transacciones que est\u00e1n activas actualmente en el servidor de aplicaciones.
Transaction.localId.displayName=ID local
Transaction.status.displayName=Estado 
Transaction.globalId.displayName=ID global
button.transactionlist=Gestionar transacciones
Transaction.noactivetransaction.exists=No hay ninguna transacci\u00f3n activa ejecut\u00e1ndose en el servidor.
jmx.malformedobject.error=No se ha encontrado el Mbean de tipo {0}.
jmx.instancenotfound.error=Ha fallado la operaci\u00f3n {0} en el mbean de tipo {1}.

ApplicationServer.installedApps.displayName=Aplicaciones instaladas
ApplicationServer.installedApps.description=Gestionar las aplicaciones instaladas en el servidor.

ApplicationServer.displayName=Servidores de aplicaciones
ApplicationServer.description=Un servidor de aplicaciones es un servidor que ofrece los servicios necesarios para ejecutar aplicaciones de empresa.
ApplicationServer.name.displayName=Nombre
ApplicationServer.name.description=Nombre de visualizaci\u00f3n del servidor.
ApplicationServer.smallIcon=ApplicationServer.gif
ApplicationServer.largeIcon=ApplicationServer32X32.gif
ApplicationServer.locationServiceDaemon.displayName=locationServiceDaemon
ApplicationServer.locationServiceDaemon.description=
ApplicationServer.components.DynamicCache.displayName=Servicio de antememoria din\u00e1mica
ApplicationServer.components.DynamicCache.description=Especificar valores del servicio de antememoria din\u00e1mica de este servidor.
ApplicationServer.applicationServerServices.displayName=applicationServerServices
ApplicationServer.applicationServerServices.description=Servicios del servidor de aplicaciones.  DERIVED: Consulte la colecci\u00f3n de servicios heredada de la superclase Contenedor.
ApplicationServer.applicationServerServices.TransactionService.displayName=Servicio de transacciones
ApplicationServer.applicationServerServices.TransactionService.description=Especifica los valores del servicio de transacciones, as\u00ed como tambi\u00e9n gestiona los bloqueos de transacciones activas.
ApplicationServer.components.WebContainer.displayName=Contenedor Web
ApplicationServer.components.WebContainer.description= Especifica los valores de antememoria din\u00e1mica y agrupaci\u00f3n de hebras del contenedor. Tambi\u00e9n especifica valores del \
gestor de sesiones como los par\u00e1metros de persistencia y ajuste, y los valores de transporte \
HTTP.
ApplicationServer.components.EJBContainer.displayName=Contenedor de EJB
ApplicationServer.components.EJBContainer.description=Especifica informaci\u00f3n de origen de datos y antememoria del contenedor.
Server.services.ObjectRequestBroker.displayName=Servicio ORB
Server.services.ObjectRequestBroker.description=Especifica valores del servicio de intermediario de petici\u00f3n de objetos (ORB).
ApplicationServer.id.displayName=ID
ApplicationServer.id.description=A los servidores se les puede asignar un identificador exclusivo.
ApplicationServer.applicationClassLoaderPolicy.displayName=Pol\u00edtica del cargador de clase de aplicaci\u00f3n
ApplicationServer.applicationClassLoaderPolicy.description=Especifica si existe un cargador de clases \u00fanico para todas las aplicaciones (\"\u00danico\") o un cargador de clases por aplicaci\u00f3n (\"M\u00faltiple\").
ApplicationServer.applicationClassLoadingMode.displayName=Modalidad de carga de clase de aplicaci\u00f3n
ApplicationServer.applicationClassLoadingMode.description=Especifica la modalidad de carga de clase cuando la pol\u00edtica del cargador de clase de aplicaci\u00f3n es \"\u00danico\"
ClassLoaderPolicy.SINGLE=Aplicaci\u00f3n
ClassLoaderPolicy.MULTIPLE=M\u00f3dulo
ServerClassLoaderPolicy.SINGLE=\u00danico
ServerClassLoaderPolicy.MULTIPLE=M\u00faltiple
applicationClassLoadingMode.PARENT_FIRST=Padre primero
applicationClassLoadingMode.PARENT_LAST=Padre \u00faltimo                         
ApplicationContainer.displayName=ApplicationContainer
ApplicationContainer.description=
ApplicationContainer.smallIcon=ApplicationContainer.gif
ApplicationContainer.largeIcon=ApplicationContainer32X32.gif
DynamicCache.displayName=Servicio de antememoria din\u00e1mica
DynamicCache.description=Servicio de antememoria din\u00e1mica
DynamicCache.smallIcon=DynamicCache.gif
DynamicCache.largeIcon=DynamicCache32X32.gif
DynamicCache.cacheGroups.description=Define conjuntos de antememorias externas controlados por WebSphere Application Server.
DynamicCache.cacheReplication.displayName=cacheReplication
DynamicCache.cacheReplication.description=
DynamicCache.cacheSize.units=entradas
DynamicCache.cacheSize.description=Entero positivo que define el n\u00famero m\u00e1ximo de entradas que puede contener la antememoria.
DynamicCache.defaultPriority.description=Prioridad por omisi\u00f3n de las entradas de antememoria, que determina cu\u00e1ndo tiempo permanece una entrada en una antememoria completa.
DynamicCache.replicationType.displayName=replicationType
DynamicCache.replicationType.description=Algoritmo para distribuir entradas de antememoria compartida en antememorias din\u00e1micas cooperadoras conectadas a trav\u00e9s de DRS.  Se debe establecer como uno de los valores de dynamicCacheReplicationKind.
DynamicCache.pushFrequency.displayName=pushFrequency
DynamicCache.pushFrequency.description=Intervalo de tiempo, especificado en segundos, que se utiliza cuando el tipo de duplicaci\u00f3n es PUSH. El valor por omisi\u00f3n es 0.
DynamicCache.enableDiskOffload.displayName=enableDiskOffload
DynamicCache.enableDiskOffload.description=Habilita la descarga del disco.
DynamicCache.diskOffloadLocation.displayName=diskOffloadLocation
DynamicCache.diskOffloadLocation.description=Especifica el directorio utilizado para la descarga del disco.
DynamicCache.hashSize.displayName=hashSize
DynamicCache.hashSize.description=Especifica un tama\u00f1o de hash cuando se habilita la descarga del disco. Los valores v\u00e1lidos son potencias de 2 (1, 2, 4, 8...).
ExternalCacheGroup.description=Utilice esta p\u00e1gina para definir los grupos de antememorias externas que controla WebSphere Application Server en los servidores Web, como por ejemplo, IBM Edge Server e IBM HTTP Server.
ExternalCacheGroup.smallIcon=ExternalCacheGroup.gif
ExternalCacheGroup.largeIcon=ExternalCacheGroup32X32.gif
ExternalCacheGroup.members.description=Miembros de un grupo de antememoria externa controlado por WebSphere Application Server.
ExternalCacheGroup.name.description=Nombre de grupo de antememoria externa.
ExternalCacheGroup.type.description=Actualmente, s\u00f3lo se soportan los grupos de antememoria externa compartida.
ExternalCacheGroupMember.displayName=ExternalCacheGroupMember
ExternalCacheGroupMember.description=Antememoria externa \u00fanica que debe controlar WebSphere.
ExternalCacheGroupMember.smallIcon=ExternalCacheGroupMember.gif
ExternalCacheGroupMember.largeIcon=ExternalCacheGroupMember32X32.gif
ExternalCacheGroupMember.address.description=Nombre de sistema principal y, posiblemente, n\u00famero de puerto de una antememoria externa.
ExternalCacheGroupMember.adapterBeanName.description=Nombre de una clase, situada en la classpath de WebSphere Application Server, del adaptador entre WebSphere Application Server y esta antememoria externa.
ExternalCacheGroupKind.SHARED=SHARED
ExternalCacheGroupKind.NOT_SHARED=NOT_SHARED
DynamicCacheReplicationKind.NONE=NONE
DynamicCacheReplicationKind.PUSH=PUSH
DynamicCacheReplicationKind.PULL=PULL
DynamicCacheReplicationKind.PUSH_PULL=PUSH_PULL
EJBCache.displayName=Valores de antememoria de EJB
EJBCache.description=Cada contenedor de EJB tiene una antememoria de instancias de bean para el acceso r\u00e1pido.  Esta secci\u00f3n le permite especificar los par\u00e1metros para configurar la antememoria.
EJBCache.smallIcon=EJBCache.gif
EJBCache.largeIcon=EJBCache32X32.gif
EJBCache.cleanupInterval.displayName=Intervalo de limpieza
EJBCache.cleanupInterval.units=milisegundos
EJBCache.cleanupInterval.description=Intervalo en el que el contenedor intenta eliminar los elementos no utilizados de la antememoria para reducir el n\u00famero total de elementos al valor del tama\u00f1o de la antememoria.
EJBCache.cacheSize.displayName=Tama\u00f1o de antememoria
EJBCache.cacheSize.units=cubetas
EJBCache.cacheSize.description=Especifica el n\u00famero de cubetas en la lista de instancias activas del contenedor de EJB.
EJBContainer.displayName=Contenedor de EJB
EJBContainer.description=Un contenedor de EJB es un componente de un servidor de aplicaciones J2EE que proporciona servicios de tiempo de ejecuci\u00f3n a los m\u00f3dulos ejb que se pueden desplegar en \u00e9l.
EJBContainer.smallIcon=EJBContainer.gif
EJBContainer.largeIcon=EJBContainer32X32.gif
EJBContainer.cacheSettings.displayName=Valores de antememoria de EJB
EJBContainer.cacheSettings.description=Cada contenedor de EJB tiene una antememoria de instancias de bean para el acceso r\u00e1pido.  Esta secci\u00f3n le permite especificar los par\u00e1metros para configurar la antememoria.
EJBContainer.passivationDirectory.displayName=Directorio de desactivaci\u00f3n
EJBContainer.passivationDirectory.description=Directorio en el que el contenedor guardar\u00e1 el estado persistente de los beans de sesi\u00f3n con estados desactivados.
EJBContainer.inactivePoolCleanupInterval.displayName=Intervalo de limpieza de agrupaciones inactivas
EJBContainer.inactivePoolCleanupInterval.description=Intervalo en el que el contenedor examina las agrupaciones de las instancias del bean disponibles para determinar si se pueden suprimir algunas y reducir as\u00ed el uso de memoria.
EJBContainer.defaultDatasourceJNDIName.displayName=Nombre JNDI del origen de datos por omisi\u00f3n
EJBContainer.defaultDatasourceJNDIName.description=Nombre JNDI de un origen de datos que se debe utilizar cuando no se ha especificado un origen de datos durante el despliegue de la aplicaci\u00f3n. Este valor no es aplicable en beans CMP compatibles con EJB 2.x.
MessageListenerService.displayName=Servicio de receptor de mensajes
MessageListenerService.description=Configuraci\u00f3n del servicio de receptor de mensajes. Este servicio proporciona el proceso de escucha de bean controlado por mensajes (MDB), con el que se despliegan los MDB en los puertos de escucha que definen el destino de JMS en el que se va a escuchar. Estos puertos receptores se definen dentro de este servicio junto con los valores para la agrupaci\u00f3n de hebras.
MessageListenerService.smallIcon=MessageListenerService.gif
MessageListenerService.largeIcon=MessageListenerService32X32.gif
MessageListenerService.listenerPorts.displayName=Puertos receptores
MessageListenerService.listenerPorts.description=Puertos receptores de mensajes configurados en el dominio administrativo.
MessageListenerService.threadPool.displayName=Agrupaci\u00f3n de hebras
MessageListenerService.threadPool.description=Especifica los valores de la agrupaci\u00f3n de hebras de los MDB del servicio de receptor de mensajes
MessageListenerService.name.displayName=Nombre
MessageListenerService.name.description=Nombre por el que se conoce al servicio de receptor de mensajes a efectos administrativos.
MessageListenerService.description.displayName=Descripci\u00f3n
MessageListenerService.description.description=El servicio de receptor de mensajes es una ampliaci\u00f3n de las funciones JMS del proveedor de JMS.  Proporciona un gestor de receptores que controla y supervisa uno o m\u00e1s receptores JMS, que a su vez supervisan un destino de JMS en nombre del bean desplegado y controlado por mensajes.
ListenerPort.name.description=Nombre de puerto receptor
ListenerPort.displayName=Puertos receptores
ListenerPort.description=Puertos receptores de beans controlados por mensajes que permiten que escuchar mensajes. Cada puerto especifica la f\u00e1brica de conexiones de JMS y el destino de JMS en el que escuchar\u00e1 un MDB desplegado en dicho puerto.
ListenerPort.smallIcon=ListenerPort.gif
ListenerPort.largeIcon=ListenerPort32X32.gif
ListenerPort.description.displayName=Descripci\u00f3n
ListenerPort.description.description=Descriptor del puerto receptor, a efectos administrativos.
ListenerPort.connectionFactoryJNDIName.displayName=Nombre JNDI de la f\u00e1brica de conexiones
ListenerPort.connectionFactoryJNDIName.description=Nombre JNDI de la f\u00e1brica de conexiones de JMS que va a utilizar el puerto receptor; por ejemplo, jms/connFactory1.
ListenerPort.destinationJNDIName.displayName=Nombre JNDI del destino
ListenerPort.destinationJNDIName.description=Nombre JNDI del destino que va a utilizar el puerto receptor; por ejemplo, jms/destn1.
ListenerPort.maxSessions.displayName=M\u00e1ximo de sesiones
ListenerPort.maxSessions.description=N\u00famero m\u00e1ximo de sesiones simult\u00e1neas de servidor de JMS que utiliza un receptor para procesar mensajes. El rango es de 1 a 2147483647.
ListenerPort.maxRetries.displayName=M\u00e1ximo de reintentos
ListenerPort.maxRetries.description=N\u00famero m\u00e1ximo de veces que el receptor intenta enviar un mensaje antes de que se detenga el receptor. El rango es de 0 a 2147483647.
ListenerPort.maxMessages.displayName=M\u00e1ximo de mensajes
ListenerPort.maxMessages.description=N\u00famero m\u00e1ximo de mensajes que el receptor puede procesar en una sesi\u00f3n de servidor de JMS. El rango es de 0 a 2147483647.
ListenerPort.mbean.started.displayName=Iniciado
ListenerPort.mbean.started.description=Estado de ejecuci\u00f3n del puerto receptor
ListenerPort.mbean.jmsConnJNDIName.displayName=Nombre JNDI de la f\u00e1brica de conexiones
ListenerPort.mbean.jmsConnJNDIName.description=Nombre JNDI para la f\u00e1brica de conexiones de JMS que utilizar\u00e1 la hebra receptora.
ListenerPort.mbean.jmsDestJNDIName.displayName=Nombre JNDI del destino
ListenerPort.mbean.jmsDestJNDIName.description=Nombre JNDI del destino de JMS que utilizar\u00e1 la hebra receptora.
ListenerPort.mbean.maxSessions.displayName=M\u00e1ximo de sesiones
ListenerPort.mbean.maxSessions.description=N\u00famero m\u00e1ximo de sesiones simult\u00e1neas de servidor de JMS utilizado por MDB Listener para procesar mensajes. El rango es de 1 a MAX_INT_VALUE
ListenerPort.mbean.maxRetries.displayName=M\u00e1ximo de reintentos
ListenerPort.mbean.maxRetries.description=N\u00famero m\u00e1ximo de intentos para entregar un mensaje antes de que la instancia de MDB Listener se detenga.  El rango es de 0 a MAX_INT_VALUE.
ListenerPort.mbean.maxMessages.displayName=M\u00e1ximo de mensajes
ListenerPort.mbean.maxMessages.description=N\u00famero m\u00e1ximo de mensajes procesados simult\u00e1neamente por una sesi\u00f3n de servidor de JMS. El rango es de 1 a MAX_INT_VALUE.
ListenerPort.must.be.selected=Debe seleccionar al menos un puerto receptor para realizar esta acci\u00f3n
ListenerPort.started.succussfully=El puerto receptor {0} se ha iniciado satisfactoriamente.
could.not.start.ListenerPort=No se ha podido iniciar el puerto receptor {0}.
ListenerPort.stopped.succussfully=El puerto receptor {0} se ha detenido satisfactoriamente.
could.not.stop.ListenerPort=No se ha podido detener el puerto receptor {0}.

WebContainer.displayName=Contenedor Web
WebContainer.description=Un contenedor Web maneja peticiones de los clientes para recursos de aplicaci\u00f3n Web como por ejemplo servlets y archivos JSP, entre otros. El contenedor Web crea instancias de servlet, carga y descarga servlets, crea y gestiona objetos de petici\u00f3n y respuesta y efect\u00faa otras tareas para gestionar los componentes de una aplicaci\u00f3n Web de una manera eficaz. Los servidores de aplicaciones s\u00f3lo contienen un contenedor Web, pero pueden no contener ninguno. Los plug-ins del servidor Web, que se facilitan con el producto WebSphere \
Application Server, ofrecen a los servidores Web la posibilidad de pasar peticiones de \
recursos al contenedor Web de WebSphere Application Server. 
WebContainer.smallIcon=WebContainer.gif
WebContainer.largeIcon=WebContainer32X32.gif
WebContainer.transports.displayName=transportes
WebContainer.transports.description=Lista de transportes definidos para el contenedor Web.
webcontainer.threadpool.description=Valores de la agrupaci\u00f3n de hebras del contenedor Web
WebContainer.sessionAffinityTimeout.displayName=sessionAffinityTimeout
WebContainer.sessionAffinityTimeout.description=Si el valor no es cero, WebSphere puede conmutar la afinidad de sesi\u00f3n HTTP para peticiones a una instancia de servidor distinta una vez transcurrido el periodo de tiempo especificado.  En determinadas situaciones, esto puede mejorar el rendimiento del equilibrio de carga. Valor por omisi\u00f3n: 0  Rango: 0-MAX_INT
WebContainer.sessionAffinityFailoverServer.displayName=sessionAffinityFailoverServer
WebContainer.sessionAffinityFailoverServer.description=Cuando se utiliza WLM y un servidor de un grupo de servidores no funciona, WLM normalmente redirecciona las peticiones con afinidad para el servidor que no funciona a otro servidor aleatorio del grupo. Este campo permite que \
un administrador especifique el nombre de un servidor dentro del grupo de servidores al que \
deban redireccionarse las peticiones de afinidad, en lugar de seleccionar el servidor \
aleatoriamente.
WebContainer.defaultVirtualHostName.displayName=defaultVirtualHostName
WebContainer.defaultVirtualHostName.description=Sistema principal virtual que se utilizar\u00e1 por omisi\u00f3n en las aplicaciones Web.  Este valor se puede sobrescribir durante la instalaci\u00f3n de aplicaciones.
WebContainer.enableServletCaching.displayName=enableServletCaching
WebContainer.enableServletCaching.description=Especifica si se habilita la colocaci\u00f3n en antememoria de servlets y jsp.
DB2RowSizeEnum.ROW_SIZE_4KB=ROW_SIZE_4KB
DB2RowSizeEnum.ROW_SIZE_8KB=ROW_SIZE_8KB
DB2RowSizeEnum.ROW_SIZE_16KB=ROW_SIZE_16KB
DB2RowSizeEnum.ROW_SIZE_32KB=ROW_SIZE_32KB
TuningParams.displayName=Par\u00e1metros de ajuste personalizado
TuningParams.description=Par\u00e1metros de ajuste para la gesti\u00f3n de sesiones.
TuningParams.smallIcon=TuningParams.gif
TuningParams.largeIcon=TuningParams32X32.gif
TuningParams.invalidationSchedule.displayName=invalidationSchedule
TuningParams.invalidationSchedule.description=Cuando se habilita, especifica las dos horas del d\u00eda en que \
el proceso de invalidaci\u00f3n va a la base de datos a borrar las sesiones persistentes \
invalidadas. Especifique las horas de menor actividad en su instalaci\u00f3n. El objetivo es reducir la actividad de la base de datos de sesi\u00f3n. Si esta opci\u00f3n est\u00e1 habilitada, se reduce \
el n\u00famero de actualizaciones de la base de datos que se precisan para tener activas las HttpSessions. Si est\u00e1 inhabilitada, el proceso de invalidaci\u00f3n se ejecuta cada pocos minutos para eliminar las HttpSessions invalidadas.
TuningParams.usingMultiRowSchema.displayName=usingMultiRowSchema
TuningParams.usingMultiRowSchema.description=Especifica si se debe situar cada una de las instancias de datos de aplicaci\u00f3n en una fila distinta de la base de datos para permitir que se almacenen cantidades mayores de datos en cada sesi\u00f3n. Con ello puede obtenerse un mejor rendimiento en determinados casos de utilizaci\u00f3n.  True: se sit\u00faa cada instancia de datos de aplicaci\u00f3n en una fila distinta de la base de datos. False: las instancias de datos de aplicaci\u00f3n se sit\u00faan en la misma fila.  
TuningParams.maxInMemorySessionCount.displayName=maxInMemorySessionCount
TuningParams.maxInMemorySessionCount.description=Especifica el n\u00famero m\u00e1ximo de sesiones que se deben mantener en memoria.
TuningParams.allowOverflow.displayName=allowOverflow
TuningParams.allowOverflow.description=Especifica si se permite que el n\u00famero de sesiones en memoria exceda el valor especificado en la propiedad Recuento de sesiones en memoria.  True: se permite el desbordamiento. False: se limita el n\u00famero de sesiones en memoria al recuento de sesiones en memoria.      
TuningParams.scheduleInvalidation.displayName=scheduleInvalidation
TuningParams.scheduleInvalidation.description=Especifica cu\u00e1ndo se deben borrar las sesiones no v\u00e1lidas del almacenamiento persistente.
TuningParams.writeFrequency.description=Esta opci\u00f3n controla el momento en que la sesi\u00f3n se escribir\u00e1 en el almac\u00e9n persistente.
TuningParams.writeInterval.displayName=writeInterval
TuningParams.writeInterval.description=Si la frecuencia de escritura se especifica como \
TIME_BASED_WRITE, este valor especificar\u00e1 con qu\u00e9 frecuencia se escribir\u00e1n los datos de sesi\u00f3n en la base de datos. Se especifica en segundos y debe ser un entero positivo entre 5 y \
9999. Cuando se configura, InvalidationTimeout debe ser como m\u00ednimo el doble de grande que el intervalo de escritura.
TuningParams.writeContents.description=Especifica si s\u00f3lo los atributos actualizados o bien todos los atributos de sesi\u00f3n se deben escribir en el almacenamiento persistente, tanto si han cambiado como si no. Si s\u00f3lo especifica atributos actualizados, s\u00f3lo se escribir\u00e1n atributos actualizados en el almacenamiento persistente. Si especifica todos los atributos de sesi\u00f3n, se escribir\u00e1n todos los atributos en el almacenamiento persistente. \
atributos actualizados.
TuningParams.invalidationTimeout.displayName=invalidationTimeout
TuningParams.invalidationTimeout.description=Especifica el intervalo de tiempo que una sesi\u00f3n puede estar sin ser utilizada antes de que deje de considerarse v\u00e1lida.  -1 especifica que la sesi\u00f3n no se invalidar\u00e1.  Este valor es el valor por omisi\u00f3n cuando el tiempo de espera \
de la sesi\u00f3n no se especifica en un descriptor de despliegue de la aplicaci\u00f3n Web.  Para mantener el rendimiento, el temporizador de invalidaci\u00f3n no es preciso "hasta el segundo". Ser\u00eda correcto suponer que el temporizador es preciso en un intervalo de dos minutos.  Cuando la frecuencia de escritura se basa en el tiempo, este valor debe ser como m\u00ednimo el doble de grande que el intervalo de escritura.
WriteFrequencyEnum.END_OF_SERVLET_SERVICE=END_OF_SERVLET_SERVICE
WriteFrequencyEnum.MANUAL_UPDATE=MANUAL_UPDATE
WriteFrequencyEnum.TIME_BASED_WRITE=TIME_BASED_WRITE
WriteContentsEnum.ONLY_UPDATED_ATTRIBUTES=ONLY_UPDATED_ATTRIBUTES
WriteContentsEnum.ALL_SESSION_ATTRIBUTES=ALL_SESSION_ATTRIBUTES
InvalidationSchedule.displayName=InvalidationSchedule
InvalidationSchedule.description=Cuando se habilita, especifica las dos horas del d\u00eda en que \
el proceso de invalidaci\u00f3n va a la base de datos a borrar las sesiones persistentes \
invalidadas. Especifique las horas de menor actividad en su instalaci\u00f3n. El objetivo es reducir la actividad de la base de datos de sesi\u00f3n. Si esta opci\u00f3n est\u00e1 habilitada, se reduce \
el n\u00famero de actualizaciones de la base de datos que se precisan para tener activas las HttpSessions. Si est\u00e1 inhabilitada, el proceso de invalidaci\u00f3n se ejecuta cada pocos minutos para eliminar las HttpSessions invalidadas.
InvalidationSchedule.smallIcon=InvalidationSchedule.gif
InvalidationSchedule.largeIcon=InvalidationSchedule32X32.gif
InvalidationSchedule.firstHour.displayName=firstHour
InvalidationSchedule.firstHour.description=Primera hora durante la cual las sesiones persistentes no v\u00e1lidas se borran de la ubicaci\u00f3n externa. Este valor debe ser un entero positivo \
entre 0 y 23. Este valor s\u00f3lo es v\u00e1lido si est\u00e1 habilitada la invalidaci\u00f3n de planificaci\u00f3n.
InvalidationSchedule.secondHour.displayName=secondHour
InvalidationSchedule.secondHour.description=Segunda hora durante la cual las sesiones persistentes no v\u00e1lidas se borran de la ubicaci\u00f3n externa. Este valor debe ser un entero positivo \
entre 0 y 23. Este valor s\u00f3lo es v\u00e1lido si est\u00e1 habilitada la invalidaci\u00f3n de planificaci\u00f3n.
HTTPTransport.displayName=Transporte HTTP
HTTPTransport.description=Transporte HTTP para comunicar peticiones al contenedor Web.
HTTPTransport.smallIcon=HTTPTransport.gif
HTTPTransport.largeIcon=HTTPTransport32X32.gif
DRSSettings.displayName=Mensajer\u00eda interna
DRSSettings.description=Configuraci\u00f3n de la duplicaci\u00f3n de sesiones de memoria a memoria.
DRSSettings.smallIcon=DRSSettings.gif
DRSSettings.largeIcon=DRSSettings32X32.gif
DRSSettings.dataReplicationMode.displayName=dataReplicationMode
DRSSettings.dataReplicationMode.description=Determina si la instancia de WebSphere env\u00eda s\u00f3lo datos a trav\u00e9s de duplicaci\u00f3n interna, los recibe o ambos.  La modalidad por omisi\u00f3n es ambos.
DRSSettings.messageBrokerDomainName.displayName=messageBrokerDomainName
DRSSettings.messageBrokerDomainName.description=Dominio de duplicaci\u00f3n interna utilizado por esta instancia de WebSphere.
DRSSettings.preferredLocalDRSBrokerName.displayName=preferredLocalDRSBrokerName
DRSSettings.preferredLocalDRSBrokerName.description=Duplicador espec\u00edfico dentro de un dominio de duplicaci\u00f3n al que se conecta inicialmente esta instancia de Websphere.
DRSSettings.overrideHostConnectionPoints.displayName=overrideHostConnectionPoints
DRSSettings.overrideHostConnectionPoints.description=Permite la configuraci\u00f3n de los puertos y la direcci\u00f3n IP espec\u00edfica de cualquier duplicador (por contraposici\u00f3n a tomarlos del dominio de duplicaci\u00f3n en la c\u00e9lula).
DRSSettings.hostPort.error=Sistemas principales y puertos no v\u00e1lidos o que no coinciden. Cada sistema principal especificado debe tener el correspondiente n\u00famero de puerto.
SessionPersistenceKind.NONE=NINGUNA
SessionPersistenceKind.DATABASE=DATABASE
SessionPersistenceKind.DATA_REPLICATION=DATA_REPLICATION

Server.displayName=Servidor
Server.description=Propiedad en el Modelo de servidor que identifica el Nombre de contexto de \
un contexto de modelo. Esto permite dar soporte al concepto de herencia de valores de \
configuraci\u00f3n, de manera que si el valor de configuraci\u00f3n no se establece en el contexto de \
servidor, el tiempo de ejecuci\u00f3n consultar\u00e1 el modelo identificado en la propiedad modelId (si \
existe) para la configuraci\u00f3n.
Server.smallIcon=Server.gif
Server.largeIcon=Server32X32.gif
Server.customServices.displayName=Servicios personalizados
Server.customServices.description=Define las clases de servicios personalizados que se ejecutar\u00e1n en este servidor y las propiedades de configuraci\u00f3n de los mismos.
Server.components.displayName=Componentes de servidor
Server.components.description=Componentes de tiempo de ejecuci\u00f3n adicionales configurables.
Server.components.ServerComponent.displayName=Componentes de servidor
Server.extensions.displayName=Extensiones
Server.started=Iniciado
Server.stopped=Parado
Service.displayName=Servicio
Service.description=Especifica los valores de configuraci\u00f3n de un servicio que se ejecuta en el servidor de aplicaciones.
Service.smallIcon=Service.gif
Service.largeIcon=Service32X32.gif
Service.context.displayName=contexto
Service.context.description=Contexto o entorno en el que se ejecuta el servicio.
Service.context.Component.displayName=Componentes
Service.context.Server.displayName=Servidores
Service.properties.displayName=Propiedades personalizadas
Service.properties.description=Propiedades personalizadas adicionales de este servicio que se pueden configurar.
Service.enable.displayName=Arranque
Service.enable.description=Especifica si el servidor intentar\u00e1 iniciar el servicio especificado cuando se inicie el servidor.
CustomService.displayName=Servicios personalizados
CustomService.description=Facilita la ampliaci\u00f3n de los datos de configuraci\u00f3n de los servicios de plug-in.  As\u00ed, permite que los clientes a\u00f1adan c\u00f3digo personalizado que se ejecutar\u00e1 durante la inicializaci\u00f3n del proceso.
CustomService.smallIcon=CustomService.gif
CustomService.largeIcon=CustomService32X32.gif
CustomService.prerequisiteServices.displayName=prerequisiteServices
CustomService.prerequisiteServices.description=Lista de referencias a otros servicios personalizados definidos en este proceso que este servicio personalizado esperar\u00e1 antes de ser inicializado.
CustomService.externalConfigURL.displayName=URL de configuraci\u00f3n externa
CustomService.externalConfigURL.description=Especifica el URL de un archivo de configuraci\u00f3n de servicios personalizados.
CustomService.classname.displayName=Nombre de clase
CustomService.classname.description=Especifica el nombre de clase de la implementaci\u00f3n del servicio. Esta clase debe implementar la interfaz de Servicio personalizado.
CustomService.displayName.displayName=Nombre de visualizaci\u00f3n
CustomService.displayName.description=Especifica el nombre del servicio.
CustomService.description.displayName=Descripci\u00f3n
CustomService.description.description=Describe el servicio personalizado.
CustomService.classpath.displayName=Classpath
CustomService.classpath.description=Especifica la classpath utilizada para ubicar las clases y archivos jar de este servicio.
ThreadPool.displayName=Agrupaci\u00f3n de hebras
ThreadPool.description=Las agrupaciones de hebras permiten que los componentes del servidor reutilicen las hebras para eliminar la necesidad de crear nuevas hebras en el tiempo de ejecuci\u00f3n, que es una operaci\u00f3n duradera que consume muchos recursos.
ThreadPool.smallIcon=ThreadPool.gif
ThreadPool.largeIcon=ThreadPool32X32.gif
ThreadPool.minimumSize.displayName=Tama\u00f1o m\u00ednimo
ThreadPool.minimumSize.description=Especifica el n\u00famero m\u00ednimo de hebras permitidas en la agrupaci\u00f3n.
ThreadPool.maximumSize.displayName=Tama\u00f1o m\u00e1ximo
ThreadPool.maximumSize.description=Especifica el n\u00famero m\u00e1ximo de hebras permitidas en la agrupaci\u00f3n.
ThreadPool.inactivityTimeout.description=Especifica el n\u00famero de milisegundos de inactividad que debe transcurrir antes de que se reclame una hebra.
ThreadPool.isGrowable.displayName=Con posibilidad de crecimiento
ThreadPool.isGrowable.description=Especifica si el n\u00famero de hebras puede aumentar por encima del tama\u00f1o m\u00e1ximo configurado para la agrupaci\u00f3n de hebras.
MessageFormatKind.BASIC=B\u00c1SICO
MessageFormatKind.ADVANCED=AVANZADO
ServiceContext.displayName=Contexto de servicio
ServiceContext.description=Contexto o entorno en el que se ejecuta un servicio.
ServiceContext.smallIcon=ServiceContext.gif
ServiceContext.largeIcon=ServiceContext32X32.gif
ServiceContext.services.displayName=Servicios
ServiceContext.services.description=Servicios que facilita el contenedor a los componentes que se ejecutan en el contexto del contenedor.  Los tipos de servicios suministrados por un contenedor est\u00e1n restringidos seg\u00fan el tipo de contenedor atendiendo a una comparaci\u00f3n del \u00e1mbito del servicio con el \u00e1mbito del contenedor.  
ServiceContext.services.CustomService.displayName=Servicios personalizados
Component.displayName=Componente
Component.description=Representa un proceso que contiene componentes a los que se puede llamar remotamente.  Un servidor representa la informaci\u00f3n de configuraci\u00f3n de un componente que se puede ejecutar independientemente de un componente padre en su propio proceso (como un servicio).  En la JVM se pueden ejecutar varios servidores.
Component.smallIcon=Component.gif
Component.largeIcon=Component32X32.gif
Component.properties.displayName=Propiedades personalizadas
Component.properties.description=Propiedades personalizadas adicionales de este componente de tiempo de ejecuci\u00f3n. Algunos componentes pueden utilizar propiedades de configuraci\u00f3n personalizada que se pueden definir aqu\u00ed.
Component.parentComponent.displayName=parentComponent
Component.parentComponent.description=Componente de tiempo de ejecuci\u00f3n m\u00e1s grande que contiene estos valores de configuraci\u00f3n.
Component.parentComponent.ServerComponent.displayName=ServerComponents
Component.components.displayName=componentes
Component.components.description=Componentes de tiempo de ejecuci\u00f3n adicionales configurables.
Component.components.ServerComponent.displayName=ServerComponents
Component.server.displayName=servidor
Component.server.description=Proceso (o conjunto de procesos que act\u00faan como un \u00fanico proceso l\u00f3gico) que se ejecuta en un nodo que proporciona servicios y recursos a aplicaciones de todos los contenedores y servicios que se est\u00e1n ejecutando en el mismo.
Agent.displayName=Agente
Agent.description=
Agent.smallIcon=Agent.gif
Agent.largeIcon=Agent32X32.gif
Server.stateManagement.displayName=Gesti\u00f3n de estado
Server.stateManagement.description=Capacidad de controlar el estado del recurso gestionado. En otras palabras, de iniciarlo y detenerlo.
Server.statisticsProvider.displayName=Proveedor de estad\u00edsticas
Server.statisticsProvider.description=Capacidad del recurso gestionado para generar medidas de rendimiento.
ManagedObject.name.displayName=Nombre
ManagedObject.name.description=Nombre que utiliza el objeto gestionado que representa este objeto activo.  Este nombre de objeto gestionado act\u00faa como un componente de un nombre jer\u00e1rquico calculado que se puede utilizar con un proceso ManagementAgent para localizar la interfaz operativa de control del objeto activo en el tiempo de ejecuci\u00f3n.
ExecutionState.START=INICIAR
ExecutionState.STOP=DETENER
StateManageable.displayName=StateManageable
StateManageable.description=Representa los valores de configuraci\u00f3n de los objetos gestionados que tienen un ciclo de vida (inicio, detenci\u00f3n, etc.).
StateManageable.smallIcon=StateManageable.gif
StateManageable.largeIcon=StateManageable32X32.gif
StateManageable.managedObject.displayName=managedObject
StateManageable.managedObject.description=Objeto que se puede iniciar o detener.
StateManageable.managedObject.ServiceContext.displayName=ServiceContexts
StateManageable.initialState.displayName=Estado inicial
StateManageable.initialState.description=Estado de ejecuci\u00f3n solicitado cuando se inicie el servidor por primera vez.
ServerComponent.StateManageable.initialState.description=Estado de ejecuci\u00f3n del componente solicitado cuando se inicie el servidor por primera vez.
StatisticsProvider.displayName=StatisticsProvider
StatisticsProvider.description=Especifica los valores de configuraci\u00f3n de los objetos gestionados que proporcionan informaci\u00f3n estad\u00edstica, como son los datos de rendimiento.
StatisticsProvider.smallIcon=StatisticsProvider.gif
StatisticsProvider.largeIcon=StatisticsProvider32X32.gif
StatisticsProvider.managedObject.displayName=managedObject
StatisticsProvider.managedObject.description=Objeto que proporciona medidas de rendimiento.
StatisticsProvider.managedObject.ServiceContext.displayName=ServiceContexts
StatisticsProvider.specification.displayName=especificaci\u00f3n
StatisticsProvider.specification.description=Serie de especificaci\u00f3n que se puede utilizar para determinar valores de supervisi\u00f3n de rendimiento del objeto gestionado.
Extension.displayName=Extensi\u00f3n
Extension.description=
Extension.smallIcon=Extension.gif
Extension.largeIcon=Extension32X32.gif
Extension.name.displayName=nombre
Extension.name.description=
Extension.configURI.displayName=configURI
Extension.configURI.description=
ServerComponent.displayName=Componente de servidor
ServerComponent.description=Este panel proporciona acceso a los valores de configuraci\u00f3n relacionados con tipos espec\u00edficos de funcionalidad del servidor, como los valores Application Server, JMS Server y Name Server. Dependiendo del tipo primario de servidor, la lista de componentes de servidor que tenga configurada puede variar.
ServerComponent.smallIcon=ServerComponent.gif
ServerComponent.largeIcon=ServerComponent32X32.gif
Server.name.displayName=Nombre
Server.name.description=Nombre del servidor.
Server.adminService.displayName=Servicios de administraci\u00f3n
Server.adminService.description=Especifica varios valores para el servicio de administraci\u00f3n de este servidor, como por ejemplo los valores y tiempos de espera del protocolo de comunicaci\u00f3n administrativa.

AdminService.displayName=Servicio de administraci\u00f3n
AdminService.description=L\u00f3gica de servicio que controla toda la funci\u00f3n administrativa en el proceso gestionado.
AdminService.smallIcon=AdminService.gif
AdminService.largeIcon=AdminService32X32.gif
AdminService.connectors.displayName=Conectores JMX
AdminService.connectors.description=Los conectores proporcionan un canal de comunicaci\u00f3n entre los procesos gestionados por WebSphere bas\u00e1ndose en un determinado protocolo de comunicaciones.
AdminService.connectors.HTTPConnector.displayName=HTTPConnectors
AdminService.connectors.JMSConnector.displayName=JMSConnectors
AdminService.connectors.RMIConnector.displayName=RMIConnectors
AdminService.connectors.SOAPConnector.displayName=SOAPConnectors
AdminService.preferredConnector.displayName=Conector preferido
AdminService.preferredConnector.description=Especifica el tipo de conector JMX preferido. Las opciones disponibles, tales como SOAPConnector o RMIConnector, se definen mediante la p\u00e1gina Conectores JMX.
AdminService.preferredConnector.HTTPConnector.displayName=HTTPConnector
AdminService.preferredConnector.JMSConnector.displayName=JMSConnector
AdminService.preferredConnector.RMIConnector.displayName=RMIConnector
AdminService.preferredConnector.SOAPConnector.displayName=SOAPConnector
AdminService.extensionMBeanProviders.displayName=Proveedores de MBean de extensi\u00f3n
AdminService.extensionMBeanProviders.description=Lista de bibliotecas que contienen elementos que soportan el mecanismo ExtensionMBean para ampliar el servicio de administraci\u00f3n con JMX MBeans adicionales.
AdminService.configRepository.displayName=Servicio de dep\u00f3sito
AdminService.configRepository.description=Datos de configuraci\u00f3n utilizados por la implementaci\u00f3n del servicio de dep\u00f3sito.
AdminService.standalone.displayName=Aut\u00f3nomo
AdminService.standalone.description=Especifica si el proceso del servidor participa en la c\u00e9lula de Network Deployment. Si el valor es true, el servidor no participa en la administraci\u00f3n distribuida. Si el valor es false, el servidor participa en el sistema de Network Deployment.
JMXConnector.displayName=Conectores JMX
JMXConnector.description=Los conectores proporcionan un canal de comunicaci\u00f3n entre los procesos gestionados por WebSphere bas\u00e1ndose en un determinado protocolo de comunicaciones.
JMXConnector.smallIcon=JMXConnector.gif
JMXConnector.largeIcon=JMXConnector32X32.gif
JMXConnector.properties.displayName=Propiedades personalizadas
JMXConnector.properties.description=Propiedades de configuraci\u00f3n arbitrarias que se aplican a este conector JMX.
jmx=Conectores JMX
ExtensionMBean.displayName=ExtensionMBean
ExtensionMBean.description=Identifica d\u00f3nde est\u00e1n situados los metadatos de MBean.
ExtensionMBean.smallIcon=ExtensionMBean.gif
ExtensionMBean.largeIcon=ExtensionMBean32X32.gif
ExtensionMBean.descriptorURI.displayName=descriptorURI
ExtensionMBean.descriptorURI.description=Ubicaci\u00f3n del descriptor de MBean 
ExtensionMBean.type.displayName=tipo
ExtensionMBean.type.description=Tipo del MBean.
HTTPConnector.displayName=HTTPConnector
HTTPConnector.description=Conector JMX que da soporte al protocolo de comunicaciones HTTP .
HTTPConnector.smallIcon=HTTPConnector.gif
HTTPConnector.largeIcon=HTTPConnector32X32.gif
JMSConnector.displayName=JMSConnector
JMSConnector.description=No hay ning\u00fan conector JMS implementado en 5.0. Esto es un elemento de l\u00ednea posterior a la 5.0.
JMSConnector.smallIcon=JMSConnector.gif
JMSConnector.largeIcon=JMSConnector32X32.gif
RMIConnector.displayName=RMIConnector
RMIConnector.description=Conector JMX que da soporte al protocolo de comunicaciones RMI .
RMIConnector.smallIcon=RMIConnector.gif
RMIConnector.largeIcon=RMIConnector32X32.gif
SOAPConnector.displayName=SOAPConnector
SOAPConnector.description=MI communiConector JMX que da soporte al protocolo de comunicaciones SOAP .
SOAPConnector.smallIcon=SOAPConnector.gif
SOAPConnector.largeIcon=SOAPConnector32X32.gif
RepositoryService.displayName=Servicio de dep\u00f3sito
RepositoryService.description=L\u00f3gica de servicio que gestiona el dep\u00f3sito de configuraci\u00f3n.
RepositoryService.smallIcon=RepositoryService.gif
RepositoryService.largeIcon=RepositoryService32X32.gif
RepositoryService.lockTimeout.displayName=Tiempo de espera de bloqueo
RepositoryService.lockTimeout.units=minutos
RepositoryService.lockTimeout.description=Especifica el n\u00famero de minutos que deben transcurrir antes de desbloquear autom\u00e1ticamente el bloqueo de un dep\u00f3sito que no se ha desbloqueado manualmente.
RepositoryService.auditEnabled.displayName=Auditor\u00eda habilitada
RepositoryService.auditEnabled.description=Actualizaciones del dep\u00f3sito de auditor\u00edas en el archivo de anotaciones cronol\u00f3gicas.
ExtensionMBeanProvider.displayName=Proveedores de MBean de extensi\u00f3n
ExtensionMBeanProvider.description=Biblioteca que contiene una implementaci\u00f3n de un JMX MBean, y del archivo descriptor XML de MBean, que se va a utilizar para ampliar los recursos gestionados por WebSphere en el sistema administrativo central. 
ExtensionMBeanProvider.smallIcon=ExtensionMBeanProvider.gif
ExtensionMBeanProvider.largeIcon=ExtensionMBeanProvider32X32.gif
ExtensionMBeanProvider.extensionMBeans.displayName=extensionMBeans
ExtensionMBeanProvider.extensionMBeans.description=Definiciones de MBean que no est\u00e1n incluidas en el producto b\u00e1sico WebSphere.
ExtensionMBeanProvider.classpath.displayName=Classpath
ExtensionMBeanProvider.classpath.description=Classpath dentro de la biblioteca del proveedor donde se puede localizar el descriptor de MBean. El cargador de clase necesita esta informaci\u00f3n para cargar y analizar el archivo descriptor XML de MBean de extensi\u00f3n.
ExtensionMBeanProvider.description.displayName=Descripci\u00f3n
ExtensionMBeanProvider.description.description=Texto descriptivo arbitrario para la configuraci\u00f3n del proveedor de MBean de extensi\u00f3n. Utilice esta campo para cualquier texto que sirva para identificar/diferenciar la configuraci\u00f3n del proveedor.
ExtensionMBeanProvider.name.displayName=Nombre
ExtensionMBeanProvider.name.description=Nombre que desea utilizar para identificar la biblioteca del proveedor de MBean de extensi\u00f3n.
JMXConnector.type.displayName=Tipo
JMXConnector.type.description=Tipo de conector JMX.

JavaProcessDef.displayName=Definici\u00f3n de proceso Java
JavaProcessDef.description=Los procesos Java precisan informaci\u00f3n adicional que se puede dar a la m\u00e1quina virtual de Java al generar el proceso.
JavaProcessDef.smallIcon=JavaProcessDef.gif
JavaProcessDef.largeIcon=JavaProcessDef32X32.gif
JavaProcessDef.jvmEntries.displayName=jvmEntries
JavaProcessDef.jvmEntries.description=Lista de configuraciones para m\u00e1quinas virtuales Java asociadas con este servidor.
JavaProcessDef.executableTargetKind.displayName=executableTargetKind
JavaProcessDef.executableTargetKind.description=Especifica si un nombre de clase Java o el nombre de un jar ejecutable se puede utilizar como destino ejecutable de este proceso Java.
JavaProcessDef.executableTarget.displayName=executableTarget
JavaProcessDef.executableTarget.description=Nombre del destino ejecutable (una clase Java que contenga un m\u00e9todo main(), o el nombre de un jar ejecutable), seg\u00fan executableTargetKind.
ProcessDef.displayName=Definici\u00f3n de proceso
ProcessDef.description=Una definici\u00f3n de proceso establece la informaci\u00f3n de l\u00ednea de mandatos necesaria para empezar o inicializar un proceso.
ProcessDef.smallIcon=ProcessDef.gif
ProcessDef.largeIcon=ProcessDef32X32.gif
ProcessDef.execution.displayName=Ejecuci\u00f3n de proceso
ProcessDef.execution.description=Conjunto de propiedades que controlan c\u00f3mo se ejecuta el proceso del sistema operativo, como por ejemplo los permisos RunAs, mascara U y la prioridad de proceso.
ProcessDef.ioRedirect.displayName=Anotaciones cronol\u00f3gicas de proceso
ProcessDef.ioRedirect.description=Conjunto de propiedades que controlan c\u00f3mo se direccionan las corrientes de datos de entrada/salida nativas de proceso.
ProcessDef.environment.displayName=Entradas del entorno
ProcessDef.environment.description=Lista de valores que desea a\u00f1adir al entorno de ejecuci\u00f3n del proceso.
ProcessDef.monitoringPolicy.displayName=Pol\u00edticas de supervisi\u00f3n
ProcessDef.monitoringPolicy.description=Conjunto de propiedades que controlan c\u00f3mo el agente de nodo supervisa el proceso.
ProcessDef.executableName.displayName=Nombre ejecutable
ProcessDef.executableName.description=Especifica el nombre ejecutable del proceso.
ProcessDef.executableArguments.displayName=Argumentos ejecutables
ProcessDef.executableArguments.description=Especifica los mandatos ejecutables que se ejecutan cuando se inicia el proceso.
ProcessDef.workingDirectory.displayName=Directorio de trabajo
ProcessDef.workingDirectory.description=Especifica el directorio del directorio del sistema de archivos donde se ejecutar\u00e1 el proceso.
ProcessExecution.displayName=Ejecuci\u00f3n de proceso
ProcessExecution.description=Configuraci\u00f3n de valores adicionales de ejecuci\u00f3n de procesos. Estos valores no se utilizan en la plataforma Windows.
ProcessExecution.smallIcon=ProcessExecution.gif
ProcessExecution.largeIcon=ProcessExecution32X32.gif
ProcessExecution.processPriority.displayName=Prioridad de proceso
ProcessExecution.processPriority.description=Especifica la prioridad del sistema operativo para el proceso. S\u00f3lo los usuarios root pueden cambiar este valor.
ProcessExecution.umask.displayName=M\u00c1SCARA U
ProcessExecution.umask.description=Especifica la m\u00e1scara de usuario bajo la que se ejecuta el proceso (m\u00e1scara de permiso de modalidad de archivo).
ProcessExecution.runAsUser.displayName=Ejecutar como usuario
ProcessExecution.runAsUser.description=Especifica el usuario como el que se ejecuta el proceso.
ProcessExecution.runAsGroup.displayName=Ejecutar como grupo
ProcessExecution.runAsGroup.description=Especifica el grupo del que es miembro el proceso y como el que se ejecuta.
ProcessExecution.runInProcessGroup.displayName=Ejecutar en grupo de proceso
ProcessExecution.runInProcessGroup.description=Especifica el proceso para un grupo de proceso espec\u00edfico. Esto resulta \u00fatil para realizar tareas como las particiones de procesadores. El administrador de sistemas puede asignar un grupo de proceso para que se ejecute en 6 procesadores de 12, por ejemplo. El valor por omisi\u00f3n (0) es no asignar el proceso a ning\u00fan grupo espec\u00edfico.
OutputRedirect.displayName=Redirecci\u00f3n de la salida
OutputRedirect.description=Redirige las corrientes de datos de entrada, salida o error a los archivos que se especifiquen.
OutputRedirect.smallIcon=OutputRedirect.gif
OutputRedirect.largeIcon=OutputRedirect32X32.gif
OutputRedirect.stdinFilename.displayName=Nombre de archivo de entrada est\u00e1ndar
OutputRedirect.stdinFilename.description=Redirige la salida y la entrada de archivos de las corrientes est\u00e1ndar.
OutputRedirect.stdoutFilename.displayName=Nombre de archivo de salida est\u00e1ndar
OutputRedirect.stdoutFilename.description=Especifica el archivo al que se dirigir\u00e1 la corriente de datos de salida est\u00e1ndar. El nombre de archivo puede incluir un nombre de v\u00eda de acceso simb\u00f3lico definido en las entradas de variables.
OutputRedirect.stderrFilename.displayName=Nombre de archivo de error est\u00e1ndar
OutputRedirect.stderrFilename.description=Especifica el archivo al que se dirigir\u00e1 la corriente de datos de error est\u00e1ndar. El nombre de archivo puede incluir un nombre de v\u00eda de acceso simb\u00f3lico definido en las entradas de variables.
JavaVirtualMachine.displayName=M\u00e1quina virtual Java
JavaVirtualMachine.description=Valores avanzados de la m\u00e1quina virtual Java.
JavaVirtualMachine.smallIcon=JavaVirtualMachine.gif
JavaVirtualMachine.largeIcon=JavaVirtualMachine32X32.gif
JavaVirtualMachine.systemProperties.displayName=Propiedades personalizadas
JavaVirtualMachine.systemProperties.description=Propiedades del sistema Java que desea establecer en la memoria de esta JVM.
ManagedObject.stateManagement.description=Capacidad de controlar el estado del recurso gestionado. En otras palabras, de iniciarlo y detenerlo.
JavaVirtualMachine.classpath.displayName=Classpath
JavaVirtualMachine.classpath.description=Especifica la classpath est\u00e1ndar donde la m\u00e1quina virtual Java busca las clases.
JavaVirtualMachine.bootClasspath.displayName=Classpath de arranque
JavaVirtualMachine.bootClasspath.description=Especifica las clases y recursos de rutina de carga de una JVM. Esta opci\u00f3n s\u00f3lo est\u00e1 disponible para las JVM que dan soporte a las clases y recursos de rutina de carga. Debe separar las distintas v\u00edas de acceso con dos puntos (:) o un punto y coma (;), seg\u00fan el sistema operativo del nodo.
JavaVirtualMachine.verboseModeClass.displayName=Carga de clase verbosa
JavaVirtualMachine.verboseModeClass.description=Especifica si se debe utilizar la salida de depuraci\u00f3n verbosa en la carga de clases. El valor por omisi\u00f3n es no habilitar la carga de clase verbosa.
JavaVirtualMachine.verboseModeGarbageCollection.displayName=Recogida de basura verbosa
JavaVirtualMachine.verboseModeGarbageCollection.description=Especifica si se debe utilizar la salida de depuraci\u00f3n verbosa en la recogida de basura. El valor por omisi\u00f3n es no habilitar la recogida de basura verbosa.
JavaVirtualMachine.verboseModeJNI.displayName=JNI verbosa
JavaVirtualMachine.verboseModeJNI.description=Especifica si se debe utilizar la salida de depuraci\u00f3n verbosa en la invocaci\u00f3n de m\u00e9todo nativo. El valor por omisi\u00f3n es no habilitar JNI verbosa.
JavaVirtualMachine.initialHeapSize.displayName=Tama\u00f1o de almacenamiento din\u00e1mico inicial
JavaVirtualMachine.initialHeapSize.description=Especifica el tama\u00f1o del almacenamiento din\u00e1mico inicial disponible para la JVM (en megabytes). 
JavaVirtualMachine.maximumHeapSize.displayName=Tama\u00f1o m\u00e1ximo del almacenamiento din\u00e1mico
JavaVirtualMachine.maximumHeapSize.description=Especifica el tama\u00f1o m\u00e1ximo de almacenamiento disponible para la JVM, en megabytes.  El valor por omisi\u00f3n es 256.
JavaVirtualMachine.runHProf.displayName=Ejecutar HProf
JavaVirtualMachine.runHProf.description=Especifica si se debe utilizar el soporte de perfiles de HProf. Para utilizar otros perfiles, especifique los valores de perfiles personalizados utilizando el valor de Argumentos HProf.  El valor por omisi\u00f3n es no habilitar el soporte de perfiles de HProf.
JavaVirtualMachine.hprofArguments.displayName=Argumentos HProf
JavaVirtualMachine.hprofArguments.description=Especifica los argumentos de perfiles de l\u00ednea de mandatos que se pasan a la m\u00e1quina virtual Java que inicia el proceso del servidor de aplicaciones. Puede especificar argumentos cuando el soporte de perfiles de HProf est\u00e1 habilitado.
JavaVirtualMachine.debugMode.displayName=Modalidad de depuraci\u00f3n
JavaVirtualMachine.debugMode.description=Especifica si se debe utilizar la salida de depuraci\u00f3n de JVM. El valor por omisi\u00f3n es no habilitar el soporte de modalidad de depuraci\u00f3n.
JavaVirtualMachine.debugArgs.displayName=Argumentos de depuraci\u00f3n
JavaVirtualMachine.debugArgs.description=Especifica los argumentos de depuraci\u00f3n de l\u00ednea de mandatos que se pasan a la m\u00e1quina virtual Java que inicia el proceso del servidor de aplicaciones. Puede especificar argumentos cuando la modalidad de depuraci\u00f3n est\u00e1 habilitada.
JavaVirtualMachine.genericJvmArguments.displayName=Argumentos de JVM gen\u00e9ricos
JavaVirtualMachine.genericJvmArguments.description=Argumentos adicionales de l\u00ednea de mandatos para la JVM.
JavaVirtualMachine.executableJarFileName.displayName=Nombre del archivo JAR ejecutable
JavaVirtualMachine.executableJarFileName.description=Especifica un nombre completo de v\u00eda de acceso para un archivo jar ejecutable que utiliza la m\u00e1quina virtual Java.
JavaVirtualMachine.disableJIT.displayName=Inhabilitar JIT
JavaVirtualMachine.disableJIT.description=Configura la JVM de modo que el compilador JIT (Just-In-Time) est\u00e9 inhabilitado.
JavaVirtualMachine.osName.displayName=Nombre del sistema operativo
JavaVirtualMachine.osName.description=Especifica los valores de JVM para un sistema operativo determinado. Cuando se inicia, el proceso utilizar\u00e1 los valores de JVM del sistema operativo del nodo.
MonitoringPolicy.displayName=MonitoringPolicy
MonitoringPolicy.description=Valores de pol\u00edticas para la supervisi\u00f3n del rendimiento del servidor de aplicaciones.
MonitoringPolicy.smallIcon=MonitoringPolicy.gif
MonitoringPolicy.largeIcon=MonitoringPolicy32X32.gif
MonitoringPolicy.maximumStartupAttempts.displayName=N\u00famero m\u00e1ximo de intentos de arranque
MonitoringPolicy.maximumStartupAttempts.units=intentos
MonitoringPolicy.maximumStartupAttempts.description=Especifica el n\u00famero m\u00e1ximo de intentos de arrancar el servidor de aplicaciones antes de abandonar.
MonitoringPolicy.pingInterval.displayName=Intervalo de ping
MonitoringPolicy.pingInterval.units=segundos
MonitoringPolicy.pingInterval.description=Especifica la frecuencia de los intentos de comunicaci\u00f3n entre el proceso padre, como el agente de nodo, y el proceso que ha generado, como un servidor de aplicaciones. Ajuste este valor bas\u00e1ndose en sus requisitos para reiniciar servidores con anomal\u00edas. Si reduce el valor se detectan las anomal\u00edas m\u00e1s r\u00e1pido; si aumenta el valor se reduce la frecuencia de los pings, reduciendo la carga del sistema.
MonitoringPolicy.pingTimeout.displayName=Tiempo de espera de ping
MonitoringPolicy.pingTimeout.units=segundos
MonitoringPolicy.pingTimeout.description=Intervalo despu\u00e9s del cual no se espera ninguna respuesta del proceso supervisado para indicar que no es correcto.
MonitoringPolicy.pingInitialTimeout.displayName=Tiempo de espera inicial de ping
MonitoringPolicy.pingInitialTimeout.units=segundos
MonitoringPolicy.pingInitialTimeout.description=Especifica el tiempo m\u00e1ximo, en segundos, que tarda el servidor en finalizar la inicializaci\u00f3n. Cuando termina este tiempo, el servidor de administraci\u00f3n intenta reiniciar el servidor.
MonitoringPolicy.autoRestart.displayName=Reinicio autom\u00e1tico
MonitoringPolicy.autoRestart.description=Especifica si se debe reiniciar el proceso autom\u00e1ticamente si se produce un error. El valor por omisi\u00f3n es reiniciar el proceso autom\u00e1ticamente.
MonitoringPolicy.nodeRestartState.displayName=Estado de reinicio de nodo
MonitoringPolicy.nodeRestartState.description=Especifica el estado de proceso alcanzado si el reinicio autom\u00e1tico est\u00e1 habilitado.  Las opciones son: DETENIDO, EN EJECUCI\u00d3N, ANTERIOR. El valor por omisi\u00f3n es DETENIDO.
ExecutableTargetKind.JAVA_CLASS=JAVA_CLASS
ExecutableTargetKind.EXECUTABLE_JAR=EXECUTABLE_JAR
RestartStateKind.STOPPED=DETENIDO
RestartStateKind.RUNNING=EN EJECUCI\u00d3N
RestartStateKind.PREVIOUS=ANTERIOR

Server.services.DebugService.displayName=Servicio de depuraci\u00f3n
Server.services.DebugService.description=Especificar valores del servicio de depuraci\u00f3n que se utilizar\u00e1n junto con una aplicaci\u00f3n cliente de depuraci\u00f3n de espacio de trabajo.
DebugService.displayName=Servicio de depuraci\u00f3n
DebugService.description=Modelo de los atributos necesarios para depurar una JVM y diversos componentes, como el gestor de BSF
DebugService.smallIcon=DebugService.gif
DebugService.largeIcon=DebugService32X32.gif
DebugService.jvmDebugPort.displayName=Puerto de depuraci\u00f3n de JVM
DebugService.jvmDebugPort.description=Puerto en el que escuchar\u00e1 la JVM la recepci\u00f3n de conexiones de depuraci\u00f3n.  
DebugService.jvmDebugArgs.displayName=Argumentos de depuraci\u00f3n de JVM
DebugService.jvmDebugArgs.description=Serie de argumentos de depuraci\u00f3n utilizados para indicar a la JVM que se inicie en modalidad de depuraci\u00f3n.  
DebugService.debugClassFilters.displayName=Filtros de clases de depuraci\u00f3n
DebugService.debugClassFilters.description=Matriz de clases que se filtrar\u00e1n durante la depuraci\u00f3n. Cuando se ejecuta en modalidad paso a paso, el depurador no se detendr\u00e1 en las clases que coinciden con una entrada del filtro.  
DebugService.BSFDebugPort.displayName=Puerto de depuraci\u00f3n de BSF
DebugService.BSFDebugPort.description=Puerto en el que comenzar\u00e1 a escuchar el gestor de depuraci\u00f3n de BSF.  
DebugService.BSFLoggingLevel.displayName=Nivel de registro cronol\u00f3gico de BSF
DebugService.BSFLoggingLevel.description=Nivel de registro cronol\u00f3gico que proporcionar\u00e1 el gestor de depuraci\u00f3n de BSF.
servermanagement.button.add=A\u00f1adir>
BSFLoggingLevel.NOLOGGING=0-Sin registro cronol\u00f3gico
BSFLoggingLevel.SOMELOGGING=1-Poco registro cronol\u00f3gico 
BSFLoggingLevel.MORELOGGING=2-M\u00e1s registro cronol\u00f3gico
BSFLoggingLevel.LOTOFLOGGING=3-Mucho registro cronol\u00f3gico
DebugService.portchanged.info1=Los JVMdebugArgs de DebugService se han cambiado para sincronizar con el debugPort de DebugService especificado
DebugService.portchanged.info2= El JVMdebugPort de DebugService se ha cambiado para sincronizar con el puerto de debugargs de JVM especificado con direcci\u00f3n

JMSServer.displayName=Servidores JMS
JMSServer.description=El servidor de JMS sirve las funciones JMS en un nodo dentro del dominio de administraci\u00f3n de WebSphere Application Server.  Utilice este panel para ver o cambiar las propiedades de configuraci\u00f3n del servidor de JMS seleccionado.
JMSServer.smallIcon=JMSServer.gif
JMSServer.largeIcon=JMSServer32X32.gif
JMSServer.securityPort.displayName=Punto final del puerto de seguridad
JMSServer.securityPort.description=N\u00famero de puerto TCP/IP del puerto receptor utilizado internamente por el servidor de JMS.
JMSServer.description.displayName=Descripci\u00f3n
JMSServer.description.description=Descriptor del servidor de JMS, a efectos administrativos.
JMSServer.numThreads.displayName=N\u00famero de hebras
JMSServer.numThreads.description=N\u00famero de hebras simult\u00e1neas que el motor Pub/Sub coincidente va a utilizar.
JMSServer.queueNames.displayName=Nombres de colas
JMSServer.queueNames.description=Los nombres de las colas que alberga este servidor de JMS.
JMSServer.must.be.selected=Debe seleccionar al menos un servidor de JMS para efectuar esta acci\u00f3n.
jmsserver.cannot.be.started=JMSServer no puede iniciarse porque no se ha instalado Embedded Messaging en el nodo {0}.
JMSTransport.displayName=JMSTransport
JMSTransport.description=
JMSTransport.smallIcon=JMSTransport.gif
JMSTransport.largeIcon=JMSTransport32X32.gif
EndPoint.displayName=Punto final del puerto de seguridad
EndPoint.description=Descripci\u00f3n del punto final del puerto de seguridad
EndPoint.host.displayName=Sistema principal
EndPoint.host.description=Direcci\u00f3n IP, nombre de sistema principal DNS con sufijo de nombre de dominio, o s\u00f3lo nombre de sistema principal DNS, utilizado por un cliente para solicitar un recurso de aplicaciones Web (como un servlet, una JSP o una p\u00e1gina HTML).
EndPoint.port.displayName=Puerto
EndPoint.port.description=El puerto con el que se ha configurado el servidor Web para que acepte las peticiones de los clientes. Especifique un valor de puerto junto con el nombre del sistema principal.

NameServer.displayName=Servidor de nombres
NameServer.description=Proveedor de servicios de denominaci\u00f3n del servidor de aplicaciones.
NameServer.smallIcon=NameServer.gif
NameServer.largeIcon=NameServer32X32.gif
NameServer.bootstrapServerAddress.displayName=bootstrapServerAddress
NameServer.bootstrapServerAddress.description=La direcci\u00f3n del servidor de rutina de carga es el punto final del servidor de rutina de carga del servidor de nombres. Un punto final incluye un nombre de sistema principal y un n\u00famero de puerto.  Los clientes de nombres especifican el puerto y el sistema principal del servidor de rutina de carga para obtener un contexto de denominaci\u00f3n inicial a partir del servidor de nombres asociado.

Service.type.displayName=Tipo de servicio
Service.type.description=Tipo del servicio.
nav.websphere.servers    
Domain.webcontainers.displayName=Contenedores Web

webcontainer.description=Configura el contenedor Web
webcontainer.detail.title=Contenedor Web
webcontainer.displayName=Contenedor Web
webcontainer.threadpool.displayName=Agrupaci\u00f3n de hebras
webcontainer.sessionmanager.displayName=Gesti\u00f3n de sesiones
webcontainer.sessionmanager.description=Configurar el gestor de sesiones asociado con este contenedor Web.
webcontainer.httptransports.displayName=Transportes de HTTP
webcontainer.httptransports.description=Configurar los transportes de HTTP asociados con este contenedor Web.
webcontainer.virtualhost.displayName=Sistema principal virtual por omisi\u00f3n:
webcontainer.virtualhost.description=Sistema principal virtual por omisi\u00f3n de este servidor
webcontainer.enableServletCaching.displayName=Colocaci\u00f3n en antememoria de servlets
webcontainer.enableServletCaching.description=Habilita la colocaci\u00f3n en antememoria de servlets.
webcontainer.enableServletCaching.units=Habilitar colocaci\u00f3n en antememoria de servlets


ThreadPool.size.units=hebras
ThreadPool.inactivityTimeout.displayName=Tiempo de espera de inactividad de hebra
ThreadPool.inactivityTimeout.units=milisegundos
ThreadPool.isGrowable.units=Permite la asignaci\u00f3n de hebras por encima del tama\u00f1o m\u00e1ximo de hebra.

SessionManager.sessionTracking.displayName=Mecanismo de seguimiento de sesiones:
SessionManager.displayName=Gesti\u00f3n de sesiones
SessionManager.sessionDatabasePersistence.description=Especifica los par\u00e1metros de ajuste en un entorno distribuido
SessionManager.tuningParams.displayName=Par\u00e1metros de ajuste personalizado
SessionManager.description=Las propiedades de configuraci\u00f3n del gestor de sesiones permiten controlar el comportamiento del soporte de sesiones HTTP
SessionManager.sessionTracking.description=Especifica un mecanismo para la gesti\u00f3n de sesiones HTTP.
SessionManager.overflow.displayName=Desbordamiento:
SessionManager.overflow.description=Especifica si se permite que el n\u00famero de sesiones en memoria exceda el valor especificado en la propiedad N\u00famero m\u00e1ximo de sesiones en memoria. Este valor s\u00f3lo es v\u00e1lido en modalidad de sesiones no persistentes.
SessionManager.overflow.units=Permitir desbordamiento
SessionManager.sessionCount.displayName=Recuento m\u00e1ximo de sesiones en memoria:
SessionManager.sessionCount.description=Especifica el n\u00famero m\u00e1ximo de sesiones que se deben mantener en memoria.
SessionManager.sessionTimeout.displayName=Tiempo de espera de sesiones:
SessionManager.sessionTimeout.description=Especifica cu\u00e1nto tiempo puede estar una sesi\u00f3n sin \
ser utilizada antes de que deje de considerarse v\u00e1lida. Especifique "Establecer tiempo de \
espera" o "Sin tiempo de espera". Si decide establecer el tiempo de espera, el valor debe ser \
de al menos dos minutos, especificado en minutos.
SessionManager.sessionTimeout.noTimeout=Sin tiempo de espera
SessionManager.sessionTimeout.setTimeout=Establecer tiempo de espera
SessionManager.sessionTimeout.units=minutos
SessionManager.sessionTracking.sslEnabled=Habilitar seguimiento de ID de SSL
SessionManager.sessionTracking.cookiesEnabled=Habilitar cookies
SessionManager.sessionTracking.urlRewritingEnabled=Habilitar reescritura de URL
SessionManager.sessionTracking.protocolRewritingEnabled=Habilitar reescritura del conmutador de protocolos
SessionManager.sessionCount.units=sesiones
SessionManager.button.modify=Modificar...
SessionManager.defaultCookieSettings.displayName=Valores de cookies
SessionManager.persistence.displayName=Valores de entorno distribuido
SessionManager.persistence.description=Especificar el tipo de persistencia de sesiones.
SessionManager.serialAccess.displayName=Acceso a sesiones serializado:
SessionManager.serialAccess.description=Acceso a sesiones serializado indica si se debe inhabilitar el acceso de sesiones simult\u00e1neas en un servidor dado (JVM).
SessionManager.serialAccess.units=Permitir el acceso serializado
SessionManager.maxWaitTime.displayName=Tiempo de espera m\u00e1ximo
SessionManager.maxWaitTime.description=Descripci\u00f3n del tiempo de espera m\u00e1ximo
SessionManager.maxWaitTime.units=segundos
SessionManager.accessOnTimeout.displayName=Acceso a sesiones en tiempo de espera
SessionManager.accessOnTimeout.description=Descripci\u00f3n del tiempo de espera
SessionManager.accessOnTimeout.units=Permitir el acceso en tiempo de espera
SessionManager.enable.displayName=Sobrescribir la gesti\u00f3n de sesiones
SessionManager.enable.description=Especifica si se van a utilizar estos valores de SessionManager para el m\u00f3dulo actual. El valor por omisi\u00f3n es utilizar los valores del gestor de sesiones definidos en el objeto padre.
SessionManager.enable.units=Sobrescribir
SessionManager.securityIntegration.displayName=Integraci\u00f3n de seguridad
SessionManager.securityIntegration.description=Si se ha habilitado la integraci\u00f3n de seguridad, el gestor de sesiones asociar\u00e1 la identidad de usuarios con sus sesiones HTTP.
SessionManager.securityIntegration.units=Habilitar

Cookie.displayName=Cookies
Cookie.description=Especificar los valores de cookies para la gesti\u00f3n de sesiones HTTP.
Cookie.secure.displayName=Cookies de seguridad
Cookie.secure.units=Restringir las cookies a sesiones HTTPS
Cookie.domain.displayName=Dominio de cookie
Cookie.maximumAge.displayName=Antig\u00fcedad m\u00e1xima de cookie
Cookie.path.displayName=V\u00eda de acceso de cookie
Cookie.name.displayName=Nombre de cookie
Cookie.name.description=Nombre \u00fanico para la cookie que desea utilizar en la gesti\u00f3n de sesiones.  La especificaci\u00f3n de servlets necesita que este nombre sea JSESSIONID. NO obstante, este valor se puede configurar para aumentar la flexibilidad.
Cookie.secure.description=Especifica si las cookies de sesi\u00f3n incluyen el campo seguro. Si se habilita esta caracter\u00edstica, se restringir\u00e1 el intercambio de cookies s\u00f3lo a sesiones HTTPS.
Cookie.domain.description=Valor del campo de dominio de una cookie de rastreo de sesiones. Este valor dictar\u00e1 al navegador si debe enviar o no una cookie a servidores determinados. Por ejemplo, si especifica un dominio determinado, las cookies de la sesi\u00f3n s\u00f3lo se enviar\u00e1n a los sistemas principales de ese dominio. El dominio por omisi\u00f3n es el servidor.
Cookie.maximumAge.description=Tiempo que la cookie estar\u00e1 en vigor en el navegador del cliente. Este valor corresponde al valor TTL (tiempo de duraci\u00f3n) descrito en la especificaci\u00f3n de la cookie.  
Cookie.path.description=Este valor dicta al navegador si la cookie se debe enviar al URI solicitado bas\u00e1ndose en la v\u00eda de acceso. Especifique una serie que represente una v\u00eda de acceso del servidor. "/" indica el directorio ra\u00edz. Especifique un valor para restringir las v\u00edas de acceso a las que se enviar\u00e1 la cookie. Al restringir las v\u00edas de acceso, puede impedir que la cookie se env\u00ede a determinados URL del servidor. Si especifica el directorio ra\u00edz, la cookie se enviar\u00e1 independientemente de la v\u00eda de acceso a la que se acceda en el servidor determinado.
Cookie.age.browserSession=Sesi\u00f3n de navegador actual 
Cookie.age.maximumAge=Antig\u00fcedad m\u00e1xima establecida
Cookie.age.units=segundos

Persistence.displayName=Sesiones distribuidas
Persistence.description=Especifica el tipo para guardar una sesi\u00f3n en un entorno distribuido.
Persistence.button.modify=Modificar...
Persistence.button.advanced=Avanzado...
Persistence.none=Ninguno
Persistence.database=Base de datos
Persistence.messaging=Duplicaci\u00f3n de memoria a memoria
Persistence.domain=Dominio de mensajer\u00eda interna:

SessionManager.sessionDRSPersistence.displayName=Valores de DRS
DRSSettings.both=Ambos, cliente y servidor
DRSSettings.bothpp=Ambos, push y pull
DRSSettings.pull=S\u00f3lo pull
DRSSettings.push=S\u00f3lo push
DRSSettings.none=No compartido
DRSSettings.client=S\u00f3lo cliente
DRSSettings.server=S\u00f3lo servidor
DRSSettings.replication.domainSelection=Seleccione un duplicador del siguiente dominio
DRSSettings.replication.replicators=Duplicadores: 
DRSSettings.replication.otherDomain=Seleccione un duplicador de otro dominio
DRSSettings.replication.address=Direcci\u00f3n IP:
DRSSettings.replication.port=Puerto:
DRSSettings.replication.description=Seleccionar el duplicador que desea utilizar para duplicaci\u00f3n de memoria a memoria.
DRSSettings.replication.displayName=Duplicaci\u00f3n :
DRSSettings.partition.displayName=Escucha de ID de partici\u00f3n:
DRSSettings.partition.description=Las particiones a las que escuchar\u00e1 este gestor de sesiones cuando se ejecute en modalidad de servidor para la duplicaci\u00f3n de sesiones de memoria a memoria.  El n\u00famero de particiones se define en las p\u00e1ginas Gestionar duplicaci\u00f3n interna.  El valor por omisi\u00f3n es la escucha de todas las particiones.
DRSSettings.mode.displayName=Modalidad de tiempo de ejecuci\u00f3n:
DRSSettings.mode.description=Especifica la modalidad en la que desea que se controle la duplicaci\u00f3n de datos.
DRSSettings.frequency.displayName=Push Frequency
DRSSettings.frequency.description=Especifica el tiempo en segundos que se debe esperar antes de pasar entradas de antememoria nuevas o modificadas a los otros servidores.
DRSSettings.frequency.units=segundos
DRSSettings.messaging.displayName=Servidor de mensajer\u00eda interna
DRSSettings.messaging.description=Especifica un dominio desde donde se duplicar\u00e1n los datos.
DRSSettings.noDomains.error=No se han definido dominios de duplicaci\u00f3n


SessionDatabasePersistence.displayName=Valores de base de datos
SessionDatabasePersistence.description=Descripci\u00f3n de los valores de base de datos
SessionDatabasePersistence.datasourceJNDIName.displayName=Nombre JNDI del origen de datos:
SessionDatabasePersistence.datasourceJNDIName.description=Especifica el nombre JNDI del origen de datos a partir del cual el gestor de sesiones obtendr\u00e1 conexiones de base de datos.
SessionDatabasePersistence.userId.displayName=ID de usuario:
SessionDatabasePersistence.userId.description=ID de usuario de acceso a la base de datos.
SessionDatabasePersistence.password.displayName=Contrase\u00f1a:
SessionDatabasePersistence.password.description=Contrase\u00f1a de acceso a la base de datos.
SessionDatabasePersistence.password2.displayName=Confirmar contrase\u00f1a:
SessionDatabasePersistence.password2.description=Escriba la contrase\u00f1a por segunda vez para asegurarse de que se ha grabado correctamente.
SessionDatabasePersistence.db2RowSize.displayName=Tama\u00f1o de fila de DB2:
SessionDatabasePersistence.db2RowSize.description=Tama\u00f1o de p\u00e1gina del espacio de tablas para la tabla de sesiones, si se utiliza una base de datos DB2. Los valores posibles son 4, 8, 16 y 32 kilobytes (K). El tama\u00f1o de fila por omisi\u00f3n es 4 K.
SessionDatabasePersistence.tableSpaceName.displayName=Nombre de espacio de tablas:
SessionDatabasePersistence.tableSpaceName.description=Espacio de tablas que desea utilizar en la tabla de sesiones.
SessionDatabasePersistence.multiRowSchema.displayName=Esquema de varias filas
SessionDatabasePersistence.multiRowSchema.description=Especifica si debe ubicarse cada instancia de los datos de la aplicaci\u00f3n en una fila por separado en la base de datos.
SessionDatabasePersistence.multiRowSchema.units=Utilizar esquema de varias filas
SessionDatabasePersistence.passwords.match.error=Las contrase\u00f1as no coinciden. Vuelva a especificar los dos campos de contrase\u00f1a.


Tuning.displayName=Par\u00e1metros de ajuste
Tuning.description=El gestor de sesiones proporciona varias opciones de ajuste para gestionar datos de sesiones en un entorno distribuido.
Tuning.level.displayName=Nivel de ajuste:
Tuning.level.description=El gestor de sesiones proporciona varios valores predefinidos que afectan el rendimiento.
Tuning.setting.veryHigh=Muy alto (optimizar para el rendimiento)
Tuning.setting.high=Alto
Tuning.setting.medium=Medio
Tuning.setting.low=Bajo (optimizar para sustituci\u00f3n por anomal\u00eda)
Tuning.setting.custom=Valores personalizados
Tuning.button.modify=Modificar...

TuningParams.contents.all=Todos los atributos de sesi\u00f3n
TuningParams.contents.updated=S\u00f3lo atributos actualizados
TuningParams.frequency.servlet=Finalizaci\u00f3n del servicio de servlet
TuningParams.frequency.manual=Actualizaci\u00f3n manual
TuningParams.frequency.units=segundos
TuningParams.frequency.timeBased=Basado en la hora:
TuningParams.database.displayName=Especificar planificaci\u00f3n de limpieza de sesiones distribuidas
TuningParams.database.first=Primera hora del d\u00eda (0-23):
TuningParams.database.second=Segunda hora del d\u00eda (0-23):
TuningParams.writeFrequency.displayName=Frecuencia de escritura
TuningParams.writeContents.displayName=Contenido de escritura
TuningParams.cleanup.displayName=Planificaci\u00f3n de limpieza de sesiones:
TuningParams.cleanup.description=Especifica cu\u00e1ndo se deben borrar las sesiones no v\u00e1lidas de la ubicaci\u00f3n externa.

Transport.host.displayName=Sistema principal
Transport.port.displayName=Puerto            
Transport.host.description=Especifica la direcci\u00f3n IP del sistema principal al que se enlaza para el transporte.
Transport.port.description=Especifica el puerto al que se enlaza para el transporte. Especifique un n\u00famero de puerto entre 1 y 65535. El n\u00famero de puerto debe ser exclusivo para cada instancia de servidor de aplicaciones en una m\u00e1quina determinada.
Transport.sslEnabled.units=Habilitar SSL

DynamicCache.startup.displayName=Estado de arranque:
DynamicCache.startup.description=Pulse el recuadro de selecci\u00f3n para habilitar el servicio de antememoria din\u00e1mica en el momento de arranque del servidor.
DynamicCache.startup.units=Habilitar el servicio durante el arranque del servidor
DynamicCache.cacheSize.displayName=Tama\u00f1o de antememoria
DynamicCache.defaultPriority.displayName=Prioridad por omisi\u00f3n
DynamicCache.diskoffload.displayName=Descarga de disco:
DynamicCache.diskoffload.description=Por omisi\u00f3n, la antememoria din\u00e1mica s\u00f3lo mantiene, como m\u00e1ximo, el n\u00famero de entradas configuradas en la memoria. Si se crean nuevas entradas cuando la antememoria est\u00e1 llena, se utilizan las prioridades configuradas para cada entrada de antememoria, junto con el algoritmo utilizado menos recientemente, para eliminar entradas de la antememoria. De manera alternativa, se puede configurar la descarga del disco y, en lugar de eliminar entradas de la memoria, se copian en el sistema de archivos (la ubicaci\u00f3n se puede configurar) para poder acceder a ellas posteriormente.
DynamicCache.diskoffload.enable=Habilitar la descarga de disco
DynamicCache.diskoffload.location=Ubicaci\u00f3n de la descarga:
DynamicCache.diskoffload.hashSize=Tama\u00f1o de hash:
DynamicCache.cachereplication.displayName=Duplicaci\u00f3n de antememoria:
DynamicCache.cachereplication.description=Habilite aqu\u00ed la duplicaci\u00f3n de antememoria
DynamicCache.cachereplication.enable=Habilitar la duplicaci\u00f3n de antememoria
DynamicCache.cachereplication.advanced=Avanzado...
DynamicCache.cacheGroups.displayName=Grupos de antememorias externas

ExternalCacheGroup.name.displayName=Nombre
ExternalCacheGroup.type.displayName=Tipo
ExternalCacheGroup.displayName=Grupo de antememoria externa
ExternalCacheGroup.members.displayName=Miembros del grupo de antememoria externa

ExternalCacheGroupMember.address.displayName=Direcci\u00f3n
ExternalCacheGroupMember.adapterBeanName.displayName=Nombre de bean de adaptador

ObjectRequestBroker.displayName=Servicio ORB
ObjectRequestBroker.description=Valores de configuraci\u00f3n del intermediario de petici\u00f3n de objetos (ORB).
ObjectRequestBroker.smallIcon=ObjectRequestBroker.gif
ObjectRequestBroker.largeIcon=ObjectRequestBroker32X32.gif
ObjectRequestBroker.interceptors.displayName=interceptores
ObjectRequestBroker.interceptors.description=Lista de interceptores que invocar\u00e1 el ORB durante cada petici\u00f3n de IIOP.
ObjectRequestBroker.plugins.displayName=plug-ins
ObjectRequestBroker.plugins.description=Lista de plug-ins que invocar\u00e1 el ORB durante la inicializaci\u00f3n de ORB.
ObjectRequestBroker.lsdConnection.displayName=lsdConnection
ObjectRequestBroker.lsdConnection.description=Referencia al Daemon de servicio de ubicaci\u00f3n,  que utiliza el ORB cuando es necesario para resolver las IOR indirectas.
ObjectRequestBroker.threadPool.displayName=Agrupaci\u00f3n de hebras
ObjectRequestBroker.threadPool.description=Valores de la agrupaci\u00f3n de hebras del ORB.
ObjectRequestBroker.ssl.displayName=ssl
ObjectRequestBroker.ssl.description=Especifica los valores de SSL (Secure Socket Layer) del servidor.
ObjectRequestBroker.requestTimeout.displayName=Tiempo de espera de petici\u00f3n
ObjectRequestBroker.requestTimeout.units=segundos
ObjectRequestBroker.requestTimeout.description=Numero de segundos de espera antes de que termine el tiempo del mensaje de la petici\u00f3n.
ObjectRequestBroker.requestRetriesCount.displayName=Cuenta de reintentos de petici\u00f3n
ObjectRequestBroker.requestRetriesCount.units=reintentos
ObjectRequestBroker.requestRetriesCount.description=N\u00famero de veces que el ORB intenta enviar una petici\u00f3n si se produce un error en el servidor. Los reintentos a veces permiten solucionar los errores en la red transitorios.
ObjectRequestBroker.requestRetriesDelay.displayName=Retardo de reintentos de petici\u00f3n
ObjectRequestBroker.requestRetriesDelay.units=milisegundos
ObjectRequestBroker.requestRetriesDelay.description=N\u00famero de milisegundos entre los reintentos de petici\u00f3n.
ObjectRequestBroker.connectionCacheMaximum.displayName=M\u00e1ximo para la antememoria de conexi\u00f3n
ObjectRequestBroker.connectionCacheMaximum.units=conexiones
ObjectRequestBroker.connectionCacheMaximum.description=N\u00famero m\u00e1ximo de conexiones que puede ocupar la antememoria de conexi\u00f3n del servicio.
ObjectRequestBroker.connectionCacheMinimum.displayName=M\u00ednimo para la antememoria de conexi\u00f3n
ObjectRequestBroker.connectionCacheMinimum.units=conexiones
ObjectRequestBroker.connectionCacheMinimum.description=N\u00famero m\u00ednimo de conexiones que puede ocupar la antememoria de conexi\u00f3n del servicio.
ObjectRequestBroker.commTraceEnabled.displayName=Rastreo de ORB
ObjectRequestBroker.commTraceEnabled.description=Rastrea los mensajes ORB GIOP. Este valor se ignora si no est\u00e1 habilitado el rastreo de ORB.
ObjectRequestBroker.locateRequestTimeout.displayName=Tiempo de espera de petici\u00f3n de localizaci\u00f3n
ObjectRequestBroker.locateRequestTimeout.description=Numero de segundos de espera antes de que termine el tiempo del mensaje de la petici\u00f3n de localizaci\u00f3n.
ObjectRequestBroker.forceTunnel.displayName=Forzar t\u00fanel
ObjectRequestBroker.forceTunnel.description=Controla c\u00f3mo intenta utilizar el ORB de cliente la transmisi\u00f3n a trav\u00e9s de t\u00fanel HTTP.
ForceTunnelMode.WHENREQUIRED=CUANDO SEA NECESARIO
ForceTunnelMode.ALWAYS=SIEMPRE
ForceTunnelMode.NEVER=NUNCA                             
ObjectRequestBroker.tunnelAgentURL.displayName=URL de agente de transmisi\u00f3n a trav\u00e9s de t\u00fanel
ObjectRequestBroker.tunnelAgentURL.description=URL del servlet utilizado para dar soporte a la transmisi\u00f3n a trav\u00e9s de t\u00fanel HTTP. S\u00f3lo se necesita si el campo \"Forzar t\u00fanel\" est\u00e1 establecido como SIEMPRE o CUANDO SEA NECESARIO. En caso contrario, el ORB lo ignora.
ObjectRequestBroker.noLocalCopies.displayName=Pasar por referencia
ObjectRequestBroker.noLocalCopies.description=Cuando est\u00e1 habilitado, especifica que el ORB va a pasar par\u00e1metros por referencia en lugar de por valores, lo que evita una operaci\u00f3n de copia. Habilite con precauci\u00f3n esta propiedad porque podr\u00edan producirse comportamientos inesperados.
ObjectRequestBroker.externalConfigURL.displayName=externalConfigURL
ObjectRequestBroker.externalConfigURL.description=La descripci\u00f3n de esta propiedad no est\u00e1 disponible.
ObjectRequestBroker.properties.description=Propiedades personalizadas adicionales de este servicio que se pueden configurar. Pueden a\u00f1adirse en este panel propiedades personalizadas adicionales del ORB. Sin embargo, se recomienda no modificar ni suprimir ning\u00fan valor por omisi\u00f3n establecido durante la instalaci\u00f3n del producto a menos que lo indique el personal de soporte t\u00e9cnico de IBM.
ORBPlugin.displayName=ORBPlugin
ORBPlugin.description=Se puede especificar c\u00f3digo personalizado para ampliar el ORB.  Un plug-in captura la clase que contiene la l\u00f3gica personalizada.  Durante la inicializaci\u00f3n del servidor, \u00e9ste toma el nombre del plug-in, con el prefijo com.ibm.CORBA.ORBPluginClass.XXX.
ORBPlugin.smallIcon=ORBPlugin.gif
ORBPlugin.largeIcon=ORBPlugin32X32.gif
ORBPlugin.name.displayName=nombre
ORBPlugin.name.description=Nombre de clase ***no cualificado*** del plug-in que se debe cargar e inicializar.
Interceptor.displayName=Interceptor
Interceptor.description=El ORB invoca los interceptores en cada petici\u00f3n de IIOP.
Interceptor.smallIcon=Interceptor.gif
Interceptor.largeIcon=Interceptor32X32.gif
Interceptor.name.displayName=nombre
Interceptor.name.description=Nombre de clase del interceptor.
LSDConnection.displayName=LSDConnection
LSDConnection.description=Especifica las propiedades utilizadas para conectarse a un \
LocationServiceDaemon.  Un LSD es un servidor que recibe datos en un puerto fijo, procesa \
peticiones para localizar referencias de objetos persistentes y redirige los clientes al \
servidor de aplicaciones apropiado.  Vea el servidor LocationServiceDaemonServer para conocer la \
configuraci\u00f3n del proceso del servidor LSD.
LSDConnection.smallIcon=LSDConnection.gif
LSDConnection.largeIcon=LSDConnection32X32.gif
LSDConnection.endPoint.displayName=endPoint
LSDConnection.endPoint.description=
LSDConnection.mode.displayName=modalidad
LSDConnection.mode.description=Modalidad del daemon de servicio de ubicaci\u00f3n.
LSDMode.NONE=NONE
LSDMode.IMPLICIT_CLIENT=IMPLICIT_CLIENT
LSDMode.EXPLICIT_CLIENT=EXPLICIT_CLIENT
LSDMode.PROVIDER=PROVIDER

Server.errorStreamRedirect.displayName=Redirecci\u00f3n de la corriente de datos de error
Server.errorStreamRedirect.description=Valores de la redirecci\u00f3n de la corriente de System.err
Server.outputStreamRedirect.displayName=Redirecci\u00f3n de la corriente de salida
Server.outputStreamRedirect.description=Valores de la redirecci\u00f3n de la corriente de System.out
Server.clusterName.displayName=Nombre de cl\u00faster
Server.clusterName.description=Especifica el nombre de la agrupaci\u00f3n si el servidor forma parte de una agrupaci\u00f3n.
Server.modelId.displayName=modelId
Server.modelId.description=
StreamRedirect.displayName= Redirecci\u00f3n de corriente de datos
StreamRedirect.description=Especifica los valores para la redirecci\u00f3n de corrientes de dato de E/S de Java est\u00e1ndar.
StreamRedirect.smallIcon=StreamRedirect.gif
StreamRedirect.largeIcon=StreamRedirect32X32.gif
StreamRedirect.fileName.displayName=Nombre de archivo
StreamRedirect.fileName.description=Especifica el nombre del archivo al que se debe redirigir la corriente de datos.
StreamRedirect.rolloverType.displayName=Tipo de conversi\u00f3n
StreamRedirect.rolloverType.description=Indica el tipo de algoritmo de conversi\u00f3n que se utiliza.
StreamRedirect.maxNumberOfBackupFiles.displayName=N\u00famero m\u00e1ximo de archivos de copia de seguridad
StreamRedirect.maxNumberOfBackupFiles.description=N\u00famero de archivadores.
StreamRedirect.rolloverSize.displayName=Tama\u00f1o de la conversi\u00f3n
StreamRedirect.rolloverSize.description=Especifica el tama\u00f1o en megabytes de la conversi\u00f3n basada en el tama\u00f1o.
StreamRedirect.baseHour.displayName=Hora de base
StreamRedirect.baseHour.description=Especifica las horas en las que empieza la conversi\u00f3n basada en la hora.
StreamRedirect.rolloverPeriod.displayName=Periodo de conversi\u00f3n
StreamRedirect.rolloverPeriod.description=Especifica el periodo de conversi\u00f3n basado en la hora.
StreamRedirect.formatWrites.displayName=Formatear grabaciones
StreamRedirect.formatWrites.description=Especifica si las grabaciones se deben formatear como \
la entrada de anotaciones cronol\u00f3gicas de WebSphere.
StreamRedirect.messageFormatKind.displayName=Tipo de formato de mensajes
StreamRedirect.messageFormatKind.description=Formato deseado en los mensajes. Los valores v\u00e1lidos son b\u00e1sico y avanzado. El valor por omisi\u00f3n es b\u00e1sico.
StreamRedirect.suppressWrites.displayName=Suprimir grabaciones
StreamRedirect.suppressWrites.description=Especifica si se deben suprimir las grabaciones en esta corriente de datos.
StreamRedirect.suppressStackTrace.displayName=Suprimir rastreos de pilas
StreamRedirect.suppressStackTrace.description=Especifica si los rastreos de pilas en los mensajes se deben sustituir s\u00f3lo por el mensaje de la excepci\u00f3n. El valor por omisi\u00f3n es false. (No se suprimen.)
ManagedObject.displayName=Objeto gestionado
ManagedObject.description=Representa la configuraci\u00f3n de un objeto que se puede gestionar mediante un proceso de agente.
ManagedObject.smallIcon=ManagedObject.gif
ManagedObject.largeIcon=ManagedObject32X32.gif
ManagedObject.stateManagement.displayName=Gesti\u00f3n de estado
ManagedObject.statisticsProvider.displayName=Proveedor de estad\u00edsticas
ManagedObject.statisticsProvider.description=Capacidad del recurso gestionado para generar medidas de rendimiento.
server.stop.title=Detenci\u00f3n del servidor
server.stop.warning1=El servidor est\u00e1 ejecutando la aplicaci\u00f3n de administraci\u00f3n.
server.stop.warning2=Si detiene el servidor, se cerrar\u00e1 la sesi\u00f3n HTTP actual y no podr\u00e1 volver a utilizar esta instancia de la consola administrativa.
server.stop.warning3=Para utilizar la consola administrativa, inicie el servidor de nuevo. Si est\u00e1 habilitada la seguridad, el navegador podr\u00e1 iniciar la sesi\u00f3n la pr\u00f3xima vez sin preguntar, siempre que la cookie LTPA siga siendo v\u00e1lida.  Como la cookie LTPA es para inicio de sesi\u00f3n \u00fanico (uso multi-servidor), no se elimina del navegador durante el cierre de sesi\u00f3n de la consola administrativa.
goodbye.title=Adi\u00f3s
goodbye.message1=Gracias por utilizar la consola administrativa de WebSphere.
Server.services.PMIService.displayName=Servicio de supervisi\u00f3n del rendimiento
Server.services.PMIService.description=Especifica los valores para la supervisi\u00f3n del rendimiento. Por ejemplo, para habilitar la supervisi\u00f3n del rendimiento, seleccionar el m\u00f3dulo PMI y establecer niveles de supervisi\u00f3n.
PMIService.displayName=Servicio de supervisi\u00f3n del rendimiento
PMIService.description=Valores de configuraci\u00f3n y de ejecuci\u00f3n de PMI (Infraestructura de supervisi\u00f3n del rendimiento)
PMIService.smallIcon=PMIService.gif
PMIService.largeIcon=PMIService32X32.gif
PMIService.initialSpecLevel.displayName=Nivel de especificaci\u00f3n inicial
PMIService.initialSpecLevel.description=Serie de especificaci\u00f3n de PMI (Infraestructura de supervisi\u00f3n del rendimiento) que almacena los niveles de especificaci\u00f3n de PMI para todos los componentes del servidor. Los niveles N, L, M, H y X representan Ninguno, Bajo ,Medio ,Alto y M\u00e1ximo respectivamente.
PMIService.modules=M\u00f3dulos PMI
PMIService.monitoringLevel=Nivel de supervisi\u00f3n
PMIService.specification=Especificaciones
PMIService.mbean.notFound=No se pueden detectar los valores de supervisi\u00f3n del rendimiento. Aseg\u00farese de que el servicio de supervisi\u00f3n del rendimiento est\u00e9 habilitado para este servidor.
PMIService.invalidSetting=El valor de este m\u00f3dulo no era v\u00e1lido.
PMIService.thevalidSettings=Entre N (Ninguno), L (Bajo), M (Medio), H (Alto) o X (M\u00e1ximo).
PMIService.LevelNone=Ninguno - Todos los m\u00f3dulos siguientes se establecen en &quot;N&quot; (Ninguno).
PMIService.LevelStandard=Est\u00e1ndar - Todos los m\u00f3dulos siguientes se establecen en &quot;H&quot; (Alto).
PMIService.LevelCustom=Personalizado - Modifique, a\u00f1ada o elimine los m\u00f3dulos de la lista siguiente.


distmanagement.appserver.create.new=Crear un nuevo servidor de aplicaciones
distmanagement.appserver.create.new.description=Crear un nuevo servidor de aplicaciones
appserver.new.step1=Seleccionar una plantilla de servidor de aplicaciones
appserver.new.step2=Seleccionar un nodo
appserver.new.step3=Confirmar el nuevo servidor de aplicaciones
distmanagement.button.edit=Editar
appserver.selectAppServer.msg1=Puede seleccionar un servidor de aplicaciones existente como plantilla o utilizar la plantilla de servidor de aplicaciones por omisi\u00f3n.
appserver.selectAppServer.msg3=Seleccionar nodo
appserver.selectAppServer.msg4=Ver m\u00e1s informaci\u00f3n sobre este paso
appserver.selectAppServer.msg5=El nodo seleccionado en este paso determinar\u00e1 los procesos de servidor disponibles que se pueden elegir en el paso siguiente.
appserver.selectAppServer.msg6=Nombre l\u00f3gico del servidor. El nombre debe ser exclusivo en la c\u00e9lula.
appserver.selectAppServer.msg7=Seleccionar plantilla
appserver.selectAppServer.msg8=Servidor de aplicaciones existente
appserver.selectAppServer.msg9=Al utilizar un servidor de aplicaciones existente como plantilla, b\u00e1sicamente se copia la configuraci\u00f3n del servidor seleccionado.
appserver.selectAppServer.msg10=Plantilla de servidor de aplicaciones por omisi\u00f3n
appserver.selectAppServer.errormsg1=Se necesita el nombre de servidor
appserver.selectAppServer.errormsg2={0} existe en el nodo {1}
appserver.selectAppServer.copyApps1=Correlacionar aplicaciones 
appserver.selectAppServer.copyApps2=Correlacionar aplicaciones de la plantilla del servidor existente
appserver.selectAppServer.copyApps3=Esta opci\u00f3n s\u00f3lo se aplica cuando se selecciona "Servidor de aplicaciones existentes" como plantilla. Cuando se selecciona, las aplicaciones que se hayan instalado y correlacionado anteriormente para ejecutarse en el servidor de origen se correlacionar\u00e1n autom\u00e1ticamente para que tambi\u00e9n se ejecuten en el nuevo servidor, y se conservar\u00e1 cualquier informaci\u00f3n de enlace anterior (como por ejemplo, la asignaci\u00f3n de usuarios y grupos). Esto es distinto que instalar los mismo binarios de aplicaci\u00f3n en el nuevo servidor con un nombre de aplicaci\u00f3n distinto. Es ese caso, se guardar\u00eda un copia independiente de la informaci\u00f3n de enlace de la aplicaci\u00f3n.
generate.unique.ports=Generar puertos HTTP \u00fanicos
generate.unique.ports.desc=Genera n\u00fameros de puerto \u00fanicos para cada transporte http que se define en el servidor de origen, para que el servidor resultante que se crea no tenga transportes HTTP que entren en conflicto con el servidor original o con cualquier otro servidor definido en el mismo nodo.
generate.unique.ports.label=Puertos HTTP
appserver.selectAppServer.serverName=Nombre de servidor
appserver.confirmAppServer.msg1=A continuaci\u00f3n se presenta un resumen de las selecciones efectuadas. Pulse el bot\u00f3n Finalizar para terminar la creaci\u00f3n del servidor de aplicaciones.
appserver.confirmAppServer.msg2=Si desea modificar alg\u00fan valor, pulse el bot\u00f3n anterior para revisar los valores del servidor.
appserver.confirmAppServer.msg3=Se concluir\u00e1n las acciones siguientes
appserver.confirmAppServer.msg4=El nuevo servidor de aplicaciones \"{0}\" se crear\u00e1 en el nodo \"{1}\", en un nuevo proceso de servidor.
appserver.confirmAppServer.msg7=Posibles problemas causados por esta acci\u00f3n
appserver.confirmAppServer.msg8=Aseg\u00farese de que el nodo \"{0}\" tenga memoria suficiente para dar soporte a distintos procesos. Si no tiene memoria suficiente, se obtendr\u00e1 un mal rendimiento.
appserver.createAppServer.msg1=El nuevo servidor se ha creado satisfactoriamente.
appserver.createAppServer.msg2=Variables modificables, recursos y otros valores de \
configuraci\u00f3n del servidor como, por ejemplo, los nombres de cola del intermediario de mensajes \
antes de ejecutar el nuevo servidor que se ha creado.
ensure.unique.httpports=Aseg\u00farese de que los puertos http sean exclusivos del nodo antes de iniciar el servidor.
error.create.server=Se ha producido un error al crear el nuevo servidor.

application.server.already.started={0} ya se ha iniciado
node.agent.not.active=El agente de nodo en el nodo {0} no est\u00e1 activo. El servidor no se puede iniciar. 
synch.server.before.start=La configuraci\u00f3n del servidor se ha modificado. Debe guardarla en el dep\u00f3sito maestro antes de iniciar el servidor. 
object.must.be.selected=Debe seleccionar al menos un servidor de aplicaciones para efectuar esta acci\u00f3n.
application.server.not.started={0} no se ha iniciado
could.not.stop.server=Se ha producido un error al detener {0}. Consulte las anotaciones cronol\u00f3gicas de error para obtener m\u00e1s informaci\u00f3n.
server.started.successfully=El servidor {0} se ha iniciado satisfactoriamente
server.view.jvm.logs1=Ver anotaciones cronol\u00f3gicas de JVM</a> para obtener m\u00e1s detalles.
could.not.start.server=No se ha podido iniciar el servidor {0}
server.stopped.successfully=El servidor {0} se ha detenido satisfactoriamente
server.should.be.stopped=Detener todos los servidores que desea suprimir
deleteserver.page.title=Suprimir servidor 
deleteserver.page.msg1=Pulse el bot\u00f3n Aceptar para suprimir los siguientes servidores. Si no desea suprimir los servidores, pulse el bot\u00f3n CANCELAR para volver a la p\u00e1gina anterior.
error.createmq=createmq no se ha podido ejecutar, de modo que el JMSServer no se podr\u00e1 iniciar'
error.deletemq=Se ha producido un error en la operaci\u00f3n deleteemq
NodeAgent.not.found=El sistema no ha podido contactar el proceso para cerrar el servidor. Aseg\u00farese de que el servidor est\u00e1 detenido antes de suprimirlo. 
nodes.not.present=No hay ning\u00fan nodo que da soporte a los servidores de aplicaciones en la configuraci\u00f3n.  Utilice el mandato addNode de la <a href="navigatorCmd.do?forwardName=Node.content.main">Colecci\u00f3n de nodos</a> o de la l\u00ednea de mandatos antes de intentar crear un nuevo servidor de aplicaciones.

ExecutionState.PARTIAL_STOP=Parada parcial
ExecutionState.PARTIAL_START=Inicio parcial
ExecutionState.STOPPING=Deteniendo
ExecutionState.STARTING=Iniciando



NamedEndPoint.displayName=Puntos finales
NamedEndPoint.description=Configurar los puertos TCP/IP importantes que utiliza este servidor para las conexiones.
NamedEndPoint.smallIcon=NamedEndPoint.gif
NamedEndPoint.largeIcon=NamedEndPoint32X32.gif
NamedEndPoint.endPoint.displayName=Punto final
NamedEndPoint.endPoint.description=
NamedEndPoint.endPointName.displayName=Nombre de punto final
NamedEndPoint.endPointName.description=
NamedEndPoints.not.available=No hay puntos finales disponibles para configurar
SystemMessageServer.displayName=Servidor de mensajes de sistema
AppServer.displayName=Servidor de aplicaciones

Server.productInfo.displayName=Informaci\u00f3n del producto
Server.productInfo.description=Informaci\u00f3n del producto para esta instalaci\u00f3n de WebSphere Application Server
ProductInfo.components.dislayName=Componentes
ProductInfo.components.description=Componentes instalados en el sistema actual
ProductInfo.extensions.dislayName=Extensiones
ProductInfo.extensions.description=Extensiones instaladas en el sistema actual
ProductInfo.eFixes.dislayName=e-Fixes
ProductInfo.eFixes.description=e-Fixes instalados en el sistema actual
ProductInfo.product.name=Nombre del producto
ProductInfo.product.id=ID
ProductInfo.product.version=Versi\u00f3n
ProductInfo.product.buildDate=Fecha de build
ProductInfo.product.buildLevel=Nivel de build
ProductInfo.product.buildversion=Versi\u00f3n de build
ProductInfo.product.builddate=Fecha de build
ProductInfo.component.name=Nombre de componente
ProductInfo.component.specversion=Versi\u00f3n de especificaci\u00f3n
ProductInfo.extension.name=Nombre de extensi\u00f3n
ProductInfo.efix.id=ID de e-Fix
ProductInfo.efix.buildversion=Versi\u00f3n de build
ProductInfo.efix.buildDate=Fecha de build
ProductInfo.efix.components=Componentes
ProductInfo.efix.prereq=Pre-reqs
ProductInfo.efix.coreq=Co-reqs            
ProductInfo.ptfs.dislayName=PTF
ProductInfo.ptfs.description=PTF instalados en el sistema actual
ProductInfo.ptf.id=ID de PTF
ProductInfo.ptf.products=Productos
ProductInfo.productReport.dislayName=Informe de productos
ProductInfo.productReport.description=Muestra un informe de informaci\u00f3n detallada del producto para el estado actual del sistema.
ProductInfo.historyReport.dislayName=Informe de historial
ProductInfo.historyReport.description=Muestra un informe detallado de historial de la informaci\u00f3n del producto.
Data.not.present=Ninguno

accessibility.needs=Los usuarios con necesidades de acceso especiales pueden pulsar la imagen para obtener el estado
