# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#CMVCPATHNAME ws/code/webui.servermanagement/src/servermanagement/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE
#

nav.webSphere.servermanagement.configuration=Serveurs
nav.webSphere.servers=Serveurs
nav.view.ApplicationServer=Serveurs d'applications
nav.view.JMSServer=Serveurs JMS
Server.node.displayName=Noeud
Server.node.description=Noeud
Server.status.displayName=Etat
Server.status.description=Etat
ExecutionState.STARTED=D\u00e9marr\u00e9
ExecutionState.STOPPED=Arr\u00eat\u00e9
ExecutionState.UNAVAILABLE=Indisponible
attribute.not.found=Erreur JMX : attribut introuvable 
Server.type.displayName=Type
Server.type.description=Type de serveur.
Server.mbean.pid.displayName=ID de processus
Server.mbean.pid.description=Id du processus du syst\u00e8me d'exploitation natif pour ce serveur.
Server.mbean.cellName.displayName=Nom de cellule
Server.mbean.cellName.description=Nom de la cellule dans laquelle ce serveur est en cours d'ex\u00e9cution.
Server.mbean.nodeName.displayName=Nom du noeud
Server.mbean.nodeName.description=Nom du noeud sur lequel ce serveur est en cours d'ex\u00e9cution.
Server.mbean.state.displayName=Etat
Server.mbean.state.description=Etat de l'ex\u00e9cution pour ce serveur.
ServerManagement.logsAndTrace.displayName=Journalisation et tra\u00e7age
ServerManagement.logsAndTrace.description=Sp\u00e9cifie les param\u00e8tres de journalisation et de trace pour ce serveur.
ServerManagement.RASLoggingService.displayName=Journaux des services IBM
ServerManagement.RASLoggingService.description=Configure le journal des services IBM, aussi appel\u00e9 journal d'activit\u00e9. 
ServerManagement.TraceService.displayName=Diagnostics du service de trace
ServerManagement.TraceService.description=Affiche et modifie les propri\u00e9t\u00e9s des diagnostics du service de trace.

task.manage.server=Gestion du serveur local

TransactionService.displayName=Service de transactions
TransactionService.description=Le service de transactions est un composant d'ex\u00e9cution du serveur qui coordonne les mises \u00e0 jour sur plusieurs gestionnaires de ressources pour assurer les mises \u00e0 jour atomiques de donn\u00e9es. Les transactions sont lanc\u00e9es et arr\u00eat\u00e9es par les applications ou le conteneur dans lequel les applications sont d\u00e9ploy\u00e9es.
TransactionService.smallIcon=TransactionService.gif
TransactionService.largeIcon=TransactionService32X32.gif
TransactionService.transactionLogDirectory.displayName=R\u00e9pertoire du journal des transactions
TransactionService.transactionLogDirectory.description=Sp\u00e9cifie le nom d'un r\u00e9pertoire pour ce serveur dans lequel le service de transactions stocke les fichiers de journalisation pour la reprise. Une valeur vide dans la configuration du serveur est d\u00e9taill\u00e9 par le journal des transactions au d\u00e9marrage comme \u00e9tant le r\u00e9pertoire (racine_installation)/tranlog/(nom_serveur).
TransactionService.totalTranLifetimeTimeout.displayName=D\u00e9passement du d\u00e9lai autoris\u00e9 pour la dur\u00e9e de vie des transactions
TransactionService.totalTranLifetimeTimeout.description=Dur\u00e9e maximale, en secondes, pour les transactions sur ce serveur d'applications. Toute transaction dont l'ach\u00e8vement n'est pas demand\u00e9 avant ce d\u00e9lai est annul\u00e9e.
TransactionService.clientInactivityTimeout.displayName=D\u00e9passement du d\u00e9lai d'inactivit\u00e9 du client
TransactionService.clientInactivityTimeout.description=Intervalle maximal, en secondes, entre chaque demande transactionnelle \u00e9manant d'un client \u00e9loign\u00e9. Toute p\u00e9riode d'inactivit\u00e9 du client d\u00e9passant ce d\u00e9lai implique l'annulation de la transaction sur ce serveur d'application.
TransactionService.enableLoggingForHeuristicReporting.displayName=Activer la journalisation des rapports heuristiques
TransactionService.enableLoggingForHeuristicReporting.description=Permet la journalisation de rapports heuristiques (fonction avanc\u00e9e disponible dans l'additif EEx). Si des applications sont configur\u00e9es de fa\u00e7on \u00e0 permettre aux ressources \u00e0 validation en une seule phase de participer aux transactions \u00e0 deux phases, le rapport de r\u00e9sultats heuristiques se produisant lors d'une d\u00e9faillance du serveur d'applications requiert des informations suppl\u00e9mentaires pour \u00eatre consign\u00e9 dans le journal des transactions.  Si cette option est activ\u00e9e, une \u00e9criture est ajout\u00e9e dans le journal pour toute transaction impliquant des ressources \u00e0 validation en une et deux phases.  Aucun enregistrement suppl\u00e9mentaire n'est \u00e9crit pour les transactions n'impliquant pas de ressource \u00e0 validation en une seule phase.  La valeur par d\u00e9faut est false.
TransactionService.mbean.transactionLogDirectory.displayName=R\u00e9pertoire du journal des transactions
TransactionService.mbean.transactionLogDirectory.description=Sp\u00e9cifie le nom d'un r\u00e9pertoire pour ce serveur dans lequel le service de transactions stocke les fichiers de journalisation pour la reprise.
TransactionService.mbean.totalTranLifetimeTimeout.displayName=D\u00e9passement du d\u00e9lai autoris\u00e9 pour la dur\u00e9e de vie des transactions
TransactionService.mbean.totalTranLifetimeTimeout.description=
TransactionService.mbean.clientInactivityTimeout.displayName=D\u00e9passement du d\u00e9lai d'inactivit\u00e9 du client
TransactionService.mbean.clientInactivityTimeout.description=
Transaction.displayName=Gestion des transactions
Transaction.description=Permet de g\u00e9rer les transactions actives sur le serveur d'application.
Transaction.localId.displayName=ID local
Transaction.status.displayName=Etat 
Transaction.globalId.displayName=ID global
button.transactionlist=G\u00e9rer les transactions
Transaction.noactivetransaction.exists=Aucune transaction active n'est en cours d'ex\u00e9cution sur le serveur.
jmx.malformedobject.error=Mbean de type {0} introuvable.
jmx.instancenotfound.error=L''op\u00e9ration {0} sur le Mbean de type {1} a \u00e9chou\u00e9.

ApplicationServer.installedApps.displayName=Applications install\u00e9es
ApplicationServer.installedApps.description=G\u00e8re les applications install\u00e9es sur ce serveur.

ApplicationServer.displayName=Serveurs d'applications
ApplicationServer.description=Il s'agit d'un serveur qui fournit les services requis pour ex\u00e9cuter les applications d'entreprise.
ApplicationServer.name.displayName=Nom
ApplicationServer.name.description=Nom d'affichage du serveur.
ApplicationServer.smallIcon=ApplicationServer.gif
ApplicationServer.largeIcon=ApplicationServer32X32.gif
ApplicationServer.locationServiceDaemon.displayName=D\u00e9mon de service de localisation
ApplicationServer.locationServiceDaemon.description=
ApplicationServer.components.DynamicCache.displayName=Service de cache dynamique
ApplicationServer.components.DynamicCache.description=Sp\u00e9cifie les param\u00e8tres du service de m\u00e9moire cache dynamique du serveur.
ApplicationServer.applicationServerServices.displayName=Services du serveur d'applications
ApplicationServer.applicationServerServices.description=Services dont la port\u00e9e est le serveur d'applications.  Voir la collection de services h\u00e9rit\u00e9e de la superclasse Conteneur.
ApplicationServer.applicationServerServices.TransactionService.displayName=Service de transactions
ApplicationServer.applicationServerServices.TransactionService.description=Sp\u00e9cifie les param\u00e8tres du service des transactions et g\u00e8re les verrous des transactions actives.
ApplicationServer.components.WebContainer.displayName=Conteneur Web
ApplicationServer.components.WebContainer.description= Sp\u00e9cifie les param\u00e8tres du pool d'unit\u00e9s d'ex\u00e9cution et de la cache dynamique pour le conteneur. Sp\u00e9cifie \u00e9galement des param\u00e8tres du gestionnaire de session, tels que les param\u00e8tres de persistance et d'optimisation, et de transport HTTP.
ApplicationServer.components.EJBContainer.displayName=Conteneur d'EJB
ApplicationServer.components.EJBContainer.description=Sp\u00e9cifie des informations relatives \u00e0 la cache et \u00e0 la source de donn\u00e9es pour le conteneur.
Server.services.ObjectRequestBroker.displayName=Service ORB
Server.services.ObjectRequestBroker.description=Sp\u00e9cifie les param\u00e8tres du service ORB (Object Request Broker).
ApplicationServer.id.displayName=ID
ApplicationServer.id.description=Identificateur unique qui peut \u00eatre attribu\u00e9 \u00e0 un serveur.
ApplicationServer.applicationClassLoaderPolicy.displayName=R\u00e8gles du chargeur de classe de l'application
ApplicationServer.applicationClassLoaderPolicy.description=Indique s'il existe un seul chargeur de classes pour toutes les applications (\"Un seul\") ou un chargeur de classes par application (\"Plusieurs\").
ApplicationServer.applicationClassLoadingMode.displayName=Mode de chargement des classes de l'application
ApplicationServer.applicationClassLoadingMode.description=Sp\u00e9cifie le mode de chargement des classes lorsque la r\u00e8gle du chargeur de classe de l'application est \"Single\"
ClassLoaderPolicy.SINGLE=Application
ClassLoaderPolicy.MULTIPLE=Module
ServerClassLoaderPolicy.SINGLE=Un seul
ServerClassLoaderPolicy.MULTIPLE=Plusieurs
applicationClassLoadingMode.PARENT_FIRST=Parent en premier
applicationClassLoadingMode.PARENT_LAST=Parent en dernier                         
ApplicationContainer.displayName=Conteneur d'applications
ApplicationContainer.description=
ApplicationContainer.smallIcon=ApplicationContainer.gif
ApplicationContainer.largeIcon=ApplicationContainer32X32.gif
DynamicCache.displayName=Service de cache dynamique
DynamicCache.description=Service de cache dynamique
DynamicCache.smallIcon=DynamicCache.gif
DynamicCache.largeIcon=DynamicCache32X32.gif
DynamicCache.cacheGroups.description=D\u00e9finit des ensembles de caches externes contr\u00f4l\u00e9es par WebSphere Application Server.
DynamicCache.cacheReplication.displayName=R\u00e9plication de cache
DynamicCache.cacheReplication.description=
DynamicCache.cacheSize.units=entr\u00e9es
DynamicCache.cacheSize.description=Entier positif sp\u00e9cifiant le nombre maximal d'entr\u00e9es que peut contenir la cache.
DynamicCache.defaultPriority.description=Priorit\u00e9 par d\u00e9faut pour les entr\u00e9es de m\u00e9moire cache, d\u00e9terminant la dur\u00e9e pendant laquelle une entr\u00e9e peut subsister en cache.
DynamicCache.replicationType.displayName=Type de r\u00e9plication
DynamicCache.replicationType.description=Algorithme de distribution des entr\u00e9es de la cache partag\u00e9e aux caches dynamiques associ\u00e9es, connect\u00e9es via DRS.  Sa valeur doit \u00eatre l'une des valeurs dynamicCacheReplicationKind.
DynamicCache.pushFrequency.displayName=Fr\u00e9quence d'insertion
DynamicCache.pushFrequency.description=Intervalle, sp\u00e9cifi\u00e9 en secondes, utilis\u00e9 lorsque le type de r\u00e9plication est PUSH. La valeur par d\u00e9faut est 0.
DynamicCache.enableDiskOffload.displayName=Activer le d\u00e9chargement de disque
DynamicCache.enableDiskOffload.description=Active le d\u00e9chargement de disque.
DynamicCache.diskOffloadLocation.displayName=Emplacement du d\u00e9chargement de disque
DynamicCache.diskOffloadLocation.description=Indique le r\u00e9pertoire utilis\u00e9 pour le d\u00e9chargement de disque.
DynamicCache.hashSize.displayName=Taille de hachage
DynamicCache.hashSize.description=Sp\u00e9cifie une taille de hachage lorsque le d\u00e9chargement du disque est activ\u00e9. Les valeurs autoris\u00e9es sont des puissances de 2 (1, 2, 4, 8...).
ExternalCacheGroup.description=Cette page permet de d\u00e9finir des ensembles de caches externes contr\u00f4l\u00e9es par WebSphere Application Server sur des serveurs Web, tels que IBM Edge Server et IBM HTTP Server.
ExternalCacheGroup.smallIcon=ExternalCacheGroup.gif
ExternalCacheGroup.largeIcon=ExternalCacheGroup32X32.gif
ExternalCacheGroup.members.description=Membres d'un groupe de caches externes contr\u00f4l\u00e9s par WebSphere Application Server.
ExternalCacheGroup.name.description=Nom du groupe de caches externes.
ExternalCacheGroup.type.description=Actuellement, seuls les groupes de caches externes partag\u00e9es sont pris en charge.
ExternalCacheGroupMember.displayName=Membre de groupe de caches externes
ExternalCacheGroupMember.description=Une seule cache externe devant \u00eatre contr\u00f4l\u00e9e par WebSphere.
ExternalCacheGroupMember.smallIcon=ExternalCacheGroupMember.gif
ExternalCacheGroupMember.largeIcon=ExternalCacheGroupMember32X32.gif
ExternalCacheGroupMember.address.description=Nom d'h\u00f4te et \u00e9ventuellement num\u00e9ro de port d'une m\u00e9moire cache externe.
ExternalCacheGroupMember.adapterBeanName.description=Nom de la classe, figurant dans le chemin d'acc\u00e8s aux classes WebSphere Application Server, de l'adaptateur plac\u00e9 entre WebSphere Application Server et sa m\u00e9moire cache externe.
ExternalCacheGroupKind.SHARED=SHARED
ExternalCacheGroupKind.NOT_SHARED=NOT_SHARED
DynamicCacheReplicationKind.NONE=NONE
DynamicCacheReplicationKind.PUSH=PUSH
DynamicCacheReplicationKind.PULL=PULL
DynamicCacheReplicationKind.PUSH_PULL=PUSH_PULL
EJBCache.displayName=Param\u00e8tres de la cache des EJB
EJBCache.description=Chaque conteneur d'EJB g\u00e8re une cache d'instances de beans pr\u00eates \u00e0 servir.  Cette section vous permet de sp\u00e9cifier les param\u00e8tres pour configurer la cache.
EJBCache.smallIcon=EJBCache.gif
EJBCache.largeIcon=EJBCache32X32.gif
EJBCache.cleanupInterval.displayName=Intervalle entre les nettoyages
EJBCache.cleanupInterval.units=millisecondes
EJBCache.cleanupInterval.description=P\u00e9riodicit\u00e9 suivant laquelle le conteneur tente de supprimer les \u00e9l\u00e9ments inutilis\u00e9s de la cache afin de ramener leur nombre total \u00e0 la valeur d\u00e9finie pour la taille de la cache.
EJBCache.cacheSize.displayName=Taille de la cache
EJBCache.cacheSize.units=emplacements
EJBCache.cacheSize.description=Sp\u00e9cifie le nombre d'emplacements dans la liste des instances actives du conteneur EJB.
EJBContainer.displayName=Conteneur d'EJB
EJBContainer.description=Un conteneur d'EJB est un composant d'un serveur d'applications J2EE qui fournit des services d'ex\u00e9cution aux modules EJB pouvant y \u00eatre d\u00e9ploy\u00e9s.
EJBContainer.smallIcon=EJBContainer.gif
EJBContainer.largeIcon=EJBContainer32X32.gif
EJBContainer.cacheSettings.displayName=Param\u00e8tres de la cache des EJB
EJBContainer.cacheSettings.description=Chaque conteneur d'EJB g\u00e8re une cache d'instances de beans pr\u00eates \u00e0 servir.  Cette section vous permet de sp\u00e9cifier les param\u00e8tres pour configurer la cache.
EJBContainer.passivationDirectory.displayName=R\u00e9pertoire de passivation
EJBContainer.passivationDirectory.description=R\u00e9pertoire dans lequel le conteneur sauvegarde l'\u00e9tat persistant des beans de session \u00e0 l'\u00e9tat passif.
EJBContainer.inactivePoolCleanupInterval.displayName=Intervalle entre les nettoyages des pools inactifs
EJBContainer.inactivePoolCleanupInterval.description=P\u00e9riodicit\u00e9 suivant laquelle le conteneur examine les pools d'instances de beans disponibles pour d\u00e9terminer si certaines instances peuvent \u00eatre supprim\u00e9es afin de r\u00e9duire l'utilisation de la m\u00e9moire.
EJBContainer.defaultDatasourceJNDIName.displayName=Nom JNDI de la source de donn\u00e9es par d\u00e9faut
EJBContainer.defaultDatasourceJNDIName.description=Nom JNDI de la source de donn\u00e9es \u00e0 utiliser si aucune source de donn\u00e9es n'a \u00e9t\u00e9 sp\u00e9cifi\u00e9e lors du d\u00e9ploiement de l'application. Ce param\u00e8tre n'est pas applicable pour les beans CMP compatibles EJB 2.x.
MessageListenerService.displayName=Service d'\u00e9coute de messages
MessageListenerService.description=Configuration du service d'\u00e9coute des messages. Ce service fournit un processus d'\u00e9coute MDB (beans g\u00e9r\u00e9s par messages), \u00e0 l'aide duquel les beans MDB sont d\u00e9ploy\u00e9s sur ListenerPorts qui d\u00e9finit la destination JMS \u00e0 partir de laquelle \u00e9couter. Ces ports d'\u00e9coute sont d\u00e9finis dans ce service avec les param\u00e8tres relatifs \u00e0 son pool d'unit\u00e9s d'ex\u00e9cution.
MessageListenerService.smallIcon=MessageListenerService.gif
MessageListenerService.largeIcon=MessageListenerService32X32.gif
MessageListenerService.listenerPorts.displayName=Ports d'\u00e9coute
MessageListenerService.listenerPorts.description=Ports du module d'\u00e9coute de messages configur\u00e9s dans le domaine d'administration.
MessageListenerService.threadPool.displayName=Pool d'unit\u00e9s d'ex\u00e9cution
MessageListenerService.threadPool.description=Sp\u00e9cifie les param\u00e8tres du pool d'unit\u00e9s d'ex\u00e9cution MDB du service d'\u00e9coute des messages
MessageListenerService.name.displayName=Nom
MessageListenerService.name.description=Nom sous lequel le service d'\u00e9coute de messages est connu \u00e0 des fins administratives.
MessageListenerService.description.displayName=Description
MessageListenerService.description.description=Le service d'\u00e9coute de messages est une extension des fonctions JMS du fournisseur JMS.  Il fournit un gestionnaire de modules d'\u00e9coute qui contr\u00f4le et g\u00e8re un ou plusieurs modules d'\u00e9coute JMS, chacun g\u00e9rant une destination JMS pour le compte d'un bean d\u00e9ploy\u00e9, g\u00e9r\u00e9 par messages.
ListenerPort.name.description=Nom du port d'\u00e9coute
ListenerPort.displayName=Ports d'\u00e9coute
ListenerPort.description=Ports d'\u00e9coute des beans g\u00e9r\u00e9s par message sur lesquels \u00e9couter les messages. Chaque port sp\u00e9cifie la fabrique de connexions JMS et la destination JMS qu'un bean MDB, d\u00e9ploy\u00e9 sur ce port, \u00e9coutera.
ListenerPort.smallIcon=ListenerPort.gif
ListenerPort.largeIcon=ListenerPort32X32.gif
ListenerPort.description.displayName=Description
ListenerPort.description.description=Description du port d'\u00e9coute, \u00e0 des fins administratives.
ListenerPort.connectionFactoryJNDIName.displayName=Nom JNDI de la fabrique de connexions
ListenerPort.connectionFactoryJNDIName.description=Nom JNDI de la fabrique de connexions JMS \u00e0 utiliser par le port d'\u00e9coute : exemple : jms/connFactory1.
ListenerPort.destinationJNDIName.displayName=Nom JNDI de la destination
ListenerPort.destinationJNDIName.description=Nom JNDI de la destination \u00e0 utiliser par le port d'\u00e9coute : exemple : jms/destn1.
ListenerPort.maxSessions.displayName=Nombre maximal de sessions
ListenerPort.maxSessions.description=Nombre maximal de sessions de serveur JMS simultan\u00e9es utilis\u00e9es par un programme d'\u00e9coute pour traiter les messages, compris entre 1 et 2147483647.
ListenerPort.maxRetries.displayName=Nombre maximal de tentatives
ListenerPort.maxRetries.description=Nombre maximal de fois que le programme d'\u00e9coute essaye d'envoyer un message avant de s'arr\u00eater, entre 0 et 2147483647.
ListenerPort.maxMessages.displayName=Nombre maximal de messages
ListenerPort.maxMessages.description=Nombre maximal de messages que le programme d'\u00e9coute peut traiter dans une session de serveur JMS, compris entre 0 et 2147483647.
ListenerPort.mbean.started.displayName=D\u00e9marr\u00e9
ListenerPort.mbean.started.description=Etat d'ex\u00e9cution du port d'\u00e9coute
ListenerPort.mbean.jmsConnJNDIName.displayName=Nom JNDI de la fabrique de connexions
ListenerPort.mbean.jmsConnJNDIName.description=Nom JNDI de la fabrique de connexions JMS que l'unit\u00e9 d'ex\u00e9cution du module d'\u00e9coute doit utiliser.
ListenerPort.mbean.jmsDestJNDIName.displayName=Nom JNDI de la destination
ListenerPort.mbean.jmsDestJNDIName.description=Nom JNDI de la destination JMS que l'unit\u00e9 d'ex\u00e9cution du module d'\u00e9coute doit utiliser.
ListenerPort.mbean.maxSessions.displayName=Nombre maximal de sessions
ListenerPort.mbean.maxSessions.description=Nombre maximal de sessions de serveur JMS concurrentes utilis\u00e9es par un module d'\u00e9coute MDB pour traiter les messages. Sa valeur doit \u00eatre comprise entre 1 et MAX_INT_VALUE.
ListenerPort.mbean.maxRetries.displayName=Nombre maximal de tentatives
ListenerPort.mbean.maxRetries.description=Nombre maximal de tentatives d'envoi d'un message avant que l'instance du module d'\u00e9coute MDB ne s'arr\u00eate.  Cette valeur doit \u00eatre comprise entre 0 et MAX_INT_VALUE.
ListenerPort.mbean.maxMessages.displayName=Nombre maximal de messages
ListenerPort.mbean.maxMessages.description=Nombre maximal de messages trait\u00e9s \u00e0 la fois par une session de serveur JMS. Cette valeur doit \u00eatre comprise entre 1 et MAX_INT_VALUE.
ListenerPort.must.be.selected=Vous devez s\u00e9lectionner au moins un port d'\u00e9coute pour effectuer cette op\u00e9ration.
ListenerPort.started.succussfully=Le d\u00e9marrage du port d''\u00e9coute {0} a abouti.
could.not.start.ListenerPort=Le port d''\u00e9coute {0} n''a pas pu \u00eatre d\u00e9marr\u00e9.
ListenerPort.stopped.succussfully=L''arr\u00eat du port d''\u00e9coute {0} a abouti.
could.not.stop.ListenerPort=Le port d''\u00e9coute {0} n''a pas pu \u00eatre arr\u00eat\u00e9.

WebContainer.displayName=Conteneur Web
WebContainer.description=Un conteneur Web traite les demandes client de ressources d'application Web, telles que des servlets, des fichiers JSP, etc. Il cr\u00e9e des instances de servlets, charge et d\u00e9charge des servlets, cr\u00e9e et g\u00e8re les objets des demandes et des r\u00e9ponses et accomplit d'autres t\u00e2ches de gestion des composants d'une application Web. Un serveur d'applications contient uniquement un seul conteneur Web ou aucun. Les modules d'extension du serveur Web, fournis par le produit WebSphere Application Server, permettent aux serveurs Web de transmettre les demandes de ressources au conteneur Web WebSphere Application Server. 
WebContainer.smallIcon=WebContainer.gif
WebContainer.largeIcon=WebContainer32X32.gif
WebContainer.transports.displayName=transports
WebContainer.transports.description=Liste de transports d\u00e9finis pour le conteneur Web.
webcontainer.threadpool.description=Pool d'unit\u00e9s d'ex\u00e9cution pour le conteneur Web.
WebContainer.sessionAffinityTimeout.displayName=D\u00e9lai d'expiration de l'affinit\u00e9 de session
WebContainer.sessionAffinityTimeout.description=Si cette option est diff\u00e9rente de z\u00e9ro, WebSphere peut faire passer l'affinit\u00e9 de session HTTP pour les demandes sur une autre instance de serveur une fois le d\u00e9lai sp\u00e9cifi\u00e9 \u00e9coul\u00e9.  Dans certains cas, ceci peut am\u00e9liorer les performances d'\u00e9quilibrage de la charge.    La valeur par d\u00e9faut est 0. Elle doit \u00eatre comprise entre  0 et MAX_INT.
WebContainer.sessionAffinityFailoverServer.displayName=Serveur de secours d'affinit\u00e9 de session
WebContainer.sessionAffinityFailoverServer.description=Si un gestionnaire d'\u00e9quilibrage de la charge (WLM) est utilis\u00e9 et qu'un serveur du groupe est arr\u00eat\u00e9, le gestionnaire achemine normalement les demandes adress\u00e9es au serveur arr\u00eat\u00e9 vers un autre serveur al\u00e9atoire du groupe.    Cette zone permet \u00e0 l'administrateur de sp\u00e9cifier le nom d'un serveur du groupe auquel les demandes par affinit\u00e9 seront achemin\u00e9es, au lieu d'un serveur choisi au hasard.
WebContainer.defaultVirtualHostName.displayName=Nom de l'h\u00f4te virtuel par d\u00e9faut
WebContainer.defaultVirtualHostName.description=H\u00f4te virtuel utilis\u00e9 par d\u00e9faut pour les applications Web.  Il peut \u00eatre remplac\u00e9 lors de l'installation de l'application.
WebContainer.enableServletCaching.displayName=Activer la mise en cache de servlet
WebContainer.enableServletCaching.description=Indique si la mise en cache des servlets et des fichiers JSP est activ\u00e9e.
DB2RowSizeEnum.ROW_SIZE_4KB=TAILLE_LIGNE_4ko
DB2RowSizeEnum.ROW_SIZE_8KB=TAILLE_LIGNE_8ko
DB2RowSizeEnum.ROW_SIZE_16KB=TAILLE_LIGNE_16ko
DB2RowSizeEnum.ROW_SIZE_32KB=TAILLE_LIGNE_32ko
TuningParams.displayName=Param\u00e8tres de r\u00e9glage personnalis\u00e9s
TuningParams.description=Param\u00e8tres permettant d'optimiser la gestion des sessions.
TuningParams.smallIcon=TuningParams.gif
TuningParams.largeIcon=TuningParams32X32.gif
TuningParams.invalidationSchedule.displayName=Planification d'invalidation
TuningParams.invalidationSchedule.description=Si l'option est activ\u00e9e, sp\u00e9cifie les deux heures de la journ\u00e9e pendant lesquelles le processus d'invalidation traite la base de donn\u00e9es et supprime les sessions persistantes invalid\u00e9es. Sp\u00e9cifiez les heures auxquelles l'activit\u00e9 sur le site est \u00e0 son minimum. L'objectif est de r\u00e9duire l'activit\u00e9 de la base de donn\u00e9es des sessions. Si l'option est activ\u00e9e, le nombre de mises \u00e0 jour de la base de donn\u00e9es requis pour maintenir les sessions Http actives est r\u00e9duit. Si l'option est d\u00e9sactiv\u00e9e, le processus d'invalidation sera p\u00e9riodique ; il s'ex\u00e9cutera \u00e0 intervalles de quelques minutes pour \u00e9liminer les sessions HTTP invalid\u00e9es.
TuningParams.usingMultiRowSchema.displayName=Utiliser un sch\u00e9ma multiligne
TuningParams.usingMultiRowSchema.description=D\u00e9termine si chaque instance de donn\u00e9es d'application doit \u00eatre plac\u00e9e dans une ligne distincte de la base de donn\u00e9es, autorisant ainsi le stockage d'une plus grande quantit\u00e9 de donn\u00e9es pour chaque session. Cela peut am\u00e9liorer les performances dans certains cas.  Si la valeur de cette option est True, chaque instance de donn\u00e9es d'application est plac\u00e9e dans une ligne distincte de la base de donn\u00e9es. En revanche , si la valeur est False, les instances de donn\u00e9es d'application sont plac\u00e9es dans la m\u00eame ligne.  
TuningParams.maxInMemorySessionCount.displayName=Nombre maximal de sessions en m\u00e9moire
TuningParams.maxInMemorySessionCount.description=Sp\u00e9cifie le nombre maximal de sessions \u00e0 conserver en m\u00e9moire.
TuningParams.allowOverflow.displayName=Autoriser le d\u00e9passement
TuningParams.allowOverflow.description=D\u00e9termine si vous autorisez on nom le nombre de sessions en m\u00e9moire \u00e0 d\u00e9passer la valeur sp\u00e9cifi\u00e9e par la propri\u00e9t\u00e9 Nombre maximal de sessions en m\u00e9moire.  Si la valeur est True, le d\u00e9passement est autoris\u00e9. Si la valeur est False, le nombre de sessions en m\u00e9moire est limit\u00e9 \u00e0 la valeur du nombre maximal de sessions en m\u00e9moire.      
TuningParams.scheduleInvalidation.displayName=Invalidation planifi\u00e9e
TuningParams.scheduleInvalidation.description=Indique quand les sessions incorrectes doivent \u00eatre supprim\u00e9es de la m\u00e9moire persistante.
TuningParams.writeFrequency.description=Cette option contr\u00f4le le moment auquel la session sera enregistr\u00e9e dans la m\u00e9moire persistante.
TuningParams.writeInterval.displayName=Intervalle d'\u00e9criture
TuningParams.writeInterval.description=Si vous choisissez TIME_BASED_WRITE pour la propri\u00e9t\u00e9 Fr\u00e9quence d'\u00e9criture, ce param\u00e8tre sp\u00e9cifie la p\u00e9riodicit\u00e9 suivant laquelle les donn\u00e9es de session sont \u00e9crites dans la base de donn\u00e9es. Il est exprim\u00e9e en secondes et doit \u00eatre un entier positif compris entre 5 et 9999. Une fois configur\u00e9, le d\u00e9lai d'expiration de l'invalidation doit \u00eatre au minimum deux fois plus grand que l'intervalle d'\u00e9criture.
TuningParams.writeContents.description=D\u00e9termine si seuls les attributs mis \u00e0 jour ou tous les attributs de la session doivent \u00eatre \u00e9crits dans la m\u00e9moire persistante.    Si vous choisissez uniquement les attributs mis \u00e0 jour, seuls ces derniers seront \u00e9crits dans la m\u00e9moire persistante.
TuningParams.invalidationTimeout.displayName=D\u00e9lai avant invalidation
TuningParams.invalidationTimeout.description=Sp\u00e9cifie la dur\u00e9e pendant laquelle une session peut rester inutilis\u00e9e avant d'\u00eatre consid\u00e9r\u00e9e comme n'\u00e9tant plus valide.  -1 indique que la session ne sera pas invalid\u00e9e.  Cette valeur est utilis\u00e9e comme valeur par d\u00e9faut lorsque le d\u00e9lai d'expiration de la session n'est pas sp\u00e9cifi\u00e9 dans un descripteur de d\u00e9ploiement d'une application Web.  Le temporisateur d'invalidation n'est pas pr\u00e9cis "\u00e0 la seconde". Il est prudent de consid\u00e9rer que sa pr\u00e9cision est de l'ordre de deux minutes.  Lorsque la valeur choisie pour la fr\u00e9quence d'\u00e9criture est TIME_BASED_WRITE (\u00e9criture p\u00e9riodique), la valeur du d\u00e9lai avant invalidation doit \u00eatre au moins deux fois plus \u00e9lev\u00e9e que celle de l'intervalle d'\u00e9criture.
WriteFrequencyEnum.END_OF_SERVLET_SERVICE=END_OF_SERVLET_SERVICE
WriteFrequencyEnum.MANUAL_UPDATE=MANUAL_UPDATE
WriteFrequencyEnum.TIME_BASED_WRITE=TIME_BASED_WRITE
WriteContentsEnum.ONLY_UPDATED_ATTRIBUTES=ONLY_UPDATED_ATTRIBUTES
WriteContentsEnum.ALL_SESSION_ATTRIBUTES=ALL_SESSION_ATTRIBUTES
InvalidationSchedule.displayName=Planning d'invalidation
InvalidationSchedule.description=Si l'option est activ\u00e9e, sp\u00e9cifie les deux heures de la journ\u00e9e pendant lesquelles le processus d'invalidation traite la base de donn\u00e9es et supprime les sessions persistantes invalid\u00e9es. Sp\u00e9cifiez les heures auxquelles l'activit\u00e9 sur le site est \u00e0 son minimum. L'objectif est de r\u00e9duire l'activit\u00e9 de la base de donn\u00e9es des sessions. Si l'option est activ\u00e9e, le nombre de mises \u00e0 jour de la base de donn\u00e9es requis pour maintenir les sessions Http actives est r\u00e9duit. Si l'option est d\u00e9sactiv\u00e9e, le processus d'invalidation sera p\u00e9riodique ; il s'ex\u00e9cutera \u00e0 intervalles de quelques minutes pour \u00e9liminer les sessions HTTP invalid\u00e9es.
InvalidationSchedule.smallIcon=InvalidationSchedule.gif
InvalidationSchedule.largeIcon=InvalidationSchedule32X32.gif
InvalidationSchedule.firstHour.displayName=Premi\u00e8re heure
InvalidationSchedule.firstHour.description=Premi\u00e8re heure de la journ\u00e9e au cours de laquelle les sessions non valides seront \u00e9limin\u00e9es de l'emplacement externe. Cette valeur doit \u00eatre un entier positif compris entre 0 et 23. Ceci n'est valable que lorsque l'invalidation planifi\u00e9e est activ\u00e9e.
InvalidationSchedule.secondHour.displayName=Deuxi\u00e8me heure
InvalidationSchedule.secondHour.description=Deuxi\u00e8me heure de la journ\u00e9e au cours de laquelle les sessions non valides seront \u00e9limin\u00e9es de l'emplacement externe. Cette valeur doit \u00eatre un entier positif compris entre 0 et 23. Ceci n'est valable que lorsque l'invalidation planifi\u00e9e est activ\u00e9e.
HTTPTransport.displayName=Transport HTTP
HTTPTransport.description=Transport HTTP pour communiquer les demandes au conteneur Web.
HTTPTransport.smallIcon=HTTPTransport.gif
HTTPTransport.largeIcon=HTTPTransport32X32.gif
DRSSettings.displayName=Service de messagerie interne
DRSSettings.description=Configuration de la r\u00e9plication des sessions de m\u00e9moire \u00e0 m\u00e9moire.
DRSSettings.smallIcon=DRSSettings.gif
DRSSettings.largeIcon=DRSSettings32X32.gif
DRSSettings.dataReplicationMode.displayName=Mode de r\u00e9plication des donn\u00e9es
DRSSettings.dataReplicationMode.description=Indique si une instance WebSphere envoie les donn\u00e9es via r\u00e9plication interne uniquement, les re\u00e7oit ou les deux.  Le mode par d\u00e9faut est les deux.
DRSSettings.messageBrokerDomainName.displayName=Nom de domaine de courtier de messages
DRSSettings.messageBrokerDomainName.description=Domaine de r\u00e9plication interne utilis\u00e9 par cette instance WebSphere.
DRSSettings.preferredLocalDRSBrokerName.displayName=Nom de courtier DRS local pr\u00e9f\u00e9r\u00e9
DRSSettings.preferredLocalDRSBrokerName.description=R\u00e9plicateur sp\u00e9cifique dans un domaine de r\u00e9plication auquel cette instance WebSphere se connecte initialement.
DRSSettings.overrideHostConnectionPoints.displayName=Remplacer les points de connexion de l'h\u00f4te
DRSSettings.overrideHostConnectionPoints.description=Permet la d\u00e9finition des ports et adresses IP sp\u00e9cifiques aux r\u00e9plicateurs (\u00e0 l'oppos\u00e9 d'un choix dans le domaine de r\u00e9plication de la cellule).
DRSSettings.hostPort.error=H\u00f4tes et ports non valides ou non concordants. Chaque h\u00f4te sp\u00e9cifi\u00e9 doit \u00eatre associ\u00e9 \u00e0 un num\u00e9ro de port.
SessionPersistenceKind.NONE=NONE
SessionPersistenceKind.DATABASE=DATABASE
SessionPersistenceKind.DATA_REPLICATION=DATA_REPLICATION

Server.displayName=Serveur
Server.description=Propri\u00e9t\u00e9 sur le mod\u00e8le de serveur qui identifie le nom du contexte pour un contexte mod\u00e8le. Ceci est destin\u00e9 \u00e0 supporter le concept d'h\u00e9ritage de valeur de configuration, de telle sorte que si cette derni\u00e8re n'est pas d\u00e9finie dans le contexte du serveur, l'environnement d'ex\u00e9cution consulte le mod\u00e8le identifi\u00e9 dans la propri\u00e9t\u00e9 ID mod\u00e8le (si existant) pour la d\u00e9finition.
Server.smallIcon=Server.gif
Server.largeIcon=Server32X32.gif
Server.customServices.displayName=Services personnalis\u00e9s
Server.customServices.description=D\u00e9finit les classes de services personnalis\u00e9es qui seront ex\u00e9cut\u00e9es dans ce serveur ainsi que leurs propri\u00e9t\u00e9s de configuration.
Server.components.displayName=Composants de serveur
Server.components.description=Composants d'ex\u00e9cution suppl\u00e9mentaires que vous pouvez configurer.
Server.components.ServerComponent.displayName=Composants de serveur
Server.extensions.displayName=Extensions
Server.started=D\u00e9marr\u00e9
Server.stopped=Arr\u00eat\u00e9
Service.displayName=Service
Service.description=Sp\u00e9cifie les param\u00e8tres de configuration d'un service qui s'ex\u00e9cute au sein du serveur d'applications.
Service.smallIcon=Service.gif
Service.largeIcon=Service32X32.gif
Service.context.displayName=contexte
Service.context.description=Contexte ou environnement dans lequel s'ex\u00e9cute le service.
Service.context.Component.displayName=Composants
Service.context.Server.displayName=Serveurs
Service.properties.displayName=Propri\u00e9t\u00e9s de personnalisation
Service.properties.description=Propri\u00e9t\u00e9s de personnalisation suppl\u00e9mentaires pour ce service pouvant \u00eatre configur\u00e9.
Service.enable.displayName=D\u00e9marrage
Service.enable.description=Indique si le serveur doit tenter de lancer le service indiqu\u00e9 au d\u00e9marrage.
CustomService.displayName=Services personnalis\u00e9s
CustomService.description=Fournit un point d'extension aux donn\u00e9es de configuration pour les services des modules d'extension.  Permet aux clients d'ajouter un code personnalis\u00e9 qui est ex\u00e9cut\u00e9 pendant l'initialisation du processus.
CustomService.smallIcon=CustomService.gif
CustomService.largeIcon=CustomService32X32.gif
CustomService.prerequisiteServices.displayName=Services pr\u00e9requis
CustomService.prerequisiteServices.description=Liste de r\u00e9f\u00e9rences aux autres services personnalis\u00e9s, d\u00e9finis dans ce processus que ce service personnalis\u00e9 attend avant d'\u00eatre initialis\u00e9.
CustomService.externalConfigURL.displayName=URL de la configuration externe
CustomService.externalConfigURL.description=D\u00e9termine l'adresse URL d'un fichier de configuration de service personnalis\u00e9.
CustomService.classname.displayName=Nom de classe
CustomService.classname.description=D\u00e9termine le nom de la classe d'impl\u00e9mentation du service. Cette classe doit impl\u00e9menter l'interface de service personnalis\u00e9.
CustomService.displayName.displayName=Nom affich\u00e9
CustomService.displayName.description=D\u00e9termine le nom du service.
CustomService.description.displayName=Description
CustomService.description.description=D\u00e9crit le service personnalis\u00e9.
CustomService.classpath.displayName=Chemin d'acc\u00e8s aux classes
CustomService.classpath.description=D\u00e9termine le chemin d'acc\u00e8s aux classes permettant de situer les classes et les fichiers jar pour ce service.
ThreadPool.displayName=Pool d'unit\u00e9s d'ex\u00e9cution
ThreadPool.description=Un pool d'unit\u00e9s d'ex\u00e9cution permet aux composants du serveur de r\u00e9utiliser les unit\u00e9s d'ex\u00e9cution existantes afin d'\u00e9viter d'avoir \u00e0 en cr\u00e9er d'autres lors de l'ex\u00e9cution. La cr\u00e9ation d'unit\u00e9s d'ex\u00e9cution constitue g\u00e9n\u00e9ralement une op\u00e9ration n\u00e9cessitant beaucoup de temps et de ressources.
ThreadPool.smallIcon=ThreadPool.gif
ThreadPool.largeIcon=ThreadPool32X32.gif
ThreadPool.minimumSize.displayName=Taille minimale
ThreadPool.minimumSize.description=Sp\u00e9cifie le nombre minimal d'unit\u00e9s d'ex\u00e9cution autoris\u00e9es dans le pool.
ThreadPool.maximumSize.displayName=Taille maximale
ThreadPool.maximumSize.description=Sp\u00e9cifie le nombre maximal d'unit\u00e9s d'ex\u00e9cution autoris\u00e9es dans le pool.
ThreadPool.inactivityTimeout.description=Sp\u00e9cifie le nombre de millisecondes d'inactivit\u00e9 devant s'\u00e9couler avant la r\u00e9cup\u00e9ration d'une unit\u00e9 d'ex\u00e9cution.
ThreadPool.isGrowable.displayName=Peut augmenter
ThreadPool.isGrowable.description=D\u00e9termine si le nombre d'unit\u00e9s d'ex\u00e9cution peut d\u00e9passer la taille maximale configur\u00e9e pour le pool d'unit\u00e9s d'ex\u00e9cution.
MessageFormatKind.BASIC=BASIC
MessageFormatKind.ADVANCED=ADVANCED
ServiceContext.displayName=Contexte de service
ServiceContext.description=Contexte ou environnement dans lequel s'ex\u00e9cute un service.
ServiceContext.smallIcon=ServiceContext.gif
ServiceContext.largeIcon=ServiceContext32X32.gif
ServiceContext.services.displayName=Services
ServiceContext.services.description=Services fournis par le conteneur aux composants s'ex\u00e9cutant dans le contexte du conteneur.  Les types de services fournis par un conteneur sont limit\u00e9s selon le type de conteneur en fonction d'une comparaison de la port\u00e9e du service avec celle du conteneur.  
ServiceContext.services.CustomService.displayName=Services personnalis\u00e9s
Component.displayName=Composant
Component.description=Repr\u00e9sente un processus contenant des composants appelables \u00e0 distance.  Un serveur repr\u00e9sente les informations de configuration d'un composant pouvant s'ex\u00e9cuter ind\u00e9pendamment d'un composant parent dans son propre processus (tel qu'un service).  Plusieurs serveurs peuvent s'ex\u00e9cuter dans la machine virtuelle Java (JVM).
Component.smallIcon=Component.gif
Component.largeIcon=Component32X32.gif
Component.properties.displayName=Propri\u00e9t\u00e9s de personnalisation
Component.properties.description=Propri\u00e9t\u00e9s de personnalisation suppl\u00e9mentaires pour ce composant d'ex\u00e9cution. Certains composants peuvent utiliser des propri\u00e9t\u00e9s de configuration personnalis\u00e9es que vous pouvez d\u00e9finir ici.
Component.parentComponent.displayName=Composant parent
Component.parentComponent.description=Composant d'ex\u00e9cution le plus grand contenant ces param\u00e8tres de configuration.
Component.parentComponent.ServerComponent.displayName=Composants du serveur
Component.components.displayName=composants
Component.components.description=Composants d'ex\u00e9cution suppl\u00e9mentaires que vous pouvez configurer.
Component.components.ServerComponent.displayName=Composants du serveur
Component.server.displayName=serveur
Component.server.description=Processus (ou ensemble de processus agissant comme un processus logique unique) s'ex\u00e9cutant sur un noeud fournissant des services et des ressources aux applications par le biais des conteneurs et des services ex\u00e9cut\u00e9s dans l'application.
Agent.displayName=Agent
Agent.description=
Agent.smallIcon=Agent.gif
Agent.largeIcon=Agent32X32.gif
Server.stateManagement.displayName=Gestion de l'\u00e9tat
Server.stateManagement.description=Capacit\u00e9 de contr\u00f4le de l'\u00e9tat de la ressource g\u00e9r\u00e9e. En d'autres termes, il s'agit de la possibilit\u00e9 de la d\u00e9marrer et de l'arr\u00eater.
Server.statisticsProvider.displayName=Fournisseur de statistiques
Server.statisticsProvider.description=Capacit\u00e9 de la ressource g\u00e9r\u00e9e \u00e0 g\u00e9n\u00e9rer des mesures de performances.
ManagedObject.name.displayName=Nom
ManagedObject.name.description=Nom \u00e0 utiliser pour l'objet g\u00e9r\u00e9 repr\u00e9sentant l'objet actif.  Le nom de cet objet g\u00e9r\u00e9 agit tel un composant d'un nom hi\u00e9rarchiquement calcul\u00e9 pouvant \u00eatre utilis\u00e9 avec un processus ManagementAgent pour localiser l'interface de contr\u00f4le de fonctionnement de l'objet actif lors de l'ex\u00e9cution.
ExecutionState.START=DEMARRAGE
ExecutionState.STOP=ARRET
StateManageable.displayName=Etat g\u00e9rable
StateManageable.description=Repr\u00e9sente les param\u00e8tres de configuration des objets g\u00e9r\u00e9s ayant un cycle de vie (d\u00e9marrage, arr\u00eat, etc.).
StateManageable.smallIcon=StateManageable.gif
StateManageable.largeIcon=StateManageable32X32.gif
StateManageable.managedObject.displayName=Objet g\u00e9r\u00e9
StateManageable.managedObject.description=Objet pouvant \u00eatre d\u00e9marr\u00e9 ou arr\u00eat\u00e9.
StateManageable.managedObject.ServiceContext.displayName=Contextes de service
StateManageable.initialState.displayName=Etat initial
StateManageable.initialState.description=Etat d'ex\u00e9cution demand\u00e9 lorsque le serveur est lanc\u00e9 pour la premi\u00e8re fois.
ServerComponent.StateManageable.initialState.description=Etat d'ex\u00e9cution du composant demand\u00e9 lorsque le serveur est lanc\u00e9 pour la premi\u00e8re fois.
StatisticsProvider.displayName=Fournisseur de statistiques
StatisticsProvider.description=Sp\u00e9cifie les param\u00e8tres de configuration des objets g\u00e9r\u00e9s qui fournissent des informations statistiques, telles que des donn\u00e9es de performances.
StatisticsProvider.smallIcon=StatisticsProvider.gif
StatisticsProvider.largeIcon=StatisticsProvider32X32.gif
StatisticsProvider.managedObject.displayName=Objet g\u00e9r\u00e9
StatisticsProvider.managedObject.description=Objet fournissant les mesures de performances.
StatisticsProvider.managedObject.ServiceContext.displayName=Contextes de service
StatisticsProvider.specification.displayName=sp\u00e9cification
StatisticsProvider.specification.description=Cha\u00eene de sp\u00e9cification pouvant \u00eatre utilis\u00e9e pour sp\u00e9cifier des param\u00e8tres de contr\u00f4le de performances pour l'objet g\u00e9r\u00e9.
Extension.displayName=Extension
Extension.description=
Extension.smallIcon=Extension.gif
Extension.largeIcon=Extension32X32.gif
Extension.name.displayName=nom
Extension.name.description=
Extension.configURI.displayName=URI de configuration
Extension.configURI.description=
ServerComponent.displayName=Composant du serveur
ServerComponent.description=Ce panneau donne acc\u00e8s aux param\u00e8tres de configuration de certains types de fonctionnalit\u00e9 du serveur, tels que les param\u00e8tres du serveur de noms, du serveur JMS et du serveur d'applications. Suivant le type principal du serveur, la liste des composants du serveur configur\u00e9s peut varier.
ServerComponent.smallIcon=ServerComponent.gif
ServerComponent.largeIcon=ServerComponent32X32.gif
Server.name.displayName=Nom
Server.name.description=Nom du serveur.
Server.adminService.displayName=Services d'administration
Server.adminService.description=Sp\u00e9cifie plusieurs param\u00e8tres relatifs \u00e0 la fonction d'administration pour ce serveur, tels que les param\u00e8tres du protocole de communication d'administration et les d\u00e9lais d'expiration.

AdminService.displayName=Services d'administration
AdminService.description=Logique de service contr\u00f4lant toutes les fonctions d'administration dans le processus g\u00e9r\u00e9.
AdminService.smallIcon=AdminService.gif
AdminService.largeIcon=AdminService32X32.gif
AdminService.connectors.displayName=Connecteurs JMX
AdminService.connectors.description=Les connecteurs fournissent un canal de communication entre les processus g\u00e9r\u00e9s WebSphere bas\u00e9 sur un protocole de communication sp\u00e9cifique.
AdminService.connectors.HTTPConnector.displayName=Connecteurs HTTP
AdminService.connectors.JMSConnector.displayName=Connecteurs JMS
AdminService.connectors.RMIConnector.displayName=Connecteurs RMI
AdminService.connectors.SOAPConnector.displayName=Connecteurs SOAP
AdminService.preferredConnector.displayName=Connecteur pr\u00e9f\u00e9r\u00e9
AdminService.preferredConnector.description=Sp\u00e9cifie le type de connecteur JMX pr\u00e9f\u00e9r\u00e9. Les options disponibles, telles que SOAPConnector ou RMIConnector, sont d\u00e9finies dans la page des connecteurs JMX.
AdminService.preferredConnector.HTTPConnector.displayName=Connecteur HTTP
AdminService.preferredConnector.JMSConnector.displayName=Connecteur JMS
AdminService.preferredConnector.RMIConnector.displayName=Connecteur RMI
AdminService.preferredConnector.SOAPConnector.displayName=Connecteur SOAP
AdminService.extensionMBeanProviders.displayName=Fournisseurs de MBean d'extension
AdminService.extensionMBeanProviders.description=Liste de biblioth\u00e8que contenant des \u00e9l\u00e9ments qui prennent en charge le m\u00e9canisme ExtensionMBean d'extension du service admin avec des MBeans JMX suppl\u00e9mentaires.
AdminService.configRepository.displayName=Service de r\u00e9f\u00e9rentiel
AdminService.configRepository.description=Donn\u00e9es de configuration utilis\u00e9es par l'impl\u00e9mentation du service du r\u00e9f\u00e9rentiel.
AdminService.standalone.displayName=Autonome
AdminService.standalone.description=D\u00e9termine si le processus du serveur fait partie d'une cellule Network Deployment ou non. Si la valeur est true, il ne participe pas \u00e0 l'administration distribu\u00e9e. Si la valeur est false, il participe au syst\u00e8me de d\u00e9ploiement r\u00e9seau Network Deployment.
JMXConnector.displayName=Connecteurs JMX
JMXConnector.description=Les connecteurs fournissent un canal de communication entre les processus g\u00e9r\u00e9s WebSphere bas\u00e9 sur un protocole de communication sp\u00e9cifique.
JMXConnector.smallIcon=JMXConnector.gif
JMXConnector.largeIcon=JMXConnector32X32.gif
JMXConnector.properties.displayName=Propri\u00e9t\u00e9s de personnalisation
JMXConnector.properties.description=Propri\u00e9t\u00e9s de configuration arbitraire qui s'appliquent \u00e0 ce connecteur JMX.
jmx=Connecteurs JMX
ExtensionMBean.displayName=MBean d'extension
ExtensionMBean.description=Identifie l'emplacement des m\u00e9tadonn\u00e9es pour MBean.
ExtensionMBean.smallIcon=ExtensionMBean.gif
ExtensionMBean.largeIcon=ExtensionMBean32X32.gif
ExtensionMBean.descriptorURI.displayName=URI de descripteur
ExtensionMBean.descriptorURI.description=Emplacement du descripteur de MBean 
ExtensionMBean.type.displayName=type
ExtensionMBean.type.description=Type de MBean.
HTTPConnector.displayName=Connecteur HTTP
HTTPConnector.description=Connecteur JMX prenant en charge le protocole de communication HTTP
HTTPConnector.smallIcon=HTTPConnector.gif
HTTPConnector.largeIcon=HTTPConnector32X32.gif
JMSConnector.displayName=Connecteur JMS
JMSConnector.description=Aucun connecteur JMS n'est impl\u00e9ment\u00e9 dans la version 5.0. Il s'agit d'un \u00e9l\u00e9ment de ligne ult\u00e9rieur \u00e0 la version 5.0.
JMSConnector.smallIcon=JMSConnector.gif
JMSConnector.largeIcon=JMSConnector32X32.gif
RMIConnector.displayName=Connecteur RMI
RMIConnector.description=Connecteur JMX prenant en charge le protocole de communication RMI.
RMIConnector.smallIcon=RMIConnector.gif
RMIConnector.largeIcon=RMIConnector32X32.gif
SOAPConnector.displayName=Connecteur SOAP
SOAPConnector.description=Connecteur JMX prenant en charge le protocole de communication SOAP.
SOAPConnector.smallIcon=SOAPConnector.gif
SOAPConnector.largeIcon=SOAPConnector32X32.gif
RepositoryService.displayName=Service de r\u00e9f\u00e9rentiel
RepositoryService.description=Logique de service g\u00e9rant le r\u00e9f\u00e9rentiel de configuration.
RepositoryService.smallIcon=RepositoryService.gif
RepositoryService.largeIcon=RepositoryService32X32.gif
RepositoryService.lockTimeout.displayName=D\u00e9lai de d\u00e9passement du verrouillage
RepositoryService.lockTimeout.units=minutes
RepositoryService.lockTimeout.description=Indique le d\u00e9lai (en minutes) apr\u00e8s lequel le verrouillage d'un r\u00e9f\u00e9rentiel non d\u00e9verrouill\u00e9 manuellement est automatiquement d\u00e9verrouill\u00e9.
RepositoryService.auditEnabled.displayName=Audit activ\u00e9
RepositoryService.auditEnabled.description=Mises \u00e0 jour du r\u00e9f\u00e9rentiel d'audit dans le fichier journal.
ExtensionMBeanProvider.displayName=Fournisseurs de MBean d'extension
ExtensionMBeanProvider.description=Biblioth\u00e8que contenant l'impl\u00e9mentation d'un \u00e9l\u00e9ment JMX MBean, ainsi que le fichier de descripteur XML du MBean associ\u00e9, permettant d'\u00e9tendre les ressources g\u00e9r\u00e9s WebSphere dans le syst\u00e8me d'administration de base. 
ExtensionMBeanProvider.smallIcon=ExtensionMBeanProvider.gif
ExtensionMBeanProvider.largeIcon=ExtensionMBeanProvider32X32.gif
ExtensionMBeanProvider.extensionMBeans.displayName=MBeans d'extension
ExtensionMBeanProvider.extensionMBeans.description=D\u00e9finitions MBean non incluses dans le produit WebSphere de base.
ExtensionMBeanProvider.classpath.displayName=Chemin d'acc\u00e8s aux classes
ExtensionMBeanProvider.classpath.description=Chemin d'acc\u00e8s aux classes dans la biblioth\u00e8que du fournisseur o\u00f9 se trouve le descripteur de MBean. Le chargeur de classes a besoin de ces informations pour charger et analyser le fichier de descripteur XML du MBean.
ExtensionMBeanProvider.description.displayName=Description
ExtensionMBeanProvider.description.description=Texte de description arbitraire pour la configuration du fournisseur de MBean d'extension. Indiquez dans cette zone n'importe quel texte permettant d'identifier ou de diff\u00e9rencier la configuration du fournisseur.
ExtensionMBeanProvider.name.displayName=Nom
ExtensionMBeanProvider.name.description=Nom permettant d'identifier la biblioth\u00e8que du fournisseur MBean d'extension.
JMXConnector.type.displayName=Type
JMXConnector.type.description=Type de connecteur JMX

JavaProcessDef.displayName=D\u00e9finition du processus Java
JavaProcessDef.description=Les processus Java n\u00e9cessitent des informations suppl\u00e9mentaires pouvant \u00eatre transmises \u00e0 la machine virtuelle Java lorsque le processus est engendr\u00e9.
JavaProcessDef.smallIcon=JavaProcessDef.gif
JavaProcessDef.largeIcon=JavaProcessDef32X32.gif
JavaProcessDef.jvmEntries.displayName=Entr\u00e9es de la JVM
JavaProcessDef.jvmEntries.description=Liste des configurations des machines virtuelles Java associ\u00e9es \u00e0 ce serveur.
JavaProcessDef.executableTargetKind.displayName=Type de cible ex\u00e9cutable
JavaProcessDef.executableTargetKind.description=D\u00e9termine si un nom de classe Java ou un nom de fichier Jar ex\u00e9cutable sera utilis\u00e9 comme cible ex\u00e9cutable de ce processus Java.
JavaProcessDef.executableTarget.displayName=Cible ex\u00e9cutable
JavaProcessDef.executableTarget.description=Nom de la cible ex\u00e9cutable (une classe Java contenant une m\u00e9thode main() ou le nom d'un fichier JAR ex\u00e9cutable), selon le type de cible ex\u00e9cutable.
ProcessDef.displayName=D\u00e9finition des processus
ProcessDef.description=Une d\u00e9finition de processus d\u00e9finit les informations de ligne de commande n\u00e9cessaires au d\u00e9marrage et \u00e0 l'initialisation d'un processus.
ProcessDef.smallIcon=ProcessDef.gif
ProcessDef.largeIcon=ProcessDef32X32.gif
ProcessDef.execution.displayName=Ex\u00e9cution du processus
ProcessDef.execution.description=Ensemble des propri\u00e9t\u00e9s contr\u00f4lant la fa\u00e7on dont s'ex\u00e9cute le processus du syst\u00e8me d'exploitation, par exemple les droits RunAs, Umask, la priorit\u00e9 du processus.
ProcessDef.ioRedirect.displayName=Journaux des processus
ProcessDef.ioRedirect.description=Ensemble des propri\u00e9t\u00e9s contr\u00f4lant la fa\u00e7on dont les flux d'entr\u00e9e et de sortie natifs du processus sont dirig\u00e9s.
ProcessDef.environment.displayName=Entr\u00e9es d'environnement
ProcessDef.environment.description=Liste des param\u00e8tres \u00e0 ajouter \u00e0 l'environnement d'ex\u00e9cution du processus.
ProcessDef.monitoringPolicy.displayName=R\u00e8gles de supervision
ProcessDef.monitoringPolicy.description=Ensemble de propri\u00e9t\u00e9s contr\u00f4lant la fa\u00e7on dont l'agent de noeud surveille le processus.
ProcessDef.executableName.displayName=Nom du fichier ex\u00e9cutable
ProcessDef.executableName.description=Sp\u00e9cifie le nom de l'ex\u00e9cutable du processus.
ProcessDef.executableArguments.displayName=Arguments du fichier ex\u00e9cutable
ProcessDef.executableArguments.description=Indique les commandes ex\u00e9cut\u00e9es au d\u00e9marrage du processus.
ProcessDef.workingDirectory.displayName=R\u00e9pertoire de travail
ProcessDef.workingDirectory.description=Sp\u00e9cifie le r\u00e9pertoire du syst\u00e8me de fichiers dans lequel le processus va s'ex\u00e9cuter.
ProcessExecution.displayName=Ex\u00e9cution du processus
ProcessExecution.description=Configuration des param\u00e8tres d'ex\u00e9cution de processus suppl\u00e9mentaires. Ces valeurs ne sont pas utilis\u00e9es sur la plateforme Windows.
ProcessExecution.smallIcon=ProcessExecution.gif
ProcessExecution.largeIcon=ProcessExecution32X32.gif
ProcessExecution.processPriority.displayName=Priorit\u00e9 du processus
ProcessExecution.processPriority.description=Sp\u00e9cifie la priorit\u00e9 du syst\u00e8me d'exploitation du processus. Seuls les utilisateurs root peuvent modifier cette valeur.
ProcessExecution.umask.displayName=UMASK
ProcessExecution.umask.description=Sp\u00e9cifie le masque utilisateur sous lequel s'ex\u00e9cute le processus (masque de droit d'acc\u00e8s au mode du fichier).
ProcessExecution.runAsUser.displayName=Ex\u00e9cuter en tant qu'utilisateur
ProcessExecution.runAsUser.description=Sp\u00e9cifie l'utilisateur pour lequel s'ex\u00e9cute le processus.
ProcessExecution.runAsGroup.displayName=Ex\u00e9cuter en tant que groupe
ProcessExecution.runAsGroup.description=Sp\u00e9cifie le groupe dont le processus est membre et au nom duquel il s'ex\u00e9cute.
ProcessExecution.runInProcessGroup.displayName=Groupe de processus d'ex\u00e9cution
ProcessExecution.runInProcessGroup.description=Indique un processus pour un groupe de processus sp\u00e9cifique. Ceci s'av\u00e8re utile pour des op\u00e9rations telles que le partitionnement de processeur. Un administrateur syst\u00e8me peut d\u00e9finir l'ex\u00e9cution d'un groupe de processus sur, par exemple, 6 ou 12 processeurs. La valeur par d\u00e9faut (0) consiste \u00e0 ne pas attribuer le processus \u00e0 un groupe sp\u00e9cifique.
OutputRedirect.displayName=Redirection de la sortie
OutputRedirect.description=Redirige les flux d'entr\u00e9e, de sortie et d'erreur standard vers les fichiers sp\u00e9cifi\u00e9s.
OutputRedirect.smallIcon=OutputRedirect.gif
OutputRedirect.largeIcon=OutputRedirect32X32.gif
OutputRedirect.stdinFilename.displayName=Nom de fichier pour stdin
OutputRedirect.stdinFilename.description=Redirige les entr\u00e9es-sorties de fichier pour les flux standard.
OutputRedirect.stdoutFilename.displayName=Nom de fichier pour stdout
OutputRedirect.stdoutFilename.description=Sp\u00e9cifie le fichier vers lequel le flux de sortie standard sera dirig\u00e9. Le nom du fichier peut contenir un nom de chemin symbolique d\u00e9fini dans les entr\u00e9es de variables.
OutputRedirect.stderrFilename.displayName=Nom de fichier pour stderr
OutputRedirect.stderrFilename.description=Sp\u00e9cifie le fichier vers lequel le flux de sortie standard sera dirig\u00e9. Le nom du fichier peut contenir un nom de chemin symbolique d\u00e9fini dans les entr\u00e9es de variables.
JavaVirtualMachine.displayName=Machine virtuelle Java
JavaVirtualMachine.description=Param\u00e8tres avanc\u00e9s de la machine virtuelle Java.
JavaVirtualMachine.smallIcon=JavaVirtualMachine.gif
JavaVirtualMachine.largeIcon=JavaVirtualMachine32X32.gif
JavaVirtualMachine.systemProperties.displayName=Propri\u00e9t\u00e9s de personnalisation
JavaVirtualMachine.systemProperties.description=Propri\u00e9t\u00e9s du syst\u00e8me Java \u00e0 d\u00e9finir dans la m\u00e9moire pour cette machine virtuelle Java.
ManagedObject.stateManagement.description=Capacit\u00e9 de contr\u00f4le de l'\u00e9tat de la ressource g\u00e9r\u00e9e. En d'autres termes, il s'agit de la possibilit\u00e9 de la d\u00e9marrer et de l'arr\u00eater.
JavaVirtualMachine.classpath.displayName=Chemin d'acc\u00e8s aux classes
JavaVirtualMachine.classpath.description=Sp\u00e9cifiez le chemin d'acc\u00e8s aux classes standard dans lequel la machine virtuelle Java recherche les classes.
JavaVirtualMachine.bootClasspath.displayName=Chemin d'acc\u00e8s aux classes amorce
JavaVirtualMachine.bootClasspath.description=Sp\u00e9cifie les classes et les ressources d'amor\u00e7age pour une machine virtuelle Java. Cette option n'est disponible que pour les machines virtuelles Java qui prennent en charge les classes et les ressources d'amor\u00e7age. Vous pouvez s\u00e9parer plusieurs chemins par un deux-points (:) ou un point-virgule (;), selon le syst\u00e8me d'exploitation du noeud.
JavaVirtualMachine.verboseModeClass.displayName=Chargement des classes en mode prolixe
JavaVirtualMachine.verboseModeClass.description=D\u00e9termine l'utilisation de la sortie prolixe de d\u00e9bogage pour le chargement des classes. Par d\u00e9faut, le chargement des classes prolixe n'est pas activ\u00e9.
JavaVirtualMachine.verboseModeGarbageCollection.displayName=Processus de r\u00e9cup\u00e9ration de place en mode prolixe
JavaVirtualMachine.verboseModeGarbageCollection.description=D\u00e9termine l'utilisation de la sortie prolixe de d\u00e9bogage pour la r\u00e9cup\u00e9ration de place. Par d\u00e9faut, la r\u00e9cup\u00e9ration de place prolixe n'est pas activ\u00e9e.
JavaVirtualMachine.verboseModeJNI.displayName=JNI en mode prolixe
JavaVirtualMachine.verboseModeJNI.description=D\u00e9termine l'utilisation de la sortie prolixe de d\u00e9bogage pour l'appel de m\u00e9thode natif. Par d\u00e9faut, le mode prolixe de JNI n'est pas activ\u00e9.
JavaVirtualMachine.initialHeapSize.displayName=Taille initiale du segment Java
JavaVirtualMachine.initialHeapSize.description=Sp\u00e9cifie la taille initiale, en m\u00e9gaoctets, du segment Java (heap) allou\u00e9 \u00e0 la JVM. 
JavaVirtualMachine.maximumHeapSize.displayName=Taille maximale du segment Java
JavaVirtualMachine.maximumHeapSize.description=Sp\u00e9cifie la taille de segment maximale allou\u00e9e \u00e0 la JVM, en m\u00e9gaoctets.  La valeur par d\u00e9faut est 256.
JavaVirtualMachine.runHProf.displayName=Ex\u00e9cuter HProf
JavaVirtualMachine.runHProf.description=D\u00e9termine l'utilisation du support du profileur HProf. Pour utiliser un autre profileur, sp\u00e9cifiez les param\u00e8tres du profileur personnalis\u00e9 \u00e0 l'aide du param\u00e8tres HProf Arguments.  Par d\u00e9faut, le support du profileur HProf n'est pas activ\u00e9.
JavaVirtualMachine.hprofArguments.displayName=Arguments de HProf
JavaVirtualMachine.hprofArguments.description=Sp\u00e9cifie les arguments du profileur de ligne de commande \u00e0 transmettre \u00e0 la machine virtuelle Java qui d\u00e9marre le processus du serveur d'applications. Vous pouvez sp\u00e9cifier des arguments lorsque le support du profileur HProf est activ\u00e9.
JavaVirtualMachine.debugMode.displayName=Mode de d\u00e9bogage
JavaVirtualMachine.debugMode.description=D\u00e9termine l'utilisation de la sortie de d\u00e9bogage JVM. Par d\u00e9faut, le support du mode de d\u00e9bogage n'est pas activ\u00e9.
JavaVirtualMachine.debugArgs.displayName=Arguments de d\u00e9bogage
JavaVirtualMachine.debugArgs.description=Sp\u00e9cifie les arguments de d\u00e9bogage de ligne de commande \u00e0 transmettre \u00e0 la machine virtuelle Java qui d\u00e9marre le processus du serveur d'applications. Vous pouvez sp\u00e9cifier des arguments lorsque le mode D\u00e9bogage est activ\u00e9.
JavaVirtualMachine.genericJvmArguments.displayName=Arguments JVM g\u00e9n\u00e9riques
JavaVirtualMachine.genericJvmArguments.description=Arguments de ligne de commande suppl\u00e9mentaires destin\u00e9s \u00e0 la JVM.
JavaVirtualMachine.executableJarFileName.displayName=Nom du fichier JAR du programme ex\u00e9cutable
JavaVirtualMachine.executableJarFileName.description=Sp\u00e9cifie un nom de chemin complet pour un fichier jar ex\u00e9cutable que la machine virtuelle Java utilise.
JavaVirtualMachine.disableJIT.displayName=D\u00e9sactivation du compilateur JIT
JavaVirtualMachine.disableJIT.description=Configure la machine virtuelle Java de sorte que le compilateur JIT (Just-In-Time) soit d\u00e9sactiv\u00e9.
JavaVirtualMachine.osName.displayName=Nom du syst\u00e8me d'exploitation
JavaVirtualMachine.osName.description=Sp\u00e9cifie les param\u00e8tres de la JVM pour un syst\u00e8me d'exploitation donn\u00e9. Une fois d\u00e9marr\u00e9, le processus utilise les param\u00e8tres de la JVM du syst\u00e8me d'exploitation du noeud.
MonitoringPolicy.displayName=R\u00e8gles de supervision
MonitoringPolicy.description=Param\u00e8tres qui d\u00e9finissent les r\u00e8gles (ou modalit\u00e9s) de supervision des performances du serveur d'application.
MonitoringPolicy.smallIcon=MonitoringPolicy.gif
MonitoringPolicy.largeIcon=MonitoringPolicy32X32.gif
MonitoringPolicy.maximumStartupAttempts.displayName=Nombre maximal de tentatives de d\u00e9marrage
MonitoringPolicy.maximumStartupAttempts.units=tentatives
MonitoringPolicy.maximumStartupAttempts.description=Sp\u00e9cifie le nombre maximal de tentatives de d\u00e9marrage du serveur d'applications avant abandon.
MonitoringPolicy.pingInterval.displayName=Intervalle entre commandes ping
MonitoringPolicy.pingInterval.units=secondes
MonitoringPolicy.pingInterval.description=Indique la fr\u00e9quence des tentatives de communication entre le processus parent, tel que l'agent du noeud et le processus engendr\u00e9, tel qu'un serveur d'applications. Modifiez cette valeur en fonction de vos besoins pour red\u00e9marrer les serveurs ayant \u00e9chou\u00e9. Si vous diminuez cette valeur, les \u00e9checs sont d\u00e9tect\u00e9s plus t\u00f4t ; si vous l'augmentez, la fr\u00e9quence des commandes ping est moindre, ce qui r\u00e9duit la charge du syst\u00e8me.
MonitoringPolicy.pingTimeout.displayName=D\u00e9lai d'expiration de la commande ping
MonitoringPolicy.pingTimeout.units=secondes
MonitoringPolicy.pingTimeout.description=P\u00e9riode apr\u00e8s laquelle aucune r\u00e9ponse du processus contr\u00f4l\u00e9 n'est attendue indiquant qu'il est d\u00e9fectueux.
MonitoringPolicy.pingInitialTimeout.displayName=D\u00e9lai d'expiration initial de la commande ping
MonitoringPolicy.pingInitialTimeout.units=secondes
MonitoringPolicy.pingInitialTimeout.description=Indique la dur\u00e9e maximale (en secondes) avant la fin de l'initialisation du serveur. Une fois ce d\u00e9lai \u00e9coul\u00e9, le serveur d'administration tente de red\u00e9marrer le serveur.
MonitoringPolicy.autoRestart.displayName=Red\u00e9marrage automatique
MonitoringPolicy.autoRestart.description=D\u00e9termine si le processus doit red\u00e9marrer automatiquement apr\u00e8s un \u00e9chec. Par d\u00e9faut, le processus n'est pas red\u00e9marr\u00e9 automatiquement.
MonitoringPolicy.nodeRestartState.displayName=Etat de red\u00e9marrage du noeud
MonitoringPolicy.nodeRestartState.description=Sp\u00e9cifie l'\u00e9tat de traitement atteint si le red\u00e9marrage automatique est activ\u00e9.  Les options sont : ARRETE, EN COURS D'EXECUTION, PRECEDENT. La valeur par d\u00e9faut est ARRETE.
ExecutableTargetKind.JAVA_CLASS=JAVA_CLASS
ExecutableTargetKind.EXECUTABLE_JAR=EXECUTABLE_JAR
RestartStateKind.STOPPED=ARRETE
RestartStateKind.RUNNING=EN COURS D'EXECUTION
RestartStateKind.PREVIOUS=PRECEDENT

Server.services.DebugService.displayName=Service de d\u00e9bogage
Server.services.DebugService.description=Indique les param\u00e8tres du service de d\u00e9bogage \u00e0 utiliser avec une application client de d\u00e9bogage de l'espace de travail.
DebugService.displayName=Service de d\u00e9bogage
DebugService.description=Mod\u00e8le sp\u00e9cifiant les attributs requis pour le d\u00e9bogage d'une machine JVM et des divers composants, tels que le gestionnaire BSF
DebugService.smallIcon=DebugService.gif
DebugService.largeIcon=DebugService32X32.gif
DebugService.jvmDebugPort.displayName=Port de d\u00e9bogage JVM
DebugService.jvmDebugPort.description=Port d'\u00e9coute de JVM pour le d\u00e9bogage des connexions.  
DebugService.jvmDebugArgs.displayName=Arguments du d\u00e9bogage JVM
DebugService.jvmDebugArgs.description=Cha\u00eene d'arguments de d\u00e9bogage utilis\u00e9e pour indiquer \u00e0 la machine de d\u00e9marrer en mode d\u00e9bogage.  
DebugService.debugClassFilters.displayName=Filtres des classes pour le d\u00e9bogage
DebugService.debugClassFilters.description=Table des classes \u00e0 ne pas prendre en compte lors du d\u00e9bogage.   Lors d'une ex\u00e9cution en mode pas-\u00e0-pas, le d\u00e9bogueur ne s'arr\u00eate pas sur les classes correspondant \u00e0 une entr\u00e9e du filtre.  
DebugService.BSFDebugPort.displayName=Port de d\u00e9bogage BSF
DebugService.BSFDebugPort.description=Port de d\u00e9marrage du gestionnaire de d\u00e9bogage BSF.  
DebugService.BSFLoggingLevel.displayName=Niveau de consignation BSF
DebugService.BSFLoggingLevel.description=Niveau de consignation fourni par le gestionnaire de d\u00e9bogage BSF.
servermanagement.button.add=Ajout>
BSFLoggingLevel.NOLOGGING=0-Pas de consignation
BSFLoggingLevel.SOMELOGGING=1-Niveau de consignation faible 
BSFLoggingLevel.MORELOGGING=2-Niveau de consignation moyen
BSFLoggingLevel.LOTOFLOGGING=3-Niveau de consignation \u00e9lev\u00e9
DebugService.portchanged.info1=Les arguments de d\u00e9bogage JVM du service de d\u00e9bogage ont \u00e9t\u00e9 modifi\u00e9s pour \u00eatre synchronis\u00e9s avec le port de d\u00e9bogage sp\u00e9cifi\u00e9 pour le service de d\u00e9bogage
DebugService.portchanged.info2= Le port de d\u00e9bogage JVM du service de d\u00e9bogage a \u00e9t\u00e9 modifi\u00e9 pour \u00eatre synchronis\u00e9 avec les arguments de d\u00e9bogage JVM sp\u00e9cifi\u00e9s avec l'adresse

JMSServer.displayName=Serveurs JMS
JMSServer.description=Les fonctions JMS sur un noeud dans le domaine d'administration WebSphere Application Server sont servies par le serveur JMS sur ce noeud.  Utilisez ce panneau pour afficher ou modifier les propri\u00e9t\u00e9s de configuration du serveur JMS s\u00e9lectionn\u00e9.
JMSServer.smallIcon=JMSServer.gif
JMSServer.largeIcon=JMSServer32X32.gif
JMSServer.securityPort.displayName=Noeud final du port de s\u00e9curit\u00e9
JMSServer.securityPort.description=Num\u00e9ro de port TCP/IP du port d'\u00e9coute utilis\u00e9 en interne par le serveur JMS.
JMSServer.description.displayName=Description
JMSServer.description.description=Description du serveur JMS, \u00e0 des fins administratives.
JMSServer.numThreads.displayName=Nombre d'unit\u00e9s d'ex\u00e9cution
JMSServer.numThreads.description=Nombre d'unit\u00e9s d'ex\u00e9cution simultan\u00e9es utilis\u00e9 par le moteur de correspondance Publication/Abonnement.
JMSServer.queueNames.displayName=Noms des files d'attente
JMSServer.queueNames.description=Noms des files d'attente h\u00e9berg\u00e9es par ce serveur JMS.
JMSServer.must.be.selected=Vous devez s\u00e9lectionner au moins un serveur JMS pour effectuer cette op\u00e9ration.
jmsserver.cannot.be.started=Le serveur JMS ne peut pas \u00eatre d\u00e9marr\u00e9 car le service de messagerie int\u00e9gr\u00e9 n''a pas \u00e9t\u00e9 install\u00e9 sur le noeud {0}.
JMSTransport.displayName=Transport JMS
JMSTransport.description=
JMSTransport.smallIcon=JMSTransport.gif
JMSTransport.largeIcon=JMSTransport32X32.gif
EndPoint.displayName=Noeud final du port de s\u00e9curit\u00e9
EndPoint.description=Description du noeud final du port de s\u00e9curit\u00e9
EndPoint.host.displayName=H\u00f4te
EndPoint.host.description=Adresse IP, nom d'h\u00f4te DNS avec suffixe du nom de domaine ou nom d'h\u00f4te DNS utilis\u00e9 par un client pour demander une ressource d'application Web (tel qu'un servlet, une page JSP ou HTML).
EndPoint.port.displayName=Port
EndPoint.port.description=Port pour lequel le serveur Web a \u00e9t\u00e9 configur\u00e9 pour accepter les demandes client. Indiquez une valeur de port avec le nom d'h\u00f4te.

NameServer.displayName=Serveur de noms
NameServer.description=Param\u00e8tres du fournisseur de service de nommage du serveur d'applications
NameServer.smallIcon=NameServer.gif
NameServer.largeIcon=NameServer32X32.gif
NameServer.bootstrapServerAddress.displayName=Adresse du serveur d'amor\u00e7age
NameServer.bootstrapServerAddress.description=L'adresse du serveur d'amor\u00e7age est le noeud final pour le serveur d'amor\u00e7age du serveur de noms. Un noeud final comprend un nom d'h\u00f4te et un num\u00e9ro de port.  Le fait de nommer les clients permet de sp\u00e9cifier l'h\u00f4te et le port du serveur d'amor\u00e7age pour obtenir un contexte de nommage initial \u00e0 partir du serveur de noms associ\u00e9.

Service.type.displayName=Type de service
Service.type.description=Type de service.
nav.websphere.servers    
Domain.webcontainers.displayName=Conteneurs Web

webcontainer.description=Configuration du conteneur Web
webcontainer.detail.title=Conteneur Web
webcontainer.displayName=Conteneur Web
webcontainer.threadpool.displayName=Pool d'unit\u00e9s d'ex\u00e9cution
webcontainer.sessionmanager.displayName=Gestion de session
webcontainer.sessionmanager.description=Configure le gestionnaire de sessions associ\u00e9 \u00e0 ce conteneur Web.
webcontainer.httptransports.displayName=Transports HTTP
webcontainer.httptransports.description=Configure les transports HTTP associ\u00e9s \u00e0 ce conteneur Web
webcontainer.virtualhost.displayName=H\u00f4te virtuel par d\u00e9faut :
webcontainer.virtualhost.description=H\u00f4te virtuel par d\u00e9faut de ce serveur
webcontainer.enableServletCaching.displayName=Mise en cache de servlet
webcontainer.enableServletCaching.description=Active la mise en cache de servlet.
webcontainer.enableServletCaching.units=Activation de la mise en cache de servlet


ThreadPool.size.units=unit\u00e9s d'ex\u00e9cution
ThreadPool.inactivityTimeout.displayName=D\u00e9lai d'inactivit\u00e9 de l'unit\u00e9 d'ex\u00e9cution
ThreadPool.inactivityTimeout.units=millisecondes
ThreadPool.isGrowable.units=Permet d'allouer un nombre d'unit\u00e9s d'ex\u00e9cution d\u00e9passant la taille maximale autoris\u00e9e

SessionManager.sessionTracking.displayName=M\u00e9canisme de suivi de session :
SessionManager.displayName=Gestion de session
SessionManager.sessionDatabasePersistence.description=Sp\u00e9cifie les param\u00e8tres d'optimisation dans un environnement distribu\u00e9.
SessionManager.tuningParams.displayName=Param\u00e8tres de r\u00e9glage personnalis\u00e9s
SessionManager.description=Les propri\u00e9t\u00e9s de configuration du gestionnaire de sessions permettent de contr\u00f4ler le comportement d'un support de session HTTP.
SessionManager.sessionTracking.description=Sp\u00e9cifie un m\u00e9canisme pour le gestionnaire de sessions HTTP.
SessionManager.overflow.displayName=D\u00e9passement :
SessionManager.overflow.description=Indique si le nombre de sessions en m\u00e9moire peut d\u00e9passer la valeur sp\u00e9cifi\u00e9e par la propri\u00e9t\u00e9 Nombre maximal de sessions en m\u00e9moire. Cette propri\u00e9t\u00e9 n'est valide que pour le mode des sessions non persistantes.
SessionManager.overflow.units=Autoriser le d\u00e9passement
SessionManager.sessionCount.displayName=Nombre de sessions maximal en m\u00e9moire :
SessionManager.sessionCount.description=Sp\u00e9cifie le nombre maximal de sessions \u00e0 conserver en m\u00e9moire.
SessionManager.sessionTimeout.displayName=D\u00e9lai d'expiration de session
SessionManager.sessionTimeout.description=Dur\u00e9e pendant laquelle une session peut rester inutilis\u00e9e avant d'\u00eatre consid\u00e9r\u00e9e comme n'\u00e9tant plus valide.   Les valeurs possibles sont "D\u00e9finir le d\u00e9lai d'expiration" et "Aucun d\u00e9lai d'expiration". Si vous choisissez de d\u00e9finir le d\u00e9lai d'expiration, la valeur doit \u00eatre d'au moins deux minutes.
SessionManager.sessionTimeout.noTimeout=Aucun d\u00e9lai d'expiration
SessionManager.sessionTimeout.setTimeout=D\u00e9finir le d\u00e9lai d'expiration
SessionManager.sessionTimeout.units=minutes
SessionManager.sessionTracking.sslEnabled=Activer le suivi des ID SSL
SessionManager.sessionTracking.cookiesEnabled=Activer les cookies
SessionManager.sessionTracking.urlRewritingEnabled=Activer la r\u00e9\u00e9criture des URL
SessionManager.sessionTracking.protocolRewritingEnabled=Activer la r\u00e9\u00e9criture du changement de protocole
SessionManager.sessionCount.units=sessions
SessionManager.button.modify=Modifier...
SessionManager.defaultCookieSettings.displayName=Param\u00e8tres de cookie
SessionManager.persistence.displayName=Param\u00e8tres de l'environnement distribu\u00e9
SessionManager.persistence.description=D\u00e9termine le type de persistance des sessions.
SessionManager.serialAccess.displayName=S\u00e9rialiser l'acc\u00e8s aux sessions
SessionManager.serialAccess.description=La s\u00e9rialisation de l'acc\u00e8s aux sessions autorise ou non l'acc\u00e8s \u00e0 des sessions simultan\u00e9es dans un serveur donn\u00e9 (JVM).
SessionManager.serialAccess.units=Autoriser l'acc\u00e8s s\u00e9quentiel
SessionManager.maxWaitTime.displayName=Temps d'attente maximal
SessionManager.maxWaitTime.description=Description du temps d'attente maximal
SessionManager.maxWaitTime.units=secondes
SessionManager.accessOnTimeout.displayName=Acc\u00e8s \u00e0 la session \u00e0 l'expiration du d\u00e9lai
SessionManager.accessOnTimeout.description=Description du d\u00e9lai d'expiration
SessionManager.accessOnTimeout.units=Autoriser l'acc\u00e8s \u00e0 l'expiration du d\u00e9lai
SessionManager.enable.displayName=Remplacer la gestion des sessions
SessionManager.enable.description=Indique si les param\u00e8tres de ce gestionnaire de sessions doivent \u00eatre utilis\u00e9s pour le module en cours. Par d\u00e9faut, les param\u00e8tres du gestionnaire de sessions d\u00e9finis sur l'objet parent.
SessionManager.enable.units=Remplacer
SessionManager.securityIntegration.displayName=Int\u00e9gration de la s\u00e9curit\u00e9
SessionManager.securityIntegration.description=Si l'int\u00e9gration de la s\u00e9curit\u00e9 est activ\u00e9e, le gestionnaire de sessions associe l'identit\u00e9 des utilisateurs \u00e0 leurs sessions HTTP.
SessionManager.securityIntegration.units=Activation

Cookie.displayName=Cookies
Cookie.description=Sp\u00e9cifie les param\u00e8tres des cookies pour la gestion des sessions HTTP.
Cookie.secure.displayName=Cookies s\u00e9curis\u00e9s
Cookie.secure.units=Limiter les cookies aux sessions HTTPS
Cookie.domain.displayName=Domaine des cookies
Cookie.maximumAge.displayName=Age maximal des cookies
Cookie.path.displayName=Chemin du cookie
Cookie.name.displayName=Nom du cookie
Cookie.name.description=Nom unique du cookie \u00e0 utiliser pour la gestion des sessions.  La sp\u00e9cification du servlet exige que ce nom soit JSESSIONID. Toutefois, pour plus de souplesse, vous pouvez configurer cette valeur.
Cookie.secure.description=Indique si les cookies de session doivent inclure le champ "secure". L'activation de la fonctionnalit\u00e9 limite l'\u00e9change des cookies uniquement aux sessions HTTPS.
Cookie.domain.description=Valeur du champ sp\u00e9cifiant le nom de domaine dans un cookie de suivi de session. Cette valeur indique au navigateur si un cookie doit \u00eatre ou non envoy\u00e9 \u00e0 des serveurs sp\u00e9cifiques. Par exemple, si vous indiquez un domaine particulier, les cookies de session seront uniquement envoy\u00e9s aux h\u00f4tes de ce domaine. Le serveur constitue le domaine par d\u00e9faut.
Cookie.maximumAge.description=Dur\u00e9e de vie du cookie sur le navigateur client. Cette valeur correspond \u00e0 la valeur TTL (Time to Live) d\u00e9crite dans la sp\u00e9cification du cookie.  
Cookie.path.description=Ceci indique au navigateur si un cookie est envoy\u00e9 \u00e0 l'URI demand\u00e9, en fonction du chemin d'acc\u00e8s. La cha\u00eene sp\u00e9cifi\u00e9e doit repr\u00e9senter un chemin existant sur le serveur. "/" indique le r\u00e9pertoire racine.   Sp\u00e9cifiez une valeur afin de limiter le nombre de chemins auxquels le cookie est envoy\u00e9. Ainsi, vous pouvez \u00e9viter que le cookie soit envoy\u00e9 \u00e0 certaines adresses URL sur le serveur. Si vous sp\u00e9cifiez le r\u00e9pertoire racine, le cookie sera envoy\u00e9 quel que soit le chemin acc\u00e9d\u00e9 sur le serveur.
Cookie.age.browserSession=Session de navigateur en cours 
Cookie.age.maximumAge=D\u00e9finir l'age maximal
Cookie.age.units=secondes

Persistence.displayName=Sessions distribu\u00e9es
Persistence.description=Sp\u00e9cifie un type de sauvegarde d'une session dans un environnement distribu\u00e9.
Persistence.button.modify=Modifier...
Persistence.button.advanced=Avanc\u00e9...
Persistence.none=Aucune
Persistence.database=Base de donn\u00e9es
Persistence.messaging=R\u00e9plication de m\u00e9moire \u00e0 m\u00e9moire
Persistence.domain=Domaine de messagerie interne :

SessionManager.sessionDRSPersistence.displayName=Param\u00e8tres DRS
DRSSettings.both=Client et serveur
DRSSettings.bothpp=Push et Pull
DRSSettings.pull=Pull uniquement
DRSSettings.push=Push uniquement
DRSSettings.none=Non partag\u00e9
DRSSettings.client=Client uniquement
DRSSettings.server=Serveur uniquement
DRSSettings.replication.domainSelection=S\u00e9lectionnez le r\u00e9plicateur dans le domaine suivant :
DRSSettings.replication.replicators=R\u00e9plicateurs : 
DRSSettings.replication.otherDomain=S\u00e9lectionnez le r\u00e9plicateur dans un autre domaine
DRSSettings.replication.address=Adresse IP :
DRSSettings.replication.port=Port :
DRSSettings.replication.description=Permet de s\u00e9lectionner un r\u00e9plicateur \u00e0 utiliser pour la r\u00e9plication de m\u00e9moire \u00e0 m\u00e9moire.
DRSSettings.replication.displayName=R\u00e9plication :
DRSSettings.partition.displayName=Ecouter les ID partition :
DRSSettings.partition.description=Partitions sur lesquelles ce gestionnaire de sessions, lors de l'ex\u00e9cution d'un noeud de serveur, \u00e9coute la r\u00e9plication de sessions de m\u00e9moire \u00e0 m\u00e9moire.  Le nombre des partitions est d\u00e9fini dans les pages Gestion de la r\u00e9plication interne.  Par d\u00e9faut, toutes les partitions sont \u00e9cout\u00e9es.
DRSSettings.mode.displayName=Mode d'ex\u00e9cution :
DRSSettings.mode.description=Sp\u00e9cifie le mode selon lequel vous souhaitez que la r\u00e9plication des donn\u00e9es soit contr\u00f4l\u00e9e.
DRSSettings.frequency.displayName=Fr\u00e9quence d'insertion (Push)
DRSSettings.frequency.description=Sp\u00e9cifie la dur\u00e9e d'attente en secondes avant l'insertion des entr\u00e9es de cache nouvelles ou modifi\u00e9es sur d'autres serveurs.
DRSSettings.frequency.units=secondes
DRSSettings.messaging.displayName=Serveur de messagerie interne
DRSSettings.messaging.description=Sp\u00e9cifie un domaine \u00e0 partir duquel vos donn\u00e9es seront r\u00e9pliqu\u00e9es.
DRSSettings.noDomains.error=Aucun domaine de r\u00e9plication n'a \u00e9t\u00e9 d\u00e9fini


SessionDatabasePersistence.displayName=Param\u00e8tres de base de donn\u00e9es
SessionDatabasePersistence.description=Description des param\u00e8tres de base de donn\u00e9es
SessionDatabasePersistence.datasourceJNDIName.displayName=Nom JNDI de la source de donn\u00e9es :
SessionDatabasePersistence.datasourceJNDIName.description=Indique le nom JNDI de la source de donn\u00e9es \u00e0 partir de laquelle le gestionnaire de sessions obtient les connexions \u00e0 la base de donn\u00e9es.
SessionDatabasePersistence.userId.displayName=ID utilisateur :
SessionDatabasePersistence.userId.description=ID utilisateur permettant l'acc\u00e8s \u00e0 la base de donn\u00e9es.
SessionDatabasePersistence.password.displayName=Mot de passe :
SessionDatabasePersistence.password.description=Mot de passe permettant l'acc\u00e8s \u00e0 la base de donn\u00e9es.
SessionDatabasePersistence.password2.displayName=Confirmation :
SessionDatabasePersistence.password2.description=Entrez le mot de passe une seconde fois pour vous assurer qu'il est correctement enregistr\u00e9.
SessionDatabasePersistence.db2RowSize.displayName=Taille de ligne DB2 :
SessionDatabasePersistence.db2RowSize.description=Taille de page d'espace table configur\u00e9e pour la table des sessions, si vous utilisez une base de donn\u00e9es DB2. Les valeurs possibles sont 4, 8, 16 et 32 kilo-octets (ko). La taille de ligne par d\u00e9faut est 4 ko.
SessionDatabasePersistence.tableSpaceName.displayName=Nom de l'espace table :
SessionDatabasePersistence.tableSpaceName.description=Espace table \u00e0 utiliser pour la table des sessions.
SessionDatabasePersistence.multiRowSchema.displayName=Sch\u00e9ma multiligne
SessionDatabasePersistence.multiRowSchema.description=D\u00e9termine si chaque instance de donn\u00e9es d'application doit \u00eatre plac\u00e9e dans une ligne distincte de la base de donn\u00e9es.
SessionDatabasePersistence.multiRowSchema.units=Utiliser le sch\u00e9ma multiligne
SessionDatabasePersistence.passwords.match.error=Les mots de passe saisis sont diff\u00e9rents. Entrez de nouveau le mot de passe dans les deux zones.


Tuning.displayName=Param\u00e8tres d'optimisation
Tuning.description=Le gestionnaire de sessions offre diverses options de personnalisation pour la gestion des donn\u00e9es de session dans un environnement distribu\u00e9.
Tuning.level.displayName=Niveau d'optimisation :
Tuning.level.description=Le gestionnaire de sessions fournit certains param\u00e8tres pr\u00e9d\u00e9finis qui affectent les performances.
Tuning.setting.veryHigh=Tr\u00e8s \u00e9lev\u00e9e (optimise les performances)
Tuning.setting.high=Elev\u00e9e
Tuning.setting.medium=Moyenne
Tuning.setting.low=Faible (optimise la reprise de la base de donn\u00e9es)
Tuning.setting.custom=Param\u00e8tres personnalis\u00e9s
Tuning.button.modify=Modifier...

TuningParams.contents.all=Tous les attributs de session
TuningParams.contents.updated=Seuls les attributs mis \u00e0 jour
TuningParams.frequency.servlet=Fin du service de servlet
TuningParams.frequency.manual=Mise \u00e0 jour manuelle
TuningParams.frequency.units=secondes
TuningParams.frequency.timeBased=P\u00e9riodique :
TuningParams.database.displayName=Sp\u00e9cifie la planification du nettoyage des sessions distribu\u00e9es
TuningParams.database.first=Premi\u00e8re heure du jour (0 \u00e0 23) :
TuningParams.database.second=Seconde heure du jour (0 \u00e0 23) :
TuningParams.writeFrequency.displayName=Fr\u00e9quence d'\u00e9criture
TuningParams.writeContents.displayName=Ecriture s\u00e9lective
TuningParams.cleanup.displayName=Planification du nettoyage des sessions :
TuningParams.cleanup.description=Indique quand les sessions incorrectes doivent \u00eatre supprim\u00e9es de l'emplacement externe.

Transport.host.displayName=H\u00f4te
Transport.port.displayName=Port            
Transport.host.description=Sp\u00e9cifie l'adresse IP de l'h\u00f4te auquel associer le transport.
Transport.port.description=Sp\u00e9cifie le port auquel associer le transport. Indiquez un num\u00e9ro de port compris entre 1 et 65535. Le num\u00e9ro de port doit \u00eatre unique pour chaque instance de serveur d'applications sur une machine donn\u00e9e.
Transport.sslEnabled.units=Activer SSL

DynamicCache.startup.displayName=Etat au d\u00e9marrage :
DynamicCache.startup.description=Cliquez sur la case \u00e0 cocher pour activer le service de mise en cache dynamique au d\u00e9marrage du serveur.
DynamicCache.startup.units=Activer le service au d\u00e9marrage du serveur
DynamicCache.cacheSize.displayName=Taille de la cache
DynamicCache.defaultPriority.displayName=Priorit\u00e9 par d\u00e9faut
DynamicCache.diskoffload.displayName=D\u00e9chargement du disque :
DynamicCache.diskoffload.description=Par d\u00e9faut, la m\u00e9moire cache dynamique ne conserve que, au maximum, le nombre d'entr\u00e9es configur\u00e9 en m\u00e9moire. Si de nouvelles entr\u00e9es sont cr\u00e9\u00e9es alors que la m\u00e9moire cache est pleine, les priorit\u00e9s configur\u00e9es pour chaque entr\u00e9e de la cache, ainsi que l'algorithme utilis\u00e9 r\u00e9cemment, sont utilis\u00e9s pour supprimer les entr\u00e9es de la cache. Vous pouvez aussi configurer le d\u00e9chargement du disque et, plut\u00f4t que de supprimer les entr\u00e9es de la m\u00e9moire, les copier sur le syst\u00e8me de fichiers (l'emplacement peut \u00eatre configur\u00e9) et y acc\u00e9der ult\u00e9rieurement.
DynamicCache.diskoffload.enable=Activer le d\u00e9chargement du disque
DynamicCache.diskoffload.location=Emplacement du d\u00e9chargement :
DynamicCache.diskoffload.hashSize=Taille de hachage :
DynamicCache.cachereplication.displayName=R\u00e9plication de la cache :
DynamicCache.cachereplication.description=Permet d'activer la r\u00e9plication de la m\u00e9moire cache ici.
DynamicCache.cachereplication.enable=Activer la r\u00e9plication de la cache
DynamicCache.cachereplication.advanced=Avanc\u00e9...
DynamicCache.cacheGroups.displayName=Groupes de caches externes

ExternalCacheGroup.name.displayName=Nom
ExternalCacheGroup.type.displayName=Type
ExternalCacheGroup.displayName=Groupe de caches externes
ExternalCacheGroup.members.displayName=Membres du groupe de caches externes

ExternalCacheGroupMember.address.displayName=Adresse
ExternalCacheGroupMember.adapterBeanName.displayName=Nom du bean adaptateur

ObjectRequestBroker.displayName=Service ORB
ObjectRequestBroker.description=Param\u00e8tres de configuration de l'ORB
ObjectRequestBroker.smallIcon=ObjectRequestBroker.gif
ObjectRequestBroker.largeIcon=ObjectRequestBroker32X32.gif
ObjectRequestBroker.interceptors.displayName=intercepteurs
ObjectRequestBroker.interceptors.description=Liste des intercepteurs appel\u00e9s par l'ORB au cours de chaque demande IIOP.
ObjectRequestBroker.plugins.displayName=modules d'extension
ObjectRequestBroker.plugins.description=Liste des modules d'extension appel\u00e9s par l'ORB au cours de l'initialisation de celui-ci.
ObjectRequestBroker.lsdConnection.displayName=Connexion LSD
ObjectRequestBroker.lsdConnection.description=R\u00e9f\u00e9rence au d\u00e9mon du service de localisation, utilis\u00e9 si n\u00e9cessaire par l'ORB pour r\u00e9soudre les IOR indirects.
ObjectRequestBroker.threadPool.displayName=Pool d'unit\u00e9s d'ex\u00e9cution
ObjectRequestBroker.threadPool.description=Param\u00e8tres du pool d'unit\u00e9s d'ex\u00e9cution pour l'ORB.
ObjectRequestBroker.ssl.displayName=ssl
ObjectRequestBroker.ssl.description=Sp\u00e9cifie les param\u00e8tres SSL (Secure Socket Layer) du serveur.
ObjectRequestBroker.requestTimeout.displayName=D\u00e9lai d'expiration de la requ\u00eate
ObjectRequestBroker.requestTimeout.units=secondes
ObjectRequestBroker.requestTimeout.description=Nombre de secondes \u00e0 attendre avant l'expiration d'un message de demande.
ObjectRequestBroker.requestRetriesCount.displayName=Nombre de nouvelles tentatives de demande
ObjectRequestBroker.requestRetriesCount.units=nouvelles tentatives
ObjectRequestBroker.requestRetriesCount.description=Nombre de tentatives d'\u00e9mission d'une demande par l'ORB si un serveur est d\u00e9faillant. Une nouvelle tentative permet parfois la reprise sur incidents de r\u00e9seaux transitoires.
ObjectRequestBroker.requestRetriesDelay.displayName=Intervalle entre les tentatives de demande
ObjectRequestBroker.requestRetriesDelay.units=millisecondes
ObjectRequestBroker.requestRetriesDelay.description=Nombre de millisecondes entre chaque tentative de demande.
ObjectRequestBroker.connectionCacheMaximum.displayName=Taille maximale de la cache des connexions
ObjectRequestBroker.connectionCacheMaximum.units=connexions
ObjectRequestBroker.connectionCacheMaximum.description=Nombre maximal de connexions autoris\u00e9es \u00e0 occuper la cache de connexions du service.
ObjectRequestBroker.connectionCacheMinimum.displayName=Taille minimale de la cache des connexions
ObjectRequestBroker.connectionCacheMinimum.units=connexions
ObjectRequestBroker.connectionCacheMinimum.description=Nombre minimal de connexions autoris\u00e9es \u00e0 occuper la cache de connexions du service.
ObjectRequestBroker.commTraceEnabled.displayName=Tra\u00e7age de l'ORB
ObjectRequestBroker.commTraceEnabled.description=Tra\u00e7age des messages GIOP de l'ORB. Ce param\u00e8tre est ignor\u00e9 si le tra\u00e7age de l'ORB n'est pas activ\u00e9.
ObjectRequestBroker.locateRequestTimeout.displayName=D\u00e9lai d'expiration de la requ\u00eate de recherche
ObjectRequestBroker.locateRequestTimeout.description=Nombre de secondes \u00e0 attendre avant l'expiration d'un message de requ\u00eate de recherche.
ObjectRequestBroker.forceTunnel.displayName=Forcer le tunnel
ObjectRequestBroker.forceTunnel.description=Contr\u00f4le comment l'ORB client tente d'utiliser l'\u00e9tablissement de tunnels HTTP.
ForceTunnelMode.WHENREQUIRED=SI REQUIS
ForceTunnelMode.ALWAYS=TOUJOURS
ForceTunnelMode.NEVER=JAMAIS                             
ObjectRequestBroker.tunnelAgentURL.displayName=URL de l'agent tunnel
ObjectRequestBroker.tunnelAgentURL.description=URL du servlet utilis\u00e9 pour prendre en charge l'\u00e9tablissement de tunnels HTTP. Elle est requise uniquement si la valeur de la zone \"Forcer le tunnel\" est TOUJOURS ou SI REQUIS. Sinon, elle est ignor\u00e9e par l'ORB.
ObjectRequestBroker.noLocalCopies.displayName=Transmission par r\u00e9f\u00e9rence
ObjectRequestBroker.noLocalCopies.description=Si cette option est activ\u00e9e, elle indique que l'ORB doit transmettre les param\u00e8tres par r\u00e9f\u00e9rence et non par valeur, omettant ainsi l'op\u00e9ration de copie. Activez cette propri\u00e9t\u00e9 avec pr\u00e9caution, car un comportement inattendu peut se produire.
ObjectRequestBroker.externalConfigURL.displayName=URL de configuration externe
ObjectRequestBroker.externalConfigURL.description=Aucune description de cette propri\u00e9t\u00e9 n'\u00e9tait disponible.
ObjectRequestBroker.properties.description=Propri\u00e9t\u00e9s de personnalisation suppl\u00e9mentaires pour ce service pouvant \u00eatre configur\u00e9. Des propri\u00e9t\u00e9s ORB personnalis\u00e9es suppl\u00e9mentaires peuvent \u00eatre ajout\u00e9es dans ce panneau. Cependant, il est fortement recommand\u00e9 de ne pas modifier, ni supprimer l'une des valeurs par d\u00e9faut d\u00e9finie au cours de l'installation du produit, \u00e0 moins que cela ne vous soit demand\u00e9 par le support technique IBM.
ORBPlugin.displayName=Module d'extension ORB
ORBPlugin.description=Un code personnalis\u00e9 peut \u00eatre sp\u00e9cifi\u00e9 pour \u00e9tendre l'ORB.  Un plug-in capture la classe qui contient la logique personnalis\u00e9e.  Au cours de l'initialisation du serveur, ce dernier prend le nom du plug-in, com.ibm.CORBA.ORBPluginClass.XXX
ORBPlugin.smallIcon=ORBPlugin.gif
ORBPlugin.largeIcon=ORBPlugin32X32.gif
ORBPlugin.name.displayName=nom
ORBPlugin.name.description=Nom de classe ***non qualifi\u00e9*** d'un plug-in \u00e0 charger et \u00e0 initialiser.
Interceptor.displayName=Intercepteur
Interceptor.description=Les intercepteurs sont appel\u00e9s par l'ORB pendant chaque demande IIOP.
Interceptor.smallIcon=Interceptor.gif
Interceptor.largeIcon=Interceptor32X32.gif
Interceptor.name.displayName=nom
Interceptor.name.description=Nom de classe d'intercepteur.
LSDConnection.displayName=Connexion LSD
LSDConnection.description=Sp\u00e9cifie les propri\u00e9t\u00e9s utilis\u00e9es pour se connecter au d\u00e9mon de service de localisation.  Un LSD est un serveur, \u00e0 l'\u00e9coute sur un port fixe qui traite les demandes de localisation de r\u00e9f\u00e9rences d'objet persistant et redirige les clients au serveur d'applications appropri\u00e9.  Pour la configuration du processus serveur LSD, reportez-vous au serveur d\u00e9mon du service de localisation (LocationServiceDaemonServer).
LSDConnection.smallIcon=LSDConnection.gif
LSDConnection.largeIcon=LSDConnection32X32.gif
LSDConnection.endPoint.displayName=Noeud final
LSDConnection.endPoint.description=
LSDConnection.mode.displayName=mode
LSDConnection.mode.description=Mode du d\u00e9mon de service de localisation.
LSDMode.NONE=NONE
LSDMode.IMPLICIT_CLIENT=IMPLICIT_CLIENT
LSDMode.EXPLICIT_CLIENT=EXPLICIT_CLIENT
LSDMode.PROVIDER=PROVIDER

Server.errorStreamRedirect.displayName=Erreur de r\u00e9acheminement du flux
Server.errorStreamRedirect.description=Param\u00e8tres de r\u00e9acheminement du flux pour le fichier System.err
Server.outputStreamRedirect.displayName=R\u00e9acheminement du flux de sortie
Server.outputStreamRedirect.description=Param\u00e8tres de r\u00e9acheminement du flux pour le fichier System.out
Server.clusterName.displayName=Nom du cluster
Server.clusterName.description=Sp\u00e9cifie le nom du cluster si le serveur fait partie d'une grappe.
Server.modelId.displayName=ID mod\u00e8le
Server.modelId.description=
StreamRedirect.displayName= R\u00e9acheminement du flux
StreamRedirect.description=Sp\u00e9cifie les param\u00e8tres de r\u00e9acheminement des flux d'entr\u00e9e-sortie Java standard.
StreamRedirect.smallIcon=StreamRedirect.gif
StreamRedirect.largeIcon=StreamRedirect32X32.gif
StreamRedirect.fileName.displayName=Nom de fichier
StreamRedirect.fileName.description=Indique le nom du fichier vers lequel le flux doit \u00eatre redirig\u00e9.
StreamRedirect.rolloverType.displayName=Type de renvoi
StreamRedirect.rolloverType.description=Indique quel est le type d'algorithme de renvoi effectif.
StreamRedirect.maxNumberOfBackupFiles.displayName=Nombre maximal de fichiers de sauvegarde
StreamRedirect.maxNumberOfBackupFiles.description=Nombre de fichiers archives.
StreamRedirect.rolloverSize.displayName=Taille de renvoi
StreamRedirect.rolloverSize.description=Indique la taille en m\u00e9gaoctets pour le renvoi bas\u00e9 sur la taille.
StreamRedirect.baseHour.displayName=Heure de base
StreamRedirect.baseHour.description=Indique les heures auxquelles le renvoi bas\u00e9 sur l'heure doit commencer.
StreamRedirect.rolloverPeriod.displayName=P\u00e9riode de renvoi
StreamRedirect.rolloverPeriod.description=Indique la p\u00e9riode de renvoi bas\u00e9 sur l'heure.
StreamRedirect.formatWrites.displayName=Formatage des \u00e9critures
StreamRedirect.formatWrites.description=Indique si les \u00e9critures doivent \u00eatre format\u00e9es en tant qu'entr\u00e9es de journal WebSphere.
StreamRedirect.messageFormatKind.displayName=Type de format de message
StreamRedirect.messageFormatKind.description=Format souhait\u00e9 pour les messages. Les valeurs valides incluent de base et avanc\u00e9. La valeur par d\u00e9faut est de base.
StreamRedirect.suppressWrites.displayName=Suppression des \u00e9critures
StreamRedirect.suppressWrites.description=Indique si les \u00e9critures sur ce flux doivent \u00eatre supprim\u00e9es.
StreamRedirect.suppressStackTrace.displayName=Suppression des traces de pile
StreamRedirect.suppressStackTrace.description=Indique si les traces de pile contenues dans les messages doivent \u00eatre remplac\u00e9es par le message de l'exception uniquement. La valeur par d\u00e9faut est false (pas de suppression)
ManagedObject.displayName=Objet g\u00e9r\u00e9
ManagedObject.description=Repr\u00e9sente la configuration d'un objet g\u00e9rable par un processus agent.
ManagedObject.smallIcon=ManagedObject.gif
ManagedObject.largeIcon=ManagedObject32X32.gif
ManagedObject.stateManagement.displayName=Gestion de l'\u00e9tat
ManagedObject.statisticsProvider.displayName=Fournisseur de statistiques
ManagedObject.statisticsProvider.description=Capacit\u00e9 de la ressource g\u00e9r\u00e9e \u00e0 g\u00e9n\u00e9rer des mesures de performances.
server.stop.title=Arr\u00eat du serveur
server.stop.warning1=Le serveur ex\u00e9cute l'application d'administration.
server.stop.warning2=Si vous arr\u00eatez le serveur, vous serez d\u00e9connect\u00e9 de la session HTTP en cours et vous ne pourrez plus utiliser cette instance de la console d'administration.
server.stop.warning3=Red\u00e9marrez le serveur pour utiliser la console d'administration. Si la s\u00e9curit\u00e9 est activ\u00e9e, il se peut que votre navigateur puisse se connecter la prochaine fois sans autre intervention, \u00e0 condition que le cookie LTPA soit toujours valide.  Comme le cookie LTPA est de type SSO (single-signon pour une utilisateur multi-serveurs), il n'est pas supprim\u00e9 de votre navigateur lors de la d\u00e9connexion de la console d'administration.
goodbye.title=Au revoir
goodbye.message1=Merci d'utiliser la console d'administration WebSphere.
Server.services.PMIService.displayName=Service de contr\u00f4le des performances
Server.services.PMIService.description=Sp\u00e9cifie les param\u00e8tres relatifs au contr\u00f4le des performances, comme l'activation du contr\u00f4le des performances, la s\u00e9lection du module PMI et la d\u00e9finition des niveaux de contr\u00f4le.
PMIService.displayName=Service de contr\u00f4le des performances
PMIService.description=Param\u00e8tres de configuration et d'ex\u00e9cution de PMI (Performance Monitoring Infrastructure)
PMIService.smallIcon=PMIService.gif
PMIService.largeIcon=PMIService32X32.gif
PMIService.initialSpecLevel.displayName=Niveau de sp\u00e9cification initial
PMIService.initialSpecLevel.description=Cha\u00eene de sp\u00e9cification PMI (Performance Monitoring Infrastructure) qui stocke les niveaux de sp\u00e9cification PMI de tous les composants du serveur. Les niveaux N, L,M, H, X correspondent respectivement \u00e0 Aucun, Faible, Moyen, Elev\u00e9, Maximal.
PMIService.modules=Modules PMI
PMIService.monitoringLevel=Echelle de contr\u00f4le
PMIService.specification=Sp\u00e9cifications
PMIService.mbean.notFound=Impossible de d\u00e9tecter les param\u00e8tres de contr\u00f4le des performances. V\u00e9rifiez que le service de contr\u00f4le des performances est activ\u00e9 pour ce serveur.
PMIService.invalidSetting=Le param\u00e8tre pour ce module n'\u00e9tait pas valide.
PMIService.thevalidSettings=Entrez N (Aucun), L (Faible), M (Moyen), H (Elev\u00e9) ou X (Maximal).
PMIService.LevelNone=Aucun - Tous les modules ci-apr\u00e8s sont associ\u00e9s au niveau &quot;N&quot; (Aucun).
PMIService.LevelStandard=Standard - Tous les modules ci-apr\u00e8s sont associ\u00e9s au niveau &quot;H&quot; (Elev\u00e9)
PMIService.LevelCustom=Personnalis\u00e9 - Vous pouvez modifier, ajouter ou supprimer les modules dans la liste ci-dessous.


distmanagement.appserver.create.new=Cr\u00e9e un serveur d'applications
distmanagement.appserver.create.new.description=Cr\u00e9e un serveur d'applications
appserver.new.step1=S\u00e9lection d'un mod\u00e8le de serveur d'applications
appserver.new.step2=S\u00e9lection d'un noeud
appserver.new.step3=Confirmation du serveur d'applications
distmanagement.button.edit=Editer
appserver.selectAppServer.msg1=Vous pouvez s\u00e9lectionner un serveur d'applications existant comme mod\u00e8le du nouveau ou utiliser le mod\u00e8le de serveur d'applications par d\u00e9faut.
appserver.selectAppServer.msg3=S\u00e9lectionner un noeud
appserver.selectAppServer.msg4=Afficher des informations suppl\u00e9mentaires relatives \u00e0 cette \u00e9tape
appserver.selectAppServer.msg5=Le noeud s\u00e9lectionn\u00e9 lors de cette \u00e9tape d\u00e9termine les processus serveur disponibles parmi lesquels un choix doit \u00eatre fait \u00e0 l'\u00e9tape suivante.
appserver.selectAppServer.msg6=Nom logique du serveur. Ce nom doit \u00eatre unique dans la cellule.
appserver.selectAppServer.msg7=S\u00e9lectionner un mod\u00e8le
appserver.selectAppServer.msg8=Serveur d'applications existant
appserver.selectAppServer.msg9=L'utilisation d'un serveur d'applications existant comme mod\u00e8le revient \u00e0 copier la configuration pour le serveur s\u00e9lectionn\u00e9.
appserver.selectAppServer.msg10=Mod\u00e8le de serveur d'applications par d\u00e9faut.
appserver.selectAppServer.errormsg1=Le nom du serveur est requis.
appserver.selectAppServer.errormsg2={0} existe dans le noeud {1}
appserver.selectAppServer.copyApps1=Mapper des applications 
appserver.selectAppServer.copyApps2=Mapper des applications \u00e0 partir du mod\u00e8le de serveur existant
appserver.selectAppServer.copyApps3=Cette option s'applique uniquement lorsque vous s\u00e9lectionnez "Serveur d'applications existants" comme mod\u00e8le. Lorsque vous la s\u00e9lectionnez, les applications pr\u00e9c\u00e9demment install\u00e9es et mapp\u00e9es afin de s'ex\u00e9cuter sur le serveur source seront automatiquement mapp\u00e9es pour s'ex\u00e9cuter sur le nouveau serveur \u00e9galement, et toute information de liaison (telle que les attributions d'utilisateurs et de groupes) seront conserv\u00e9es. Il ne s'agit pas d'installer les m\u00eames fichiers binaires des applications sur le nouveau serveur sous un nom d'application diff\u00e9rent. Dans ce cas, une copie distincte des informations de liaison pour l'application serait conserv\u00e9e.
generate.unique.ports=G\u00e9n\u00e9rer des ports HTTP uniques
generate.unique.ports.desc=G\u00e9n\u00e8re des num\u00e9ros de port uniques pour chaque transport HTTP d\u00e9fini sur le serveur source, afin que le serveur cr\u00e9\u00e9 ne poss\u00e8de pas de transports HTTP incompatibles avec le serveur d'origine ou tout autre serveur d\u00e9fini sur le m\u00eame noeud.
generate.unique.ports.label=Ports HTTP
appserver.selectAppServer.serverName=Nom du serveur
appserver.confirmAppServer.msg1=R\u00e9sum\u00e9 de vos s\u00e9lections. Cliquez sur le bouton Terminer pour achever la cr\u00e9ation du serveur d'applications.
appserver.confirmAppServer.msg2=Si vous souhaitez modifier des param\u00e8tres, cliquez sur le bouton Pr\u00e9c\u00e9dent pour r\u00e9viser les param\u00e8tres du serveur.
appserver.confirmAppServer.msg3=Les actions suivantes vont \u00eatre achev\u00e9es :
appserver.confirmAppServer.msg4=Le nouveau serveur d''applications \"{0}\" sera cr\u00e9\u00e9 sur le noeud \"{1}\" dans un nouveau processus serveur.
appserver.confirmAppServer.msg7=Probl\u00e8mes possibles dus \u00e0 cette action
appserver.confirmAppServer.msg8=V\u00e9rifiez que le noeud \"{0}\" dispose de suffisamment de m\u00e9moire pour prendre en charge plusieurs processus. Si la m\u00e9moire n'est pas suffisante, les performances seront affaiblies.
appserver.createAppServer.msg1=Le serveur a \u00e9t\u00e9 cr\u00e9\u00e9.
appserver.createAppServer.msg2=Modifiez les variables, les ressources, ainsi que d'autres param\u00e8tres de configuration du serveur, tels que les noms de files d'attente de l'ORB des messages avant d'ex\u00e9cuter le nouveau serveur.
ensure.unique.httpports=Assurez-vous que les ports HTTP sont uniques pour le noeud avant de d\u00e9marrer le serveur.
error.create.server=Une erreur s'est produite pendant la cr\u00e9ation du serveur.

application.server.already.started={0} a d\u00e9j\u00e0 \u00e9t\u00e9 d\u00e9marr\u00e9
node.agent.not.active=L''agent de noeud sur le noeud {0} n''est pas actif. Le serveur ne peut pas \u00eatre d\u00e9marr\u00e9. 
synch.server.before.start=La configuration du serveur a \u00e9t\u00e9 modifi\u00e9e. Vous devez sauvegarder la configuration sur le r\u00e9f\u00e9rentiel ma\u00eetre avant de d\u00e9marrer le serveur. 
object.must.be.selected=Vous devez s\u00e9lectionner au moins un serveur d'applications pour effectuer cette action.
application.server.not.started={0} n''a pas \u00e9t\u00e9 d\u00e9marr\u00e9
could.not.stop.server=Une erreur s''est produite lors de l''arr\u00eat de {0}. Pour plus d''informations, consultez les journaux des erreurs.
server.started.successfully={0} serveur(s) d\u00e9marr\u00e9(s)
server.view.jvm.logs1=Consultez les journaux de la JVM</a> pour plus de d\u00e9tails.
could.not.start.server={0} serveur(s) non d\u00e9marr\u00e9(s)
server.stopped.successfully={0} serveur(s) arr\u00eat\u00e9(s)
server.should.be.stopped=Arr\u00eat de tous les serveurs \u00e0 supprimer
deleteserver.page.title=Suppression de serveur 
deleteserver.page.msg1=Cliquez sur le bouton OK ci-dessous pour supprimer le(s) serveur(s) suivant(s). Si vous ne souhaitez pas le(s) supprimer, cliquez sur le bouton ANNULER pour retourner \u00e0 la page pr\u00e9c\u00e9dente.
error.createmq=createmq n'a pas pu \u00eatre ex\u00e9cut\u00e9. Par cons\u00e9quent, JMSServer ne pourra pas d\u00e9marrer
error.deletemq=L'op\u00e9ration deleteemq a \u00e9chou\u00e9
NodeAgent.not.found=Le syst\u00e8me n'a pas pu contacter le processus pour arr\u00eater le serveur. V\u00e9rifiez que le serveur est arr\u00eat\u00e9 avant de le supprimer. 
nodes.not.present=Aucun noeud ne prend en charge les serveurs d'applications dans la configuration.  Utilisez la commande addNode \u00e0 partir de <a \
href="navigatorCmd.do?forwardName=Node.content.main">Collection de noeuds</a> ou \u00e0 partir de la ligne de commande avant de cr\u00e9er un nouveau serveur d'applications.

ExecutionState.PARTIAL_STOP=Arr\u00eat partiel
ExecutionState.PARTIAL_START=D\u00e9marrage partiel
ExecutionState.STOPPING=Arr\u00eat...
ExecutionState.STARTING=D\u00e9marrage...



NamedEndPoint.displayName=Noeuds finaux
NamedEndPoint.description=Configure les ports TCP/IP essentiels que ce serveur utilise pour les connexions.
NamedEndPoint.smallIcon=NamedEndPoint.gif
NamedEndPoint.largeIcon=NamedEndPoint32X32.gif
NamedEndPoint.endPoint.displayName=Noeud final
NamedEndPoint.endPoint.description=
NamedEndPoint.endPointName.displayName=Nom du noeud final
NamedEndPoint.endPointName.description=
NamedEndPoints.not.available=Aucun noeud final n'est disponible pour \u00eatre configur\u00e9.
SystemMessageServer.displayName=Serveur de messagerie du syst\u00e8me
AppServer.displayName=Serveur d'applications

Server.productInfo.displayName=Informations sur le produit
Server.productInfo.description=Informations produit relatives \u00e0 cette installation de WebSphere Application Server
ProductInfo.components.dislayName=Composants
ProductInfo.components.description=Composants install\u00e9s sur le syst\u00e8me actuel
ProductInfo.extensions.dislayName=Extensions
ProductInfo.extensions.description=Extensions install\u00e9es sur le syst\u00e8me actuel
ProductInfo.eFixes.dislayName=Correctifs
ProductInfo.eFixes.description=Correctifs install\u00e9s sur le syst\u00e8me actuel
ProductInfo.product.name=Nom du produit
ProductInfo.product.id=ID
ProductInfo.product.version=Version
ProductInfo.product.buildDate=Date de compilation
ProductInfo.product.buildLevel=Niveau de compilation
ProductInfo.product.buildversion=Version de compilation
ProductInfo.product.builddate=Date de compilation
ProductInfo.component.name=Nom du composant
ProductInfo.component.specversion=Version de sp\u00e9cification
ProductInfo.extension.name=Nom de l'extension
ProductInfo.efix.id=ID du correctif
ProductInfo.efix.buildversion=Version de compilation
ProductInfo.efix.buildDate=Date de compilation
ProductInfo.efix.components=Composants
ProductInfo.efix.prereq=Conditions requises
ProductInfo.efix.coreq=Conditions corequises            
ProductInfo.ptfs.dislayName=PTF
ProductInfo.ptfs.description=PTF install\u00e9es sur le syst\u00e8me en cours
ProductInfo.ptf.id=ID de la PTF
ProductInfo.ptf.products=Produits
ProductInfo.productReport.dislayName=Rapport sur le produit
ProductInfo.productReport.description=Affiche un rapport d\u00e9taill\u00e9 sur l'\u00e9tat en cours du syst\u00e8me.
ProductInfo.historyReport.dislayName=Rapport sur l'historique
ProductInfo.historyReport.description=Affiche un rapport historique d\u00e9taill\u00e9 relatif aux informations produit.
Data.not.present=Aucune

accessibility.needs=Les utilisateurs handicap\u00e9s peuvent cliquer sur l'image pour obtenir le statut
