# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#CMVCPATHNAME ws/code/webui.servermanagement/src/servermanagement/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE
#

nav.webSphere.servermanagement.configuration=\u30b5\u30fc\u30d0\u30fc
nav.webSphere.servers=\u30b5\u30fc\u30d0\u30fc
nav.view.ApplicationServer=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc
nav.view.JMSServer=JMS \u30b5\u30fc\u30d0\u30fc
Server.node.displayName=Node
Server.node.description=Node
Server.status.displayName=\u72b6\u6cc1
Server.status.description=\u72b6\u6cc1
ExecutionState.STARTED=\u958b\u59cb
ExecutionState.STOPPED=\u505c\u6b62
ExecutionState.UNAVAILABLE=\u4f7f\u7528\u4e0d\u53ef
attribute.not.found=JMX \u30a8\u30e9\u30fc: \u5c5e\u6027\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f 
Server.type.displayName=\u578b
Server.type.description=\u30b5\u30fc\u30d0\u30fc\u306e\u30bf\u30a4\u30d7\u3002
Server.mbean.pid.displayName=\u30d7\u30ed\u30bb\u30b9 ID
Server.mbean.pid.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3059\u308b\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306e\u30d7\u30ed\u30bb\u30b9 ID\u3002
Server.mbean.cellName.displayName=\u30bb\u30eb\u540d
Server.mbean.cellName.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u7a3c\u52d5\u3057\u3066\u3044\u308b\u30bb\u30eb\u306e\u540d\u524d\u3002
Server.mbean.nodeName.displayName=\u30ce\u30fc\u30c9\u540d
Server.mbean.nodeName.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u7a3c\u52d5\u3057\u3066\u3044\u308b\u30ce\u30fc\u30c9\u306e\u540d\u524d\u3002
Server.mbean.state.displayName=\u72b6\u614b
Server.mbean.state.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u5b9f\u884c\u6642\u306e\u5b9f\u884c\u72b6\u614b\u3002
ServerManagement.logsAndTrace.displayName=\u30ed\u30ae\u30f3\u30b0\u304a\u3088\u3073\u30c8\u30ec\u30fc\u30b9
ServerManagement.logsAndTrace.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3059\u308b\u30ed\u30ae\u30f3\u30b0\u304a\u3088\u3073\u30c8\u30ec\u30fc\u30b9\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ServerManagement.RASLoggingService.displayName=IBM \u4fdd\u5b88\u30ed\u30b0
ServerManagement.RASLoggingService.description=IBM \u4fdd\u5b88\u30ed\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002\u3053\u308c\u306f\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u30fc\u30fb\u30ed\u30b0\u3068\u3082\u547c\u3070\u308c\u307e\u3059\u3002 
ServerManagement.TraceService.displayName=\u8a3a\u65ad\u30c8\u30ec\u30fc\u30b9\u30fb\u30b5\u30fc\u30d3\u30b9
ServerManagement.TraceService.description=\u8a3a\u65ad\u30c8\u30ec\u30fc\u30b9\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8868\u793a\u304a\u3088\u3073\u5909\u66f4\u3057\u307e\u3059\u3002

task.manage.server=\u30ed\u30fc\u30ab\u30eb\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u7ba1\u7406

TransactionService.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9
TransactionService.description=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u306f\u3001\u8907\u6570\u306e\u30ea\u30bd\u30fc\u30b9\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306b\u5bfe\u3059\u308b\u66f4\u65b0\u3092\u8abf\u6574\u3057\u3066\u3001\u30c7\u30fc\u30bf\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u30a2\u30c8\u30df\u30c3\u30af\u66f4\u65b0\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u307e\u305f\u306f\u305d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u3066\u3044\u308b\u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u3088\u3063\u3066\u59cb\u52d5\u304a\u3088\u3073\u7d42\u4e86\u3055\u308c\u308b\u3053\u3068\u3092\u4fdd\u8a3c\u3067\u304d\u308b\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3067\u3059\u3002
TransactionService.smallIcon=TransactionService.gif
TransactionService.largeIcon=TransactionService32X32.gif
TransactionService.transactionLogDirectory.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc
TransactionService.transactionLogDirectory.description=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u304c\u30ea\u30ab\u30d0\u30ea\u30fc\u7528\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u7ba1\u3059\u308b\u3001\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u306e\u69cb\u6210\u306b\u3042\u308b\u30d6\u30e9\u30f3\u30af\u5024\u306f\u3001\u59cb\u52d5\u6642\u306b\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30ed\u30b0\u306b\u3088\u3063\u3066\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc (install_root)/tranlog/(server_name) \u306b\u5c55\u958b\u3055\u308c\u307e\u3059\u3002
TransactionService.totalTranLifetimeTimeout.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5b58\u7d9a\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
TransactionService.totalTranLifetimeTimeout.description=\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u304a\u3051\u308b\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u6700\u5927\u671f\u9593 (\u79d2\u5358\u4f4d)\u3002 \u3053\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3088\u308a\u524d\u306b\u5b8c\u4e86\u3059\u308b\u3088\u3046\u8981\u6c42\u3055\u308c\u3066\u3044\u306a\u3044\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306f\u3001\u3059\u3079\u3066\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3055\u308c\u307e\u3059\u3002
TransactionService.clientInactivityTimeout.displayName=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u975e\u6d3b\u52d5\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
TransactionService.clientInactivityTimeout.description=\u30ea\u30e2\u30fc\u30c8\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304b\u3089\u306e\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u8981\u6c42\u9593\u306e\u6700\u5927\u671f\u9593 (\u79d2\u5358\u4f4d)\u3002 \u3053\u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u3092\u8d85\u3048\u308b\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u975e\u6d3b\u52d5\u671f\u9593\u304c\u3042\u3063\u305f\u5834\u5408\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306f\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u30ed\u30fc\u30eb\u30d0\u30c3\u30af\u3055\u308c\u307e\u3059\u3002
TransactionService.enableLoggingForHeuristicReporting.displayName=enableLoggingForHeuristicReporting
TransactionService.enableLoggingForHeuristicReporting.description=\u30d2\u30e5\u30fc\u30ea\u30b9\u30c6\u30a3\u30c3\u30af\u30fb\u30ec\u30dd\u30fc\u30c8 (EEx \u8ffd\u52a0\u30d1\u30c3\u30b1\u30fc\u30b8\u3067\u5229\u7528\u3067\u304d\u308b\u62e1\u5f35\u6a5f\u80fd) \u306e\u30ed\u30ae\u30f3\u30b0\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002 1 \u30d5\u30a7\u30fc\u30ba\u30fb\u30ea\u30bd\u30fc\u30b9\u304c 2 \u30d5\u30a7\u30fc\u30ba\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u52a0\u308f\u308c\u308b\u3088\u3046\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u969c\u5bb3\u3067\u767a\u751f\u3059\u308b\u30d2\u30e5\u30fc\u30ea\u30b9\u30c6\u30a3\u30c3\u30af\u306a\u7d50\u679c\u3092\u30ec\u30dd\u30fc\u30c8\u3059\u308b\u306b\u306f\u3001\u8ffd\u52a0\u306e\u30c7\u30fc\u30bf\u304c\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30ed\u30b0\u306b\u66f8\u304d\u8fbc\u307e\u308c\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002  \u4f7f\u7528\u53ef\u306e\u5834\u5408\u30011 \u30d5\u30a7\u30fc\u30ba\u30fb\u30ea\u30bd\u30fc\u30b9\u304a\u3088\u3073 2 \u30d5\u30a7\u30fc\u30ba\u30fb\u30ea\u30bd\u30fc\u30b9\u306e\u4e21\u65b9\u306b\u304b\u304b\u308f\u308b\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u3064\u3044\u3066\u3001\u8ffd\u52a0\u3067 1 \u3064\u306e\u30ed\u30b0\u66f8\u304d\u8fbc\u307f\u304c\u5b9f\u884c\u3055\u308c\u307e\u3059\u3002  1 \u30d5\u30a7\u30fc\u30ba\u30fb\u30ea\u30bd\u30fc\u30b9\u306b\u304b\u304b\u308f\u3089\u306a\u3044\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306b\u3064\u3044\u3066\u306f\u3001\u8ffd\u52a0\u306e\u30ec\u30b3\u30fc\u30c9\u306f\u66f8\u304d\u8fbc\u307e\u308c\u307e\u305b\u3093\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8 =false
TransactionService.mbean.transactionLogDirectory.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30ed\u30b0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc
TransactionService.mbean.transactionLogDirectory.description=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u304c\u30ea\u30ab\u30d0\u30ea\u30fc\u306e\u305f\u3081\u306b\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u4fdd\u7ba1\u3059\u308b\u3001\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u7528\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TransactionService.mbean.totalTranLifetimeTimeout.displayName=\u5408\u8a08\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u5b58\u7d9a\u6642\u9593\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
TransactionService.mbean.totalTranLifetimeTimeout.description=
TransactionService.mbean.clientInactivityTimeout.displayName=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u975e\u6d3b\u52d5\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
TransactionService.mbean.clientInactivityTimeout.description=
Transaction.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u7ba1\u7406
Transaction.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u73fe\u5728\u30a2\u30af\u30c6\u30a3\u30d6\u306b\u306a\u3063\u3066\u3044\u308b\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u3092\u7ba1\u7406\u3057\u307e\u3059\u3002
Transaction.localId.displayName=\u30ed\u30fc\u30ab\u30eb ID
Transaction.status.displayName=\u72b6\u6cc1 
Transaction.globalId.displayName=\u30b0\u30ed\u30fc\u30d0\u30eb ID
button.transactionlist=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u306e\u7ba1\u7406
Transaction.noactivetransaction.exists=\u30b5\u30fc\u30d0\u30fc\u4e0a\u306b\u30a2\u30af\u30c6\u30a3\u30d6\u306a\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u3042\u308a\u307e\u305b\u3093\u3002
jmx.malformedobject.error=\u30bf\u30a4\u30d7 {0} \u306e MBean \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
jmx.instancenotfound.error=\u30bf\u30a4\u30d7 {1} \u306e MBean \u306b\u5bfe\u3059\u308b\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3 {0} \u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002

ApplicationServer.installedApps.displayName=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
ApplicationServer.installedApps.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u7ba1\u7406\u3057\u307e\u3059\u3002

ApplicationServer.displayName=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc
ApplicationServer.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3068\u306f\u3001\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u306e\u306b\u5fc5\u8981\u306a\u30b5\u30fc\u30d3\u30b9\u3092\u63d0\u4f9b\u3059\u308b\u30b5\u30fc\u30d0\u30fc\u3067\u3059\u3002
ApplicationServer.name.displayName=\u540d\u524d
ApplicationServer.name.description=\u30b5\u30fc\u30d0\u30fc\u306e\u8868\u793a\u540d\u3002
ApplicationServer.smallIcon=ApplicationServer.gif
ApplicationServer.largeIcon=ApplicationServer32X32.gif
ApplicationServer.locationServiceDaemon.displayName=locationServiceDaemon
ApplicationServer.locationServiceDaemon.description=
ApplicationServer.components.DynamicCache.displayName=\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30fc\u30d3\u30b9
ApplicationServer.components.DynamicCache.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ApplicationServer.applicationServerServices.displayName=applicationServerServices
ApplicationServer.applicationServerServices.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u6709\u52b9\u7bc4\u56f2\u3068\u3057\u305f\u30b5\u30fc\u30d3\u30b9\u3002  \u6d3e\u751f: Container \u30b9\u30fc\u30d1\u30fc\u30af\u30e9\u30b9\u304b\u3089\u7d99\u627f\u3055\u308c\u308b\u30b5\u30fc\u30d3\u30b9\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ApplicationServer.applicationServerServices.TransactionService.displayName=\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9
ApplicationServer.applicationServerServices.TransactionService.description=\u30a2\u30af\u30c6\u30a3\u30d6\u30fb\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30ed\u30c3\u30af\u3092\u7ba1\u7406\u3059\u308b\u306e\u3068\u540c\u69d8\u306b\u3001\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ApplicationServer.components.WebContainer.displayName=Web \u30b3\u30f3\u30c6\u30ca\u30fc
ApplicationServer.components.WebContainer.description= \u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u3068\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u307e\u305f\u3001\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3084\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306a\u3069\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u8a2d\u5b9a\u3068\u3001HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ApplicationServer.components.EJBContainer.displayName=EJB \
\u30b3\u30f3\u30c6\u30ca\u30fc
ApplicationServer.components.EJBContainer.description=\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u3068\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u60c5\u5831\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Server.services.ObjectRequestBroker.displayName=ORB \u30b5\u30fc\u30d3\u30b9
Server.services.ObjectRequestBroker.description=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30ea\u30af\u30a8\u30b9\u30c8\u30fb\u30d6\u30ed\u30fc\u30ab\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ApplicationServer.id.displayName=ID
ApplicationServer.id.description=\u30b5\u30fc\u30d0\u30fc\u306b\u56fa\u6709\u306a ID \u3092\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
ApplicationServer.applicationClassLoaderPolicy.displayName=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 Classloader \u30dd\u30ea\u30b7\u30fc
ApplicationServer.applicationClassLoaderPolicy.description=\u3059\u3079\u3066\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3057\u3066\u5358\u4e00 Classloader \u304c\u3042\u308b (\"\u5358\u4e00\") \u304b\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3054\u3068\u306b Classloader \u304c\u3042\u308b  (\"\u8907\u6570\") \u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ApplicationServer.applicationClassLoadingMode.displayName=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c9\u30fb\u30e2\u30fc\u30c9
ApplicationServer.applicationClassLoadingMode.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 Classloader \u30dd\u30ea\u30b7\u30fc\u304c \"\u5358\u4e00\" \u306e\u5834\u5408\u306b\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c9\u30fb\u30e2\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059
ClassLoaderPolicy.SINGLE=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
ClassLoaderPolicy.MULTIPLE=\u30e2\u30b8\u30e5\u30fc\u30eb
ServerClassLoaderPolicy.SINGLE=\u5358\u4e00
ServerClassLoaderPolicy.MULTIPLE=\u8907\u6570
applicationClassLoadingMode.PARENT_FIRST=\u89aa\u304c\u6700\u521d
applicationClassLoadingMode.PARENT_LAST=\u89aa\u304c\u6700\u5f8c                         
ApplicationContainer.displayName=ApplicationContainer
ApplicationContainer.description=
ApplicationContainer.smallIcon=ApplicationContainer.gif
ApplicationContainer.largeIcon=ApplicationContainer32X32.gif
DynamicCache.displayName=\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30fc\u30d3\u30b9
DynamicCache.description=\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30fc\u30d3\u30b9
DynamicCache.smallIcon=DynamicCache.gif
DynamicCache.largeIcon=DynamicCache32X32.gif
DynamicCache.cacheGroups.description=WebSphere Application Server \u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u308b\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u30bb\u30c3\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
DynamicCache.cacheReplication.displayName=cacheReplication
DynamicCache.cacheReplication.description=
DynamicCache.cacheSize.units=\u30a8\u30f3\u30c8\u30ea\u30fc
DynamicCache.cacheSize.description=\u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u4fdd\u6301\u3059\u308b\u6700\u5927\u9805\u76ee\u6570\u3092\u5b9a\u7fa9\u3059\u308b\u6b63\u306e\u6574\u6570\u3002
DynamicCache.defaultPriority.description=\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u512a\u5148\u9806\u4f4d\u3002\u9805\u76ee\u304c\u30d5\u30eb\u30fb\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u4fdd\u6301\u3055\u308c\u308b\u6642\u9593\u3092\u6c7a\u5b9a\u3057\u307e\u3059\u3002
DynamicCache.replicationType.displayName=replicationType
DynamicCache.replicationType.description=\u5171\u6709\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u3001DRS \u3092\u4ecb\u3057\u3066\u63a5\u7d9a\u3055\u308c\u305f\u3001\u9023\u643a\u3059\u308b\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u914d\u5e03\u3059\u308b\u305f\u3081\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3002  dynamicCacheReplicationKind \u5024\u306e 1 \u3064\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
DynamicCache.pushFrequency.displayName=pushFrequency
DynamicCache.pushFrequency.description=\u8907\u88fd\u30bf\u30a4\u30d7\u304c PUSH \u306e\u5834\u5408\u306b\u4f7f\u7528\u3055\u308c\u308b\u6642\u9593\u9593\u9694 (\u79d2\u5358\u4f4d)\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u306f 0 \u3067\u3059\u3002
DynamicCache.enableDiskOffload.displayName=enableDiskOffload
DynamicCache.enableDiskOffload.description=\u30c7\u30a3\u30b9\u30af\u30fb\u30aa\u30d5\u30ed\u30fc\u30c9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002
DynamicCache.diskOffloadLocation.displayName=diskOffloadLocation
DynamicCache.diskOffloadLocation.description=\u30c7\u30a3\u30b9\u30af\u30fb\u30aa\u30d5\u30ed\u30fc\u30c9\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DynamicCache.hashSize.displayName=hashSize
DynamicCache.hashSize.description=\u30c7\u30a3\u30b9\u30af\u30fb\u30aa\u30d5\u30ed\u30fc\u30c9\u304c\u4f7f\u7528\u53ef\u306e\u5834\u5408\u306e\u30cf\u30c3\u30b7\u30e5\u30fb\u30b5\u30a4\u30ba\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u6709\u52b9\u5024\u306f 2 \u306e\u7d2f\u4e57 (1\u30012\u30014\u30018...) \u3067\u3059\u3002
ExternalCacheGroup.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001IBM Edge Server \u3084 IBM HTTP Server \u306a\u3069\u3001Web \u30b5\u30fc\u30d0\u30fc\u4e0a\u3067 WebSphere Application Server \u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u3066\u3044\u308b\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u30bb\u30c3\u30c8\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
ExternalCacheGroup.smallIcon=ExternalCacheGroup.gif
ExternalCacheGroup.largeIcon=ExternalCacheGroup32X32.gif
ExternalCacheGroup.members.description=WebSphere Application Server \u306b\u3088\u3063\u3066\u5236\u5fa1\u3055\u308c\u308b\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7\u306e\u30e1\u30f3\u30d0\u30fc\u3002
ExternalCacheGroup.name.description=\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7\u540d\u3002
ExternalCacheGroup.type.description=\u73fe\u5728\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u306e\u306f\u3001\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7\u3060\u3051\u3067\u3059\u3002
ExternalCacheGroupMember.displayName=ExternalCacheGroupMember
ExternalCacheGroupMember.description=WebSphere \u304c\u5236\u5fa1\u3059\u308b\u5358\u4e00\u306e\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u3002
ExternalCacheGroupMember.smallIcon=ExternalCacheGroupMember.gif
ExternalCacheGroupMember.largeIcon=ExternalCacheGroupMember32X32.gif
ExternalCacheGroupMember.address.description=\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u30db\u30b9\u30c8\u540d\u3067\u3001\u30dd\u30fc\u30c8\u756a\u53f7\u306e\u5834\u5408\u3082\u3042\u308a\u307e\u3059\u3002
ExternalCacheGroupMember.adapterBeanName.description=WebSphere Application Server \u3068\u3001\u3053\u306e\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u9593\u306e\u30a2\u30c0\u30d7\u30bf\u30fc\u306e\u3001WebSphere Application Server \u30af\u30e9\u30b9\u30d1\u30b9\u306b\u3042\u308b\u30af\u30e9\u30b9\u306e\u540d\u524d\u3002
ExternalCacheGroupKind.SHARED=SHARED
ExternalCacheGroupKind.NOT_SHARED=NOT_SHARED
DynamicCacheReplicationKind.NONE=NONE
DynamicCacheReplicationKind.PUSH=PUSH
DynamicCacheReplicationKind.PULL=PULL
DynamicCacheReplicationKind.PUSH_PULL=PUSH_PULL
EJBCache.displayName=EJB \u30ad\u30e3\u30c3\u30b7\u30e5\u8a2d\u5b9a
EJBCache.description=\u5404 EJB \u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u7d20\u65e9\u304f\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b Bean \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u3082\u3063\u3066\u3044\u307e\u3059\u3002  \u3053\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u3067\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u69cb\u6210\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
EJBCache.smallIcon=EJBCache.gif
EJBCache.largeIcon=EJBCache32X32.gif
EJBCache.cleanupInterval.displayName=\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u9593\u9694
EJBCache.cleanupInterval.units=\u30df\u30ea\u79d2
EJBCache.cleanupInterval.description=\u5408\u8a08\u9805\u76ee\u6570\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30a4\u30ba\u306e\u5024\u307e\u3067\u6e1b\u3089\u3059\u305f\u3081\u306b\u3001\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044\u9805\u76ee\u3092\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u9664\u53bb\u3057\u3088\u3046\u3068\u3059\u308b\u9593\u9694\u3002
EJBCache.cacheSize.displayName=\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30a4\u30ba
EJBCache.cacheSize.units=\u30d0\u30b1\u30c3\u30c8
EJBCache.cacheSize.description=EJB \u30b3\u30f3\u30c6\u30ca\u30fc\u5185\u306e\u30a2\u30af\u30c6\u30a3\u30d6\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u30fb\u30ea\u30b9\u30c8\u306e\u30d0\u30b1\u30c3\u30c8\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EJBContainer.displayName=EJB \
\u30b3\u30f3\u30c6\u30ca\u30fc
EJBContainer.description=EJB \u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u3001J2EE \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3067\u3001\u305d\u306e\u4e2d\u3067\u30c7\u30d7\u30ed\u30a4\u53ef\u80fd\u306a EJB \u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u3092\u63d0\u4f9b\u3059\u308b\u3082\u306e\u3067\u3059\u3002
EJBContainer.smallIcon=EJBContainer.gif
EJBContainer.largeIcon=EJBContainer32X32.gif
EJBContainer.cacheSettings.displayName=EJB \u30ad\u30e3\u30c3\u30b7\u30e5\u8a2d\u5b9a
EJBContainer.cacheSettings.description=\u5404 EJB \u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u7d20\u65e9\u304f\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b Bean \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u3082\u3063\u3066\u3044\u307e\u3059\u3002  \u3053\u306e\u30bb\u30af\u30b7\u30e7\u30f3\u3067\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u69cb\u6210\u3059\u308b\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
EJBContainer.passivationDirectory.displayName=\u975e\u6d3b\u6027\u5316\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc
EJBContainer.passivationDirectory.description=\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u3001\u975e\u6d3b\u6027\u5316 Stateful Session Bean \u306e\u6c38\u7d9a\u72b6\u614b\u3092\u4fdd\u7ba1\u3059\u308b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3002
EJBContainer.inactivePoolCleanupInterval.displayName=\u975e\u6d3b\u52d5\u30d7\u30fc\u30eb\u30fb\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u9593\u9694
EJBContainer.inactivePoolCleanupInterval.description=\u30e1\u30e2\u30ea\u30fc\u306e\u4f7f\u7528\u91cf\u3092\u6e1b\u3089\u3059\u305f\u3081\u306b\u524a\u9664\u3067\u304d\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u8abf\u3079\u308b\u305f\u3081\u306b\u3001\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306a Bean \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u30d7\u30fc\u30eb\u3092\u8abf\u3079\u308b\u9593\u9694\u3002
EJBContainer.defaultDatasourceJNDIName.displayName=\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9 JNDI \u540d
EJBContainer.defaultDatasourceJNDIName.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u4e2d\u306b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306b\u4f7f\u7528\u3059\u308b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e JNDI \u540d\u3002 \u3053\u306e\u8a2d\u5b9a\u306f\u3001EJB 2.x \u6e96\u62e0 CMP Beans \u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093\u3002
MessageListenerService.displayName=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9
MessageListenerService.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3059\u308b\u69cb\u6210\u3002\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u3088\u3063\u3066\u3001\u30d7\u30ed\u30bb\u30b9\u3092 listen \u3059\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30ea\u30d6\u30f3 Bean (MDB) \u304c\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001listen \u3059\u308b\u305f\u3081\u306b JMS \u5b9b\u5148\u3092\u5b9a\u7fa9\u3059\u308b ListenerPorts \u306b\u5bfe\u3057\u3066\u3001MDB \u304c\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u307e\u3059\u3002 \u3053\u308c\u3089\u306e\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306f\u3001\u305d\u306e\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u306b\u5bfe\u3059\u308b\u8a2d\u5b9a\u3068\u5171\u306b\u3001\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u5185\u3067\u5b9a\u7fa9\u3055\u308c\u307e\u3059\u3002
MessageListenerService.smallIcon=MessageListenerService.gif
MessageListenerService.largeIcon=MessageListenerService32X32.gif
MessageListenerService.listenerPorts.displayName=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8
MessageListenerService.listenerPorts.description=\u7ba1\u7406\u30c9\u30e1\u30a4\u30f3\u5185\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u3002
MessageListenerService.threadPool.displayName=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb
MessageListenerService.threadPool.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9 MDB \u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059
MessageListenerService.name.displayName=\u540d\u524d
MessageListenerService.name.description=\u7ba1\u7406\u76ee\u7684\u3067\u4f7f\u7528\u3055\u308c\u308b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u540d\u524d\u3002
MessageListenerService.description.displayName=\u8aac\u660e
MessageListenerService.description.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30ea\u30b9\u30ca\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306f\u3001JMS \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e JMS \u6a5f\u80fd\u306b\u5bfe\u3059\u308b\u62e1\u5f35\u6a5f\u80fd\u3067\u3059\u3002  \u3053\u306e\u6a5f\u80fd\u306f\u30011 \u3064\u4ee5\u4e0a\u306e JMS \u30ea\u30b9\u30ca\u30fc\u3092\u5236\u5fa1\u304a\u3088\u3073\u30e2\u30cb\u30bf\u30fc\u3059\u308b\u30ea\u30b9\u30ca\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u63d0\u4f9b\u3057\u3001\u5404\u30ea\u30b9\u30ca\u30fc\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u305f\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30ea\u30d6\u30f3 Bean \u306e\u4ee3\u308f\u308a\u306b JMS \u5b9b\u5148\u3092\u30e2\u30cb\u30bf\u30fc\u3057\u307e\u3059\u3002
ListenerPort.name.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306e\u540d\u524d
ListenerPort.displayName=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8
ListenerPort.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092 listen \u3059\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30c9\u30ea\u30d6\u30f3 Bean \u306e\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u3002 \u5404\u30dd\u30fc\u30c8\u306f\u3001\u305d\u306e\u30dd\u30fc\u30c8\u306b\u5bfe\u3057\u3066\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u308b MDB \u304c listen \u3059\u308b JMS \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u3068 JMS \u5b9b\u5148\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ListenerPort.smallIcon=ListenerPort.gif
ListenerPort.largeIcon=ListenerPort32X32.gif
ListenerPort.description.displayName=\u8aac\u660e
ListenerPort.description.description=\u7ba1\u7406\u3092\u76ee\u7684\u3068\u3057\u305f\u3001\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306e\u8aac\u660e\u3002
ListenerPort.connectionFactoryJNDIName.displayName=\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc JNDI \u540d
ListenerPort.connectionFactoryJNDIName.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b JMS \u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306b\u5bfe\u3059\u308b JNDI \u540d\u3002\u4f8b\u3048\u3070 jms/connFactory1 \u306e\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
ListenerPort.destinationJNDIName.displayName=\u5b9b\u5148 JNDI \u540d
ListenerPort.destinationJNDIName.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u5b9b\u5148\u306b\u5bfe\u3059\u308b JNDI \u540d\u3002\u4f8b\u3048\u3070 jms/destn1 \u306e\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002
ListenerPort.maxSessions.displayName=\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u6570
ListenerPort.maxSessions.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u51e6\u7406\u3059\u308b\u305f\u3081\u306b\u3001\u30ea\u30b9\u30ca\u30fc\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u4e26\u884c JMS \u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570\u3067\u3001\u7bc4\u56f2\u306f 1 \u304b\u3089 2147483647 \u3067\u3059\u3002
ListenerPort.maxRetries.displayName=\u6700\u5927\u518d\u8a66\u884c\u6570
ListenerPort.maxRetries.description=\u30ea\u30b9\u30ca\u30fc\u3092\u505c\u6b62\u3059\u308b\u524d\u306b\u3001\u30ea\u30b9\u30ca\u30fc\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u914d\u4fe1\u3057\u3088\u3046\u3068\u8a66\u307f\u308b\u6700\u5927\u56de\u6570\u3067\u3001\u7bc4\u56f2\u306f 0 \u304b\u3089 2147483647 \u3067\u3059\u3002
ListenerPort.maxMessages.displayName=\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570
ListenerPort.maxMessages.description=1 \u3064\u306e JMS \u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u3001\u30ea\u30b9\u30ca\u30fc\u304c\u51e6\u7406\u3067\u304d\u308b\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570\u3067\u3001\u7bc4\u56f2\u306f 0 \u304b\u3089 2147483647 \u3067\u3059\u3002
ListenerPort.mbean.started.displayName=\u958b\u59cb
ListenerPort.mbean.started.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306e\u5b9f\u884c\u72b6\u614b
ListenerPort.mbean.jmsConnJNDIName.displayName=\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc JNDI \u540d
ListenerPort.mbean.jmsConnJNDIName.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30b9\u30ec\u30c3\u30c9\u304c\u4f7f\u7528\u3059\u308b JMS ConnectionFactory \u306e JNDI \u540d\u3002
ListenerPort.mbean.jmsDestJNDIName.displayName=\u5b9b\u5148 JNDI \u540d
ListenerPort.mbean.jmsDestJNDIName.description=\u30ea\u30b9\u30ca\u30fc\u30fb\u30b9\u30ec\u30c3\u30c9\u304c\u4f7f\u7528\u3059\u308b JMS \u5b9b\u5148\u306e JNDI \u540d\u3002
ListenerPort.mbean.maxSessions.displayName=\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u6570
ListenerPort.mbean.maxSessions.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u51e6\u7406\u306b MDB \u30ea\u30b9\u30ca\u30fc\u304c\u4f7f\u7528\u3059\u308b JMS ServerSessions \u306e\u6700\u5927\u4e26\u884c\u6570\u3002\u7bc4\u56f2\u306f 1 \u304b\u3089\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u3067\u3059\u3002
ListenerPort.mbean.maxRetries.displayName=\u6700\u5927\u518d\u8a66\u884c\u6570
ListenerPort.mbean.maxRetries.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u9054\u3059\u308b\u6700\u5927\u8a66\u884c\u6570\u3002\u3053\u308c\u3092\u8d85\u3048\u308b\u3068\u3001MDB \u30ea\u30b9\u30ca\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u505c\u6b62\u3055\u308c\u307e\u3059\u3002  \u7bc4\u56f2\u306f 0 \u304b\u3089\u6700\u5927\u518d\u8a66\u884c\u6570\u3067\u3059\u3002
ListenerPort.mbean.maxMessages.displayName=\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570
ListenerPort.mbean.maxMessages.description=JMS ServerSession \u306b\u3088\u308a\u4e00\u5ea6\u306b\u51e6\u7406\u3055\u308c\u308b\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u6700\u5927\u6570\u3002\u7bc4\u56f2\u306f 1 \u304b\u3089\u6700\u5927\u30e1\u30c3\u30bb\u30fc\u30b8\u6570\u3067\u3059\u3002
ListenerPort.must.be.selected=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u884c\u3046\u5834\u5408\u306f\u3001\u5c11\u306a\u304f\u3068\u3082\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u3092 1 \u3064\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ListenerPort.started.succussfully=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8 {0} \u306f\u6b63\u5e38\u306b\u958b\u59cb\u3055\u308c\u307e\u3057\u305f\u3002
could.not.start.ListenerPort=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8 {0} \u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
ListenerPort.stopped.succussfully=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8 {0} \u306f\u6b63\u5e38\u306b\u505c\u6b62\u3055\u308c\u307e\u3057\u305f\u3002
could.not.stop.ListenerPort=\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8 {0} \u3092\u505c\u6b62\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

WebContainer.displayName=Web \u30b3\u30f3\u30c6\u30ca\u30fc
WebContainer.description=Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u3001Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9 (\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3084 JSP \u30d5\u30a1\u30a4\u30eb\u306a\u3069\u3002\u305f\u3060\u3057\u3001\u3053\u308c\u3089\u306b\u9650\u5b9a\u3055\u308c\u307e\u305b\u3093) \u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8981\u6c42\u3092\u51e6\u7406\u3057\u307e\u3059\u3002 Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306f\u3001\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306e\u4f5c\u6210\u3001\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306e\u30ed\u30fc\u30c9\u304a\u3088\u3073\u30a2\u30f3\u30ed\u30fc\u30c9\u3001\u8981\u6c42\u304a\u3088\u3073\u5fdc\u7b54\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u4f5c\u6210\u304a\u3088\u3073\u7ba1\u7406\u3001\u3055\u3089\u306b\u3001Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3092\u52b9\u7387\u7684\u306b\u7ba1\u7406\u3059\u308b\u305d\u306e\u4ed6\u306e\u30bf\u30b9\u30af\u306e\u5b9f\u884c\u3092\u884c\u3044\u307e\u3059\u30021 \u3064\u306e Application Server \u306f 1 \u500b\u3060\u3051\u304b\u3001\u30bc\u30ed\u500b\u306e Web \u30b3\u30f3\u30c6\u30ca\u30fc\u3092\u542b\u307f\u307e\u3059\u3002 Web Server \u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u3001WebSphere Application Server \u88fd\u54c1\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u3001Web Server \u304c\u30ea\u30bd\u30fc\u30b9\u8981\u6c42\u3092 WebSphere Application Server Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u6e21\u305b\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002 
WebContainer.smallIcon=WebContainer.gif
WebContainer.largeIcon=WebContainer32X32.gif
WebContainer.transports.displayName=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8
WebContainer.transports.description=Web \u30b3\u30f3\u30c6\u30ca\u30fc\u7528\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e\u30ea\u30b9\u30c8\u3002
webcontainer.threadpool.description=Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u5bfe\u3059\u308b\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u8a2d\u5b9a
WebContainer.sessionAffinityTimeout.displayName=sessionAffinityTimeout
WebContainer.sessionAffinityTimeout.description=\u30bc\u30ed\u4ee5\u5916\u306e\u5834\u5408\u3001\u6307\u5b9a\u3055\u308c\u305f\u671f\u9593\u304c\u7d4c\u904e\u3059\u308b\u3068\u3001WebSphere \u304c\u8981\u6c42\u306e HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u985e\u7e01\u6027\u3092\u3001\u5225\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u5207\u308a\u66ff\u3048\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u5834\u5408\u306b\u3088\u3063\u3066\u306f\u3001\u3053\u308c\u306b\u3088\u308a\u30ed\u30fc\u30c9\u30fb\u30d0\u30e9\u30f3\u30b7\u30f3\u30b0\u30fb\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3092\u5411\u4e0a\u3067\u304d\u307e\u3059\u3002    \u30c7\u30d5\u30a9\u30eb\u30c8: 0  \u7bc4\u56f2: 0-MAX_INT
WebContainer.sessionAffinityFailoverServer.displayName=sessionAffinityFailoverServer
WebContainer.sessionAffinityFailoverServer.description=WLM \u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30b0\u30eb\u30fc\u30d7\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u30c0\u30a6\u30f3\u3057\u305f\u5834\u5408\u3001WLM \u306f\u901a\u5e38\u3001\u30c0\u30a6\u30f3\u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u985e\u7e01\u6027\u3092\u6301\u3064\u8981\u6c42\u3092\u3001\u305d\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30b0\u30eb\u30fc\u30d7\u5185\u306e\u5225\u306e\u30e9\u30f3\u30c0\u30e0\u306a\u30b5\u30fc\u30d0\u30fc\u306b\u30eb\u30fc\u30c6\u30a3\u30f3\u30b0\u3057\u307e\u3059\u3002    \u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u4f7f\u3046\u3068\u3001\u30e9\u30f3\u30c0\u30e0\u306a\u30b5\u30fc\u30d0\u30fc\u9078\u629e\u3092\u4f7f\u3046\u306e\u3067\u306f\u306a\u304f\u3001\u985e\u7e01\u6027\u8981\u6c42\u304c\u30eb\u30fc\u30c6\u30a3\u30f3\u30b0\u3055\u308c\u308b\u5148\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30b0\u30eb\u30fc\u30d7\u5185\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u540d\u524d\u3092\u3001\u7ba1\u7406\u8005\u304c\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
WebContainer.defaultVirtualHostName.displayName=defaultVirtualHostName
WebContainer.defaultVirtualHostName.description=Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u308b\u4eee\u60f3\u30db\u30b9\u30c8\u3002  \u3053\u308c\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u4e2d\u306b\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3067\u304d\u307e\u3059\u3002
WebContainer.enableServletCaching.displayName=enableServletCaching
WebContainer.enableServletCaching.description=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u304a\u3088\u3073 JSP \u30ad\u30e3\u30c3\u30b7\u30f3\u30b0\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DB2RowSizeEnum.ROW_SIZE_4KB=ROW_SIZE_4KB
DB2RowSizeEnum.ROW_SIZE_8KB=ROW_SIZE_8KB
DB2RowSizeEnum.ROW_SIZE_16KB=ROW_SIZE_16KB
DB2RowSizeEnum.ROW_SIZE_32KB=ROW_SIZE_32KB
TuningParams.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc
TuningParams.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306e\u305f\u3081\u306e\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3002
TuningParams.smallIcon=TuningParams.gif
TuningParams.largeIcon=TuningParams32X32.gif
TuningParams.invalidationSchedule.displayName=invalidationSchedule
TuningParams.invalidationSchedule.description=\u4f7f\u7528\u53ef\u306e\u5834\u5408\u3001\u7121\u52b9\u5316\u30d7\u30ed\u30bb\u30b9\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u3001\u7121\u52b9\u306b\u306a\u3063\u305f\u6301\u7d9a\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u3057\u306b\u884c\u304f\u30011 \u65e5\u306e\u4e2d\u306e 2 \u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30b5\u30a4\u30c8\u3078\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u30fc\u304c\u6700\u5c0f\u3067\u3042\u308b\u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u30fc\u3092\u524a\u6e1b\u3059\u308b\u305f\u3081\u306b\u884c\u3046\u3082\u306e\u3067\u3059\u3002 \u3053\u308c\u3092\u30aa\u30f3\u306b\u3059\u308b\u3068\u3001HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u5b58\u7d9a\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u66f4\u65b0\u306e\u6570\u304c\u524a\u6e1b\u3055\u308c\u307e\u3059\u3002 \u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30aa\u30d5\u306b\u3059\u308b\u3068\u3001\u7121\u52b9\u5316\u30d7\u30ed\u30bb\u30b9\u304c\u6570\u5206\u3054\u3068\u306b\u5b9f\u884c\u3055\u308c\u3001\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u308b HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u9664\u53bb\u3055\u308c\u307e\u3059\u3002
TuningParams.usingMultiRowSchema.displayName=usingMultiRowSchema
TuningParams.usingMultiRowSchema.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u5404\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u5185\u306e\u5225\u3005\u306e\u884c\u306b\u7f6e\u304f\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u5f53\u305f\u308a\u306e\u4fdd\u7ba1\u3055\u308c\u308b\u30c7\u30fc\u30bf\u91cf\u3092\u5897\u3084\u3059\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \u7279\u5b9a\u306e\u4f7f\u7528\u4f8b\u3067\u306f\u3001\u3053\u308c\u306b\u3088\u308a\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u304c\u5411\u4e0a\u3059\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002  TRUE - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u5404\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u5185\u306e\u5225\u3005\u306e\u884c\u306b\u7f6e\u304d\u307e\u3059   FALSE - \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u540c\u3058\u884c\u306b\u7f6e\u304f\u3053\u3068\u304c\u3067\u304d\u307e\u3059  
TuningParams.maxInMemorySessionCount.displayName=maxInMemorySessionCount
TuningParams.maxInMemorySessionCount.description=\u30e1\u30e2\u30ea\u30fc\u306b\u4fdd\u6301\u3059\u308b\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TuningParams.allowOverflow.displayName=allowOverflow
TuningParams.allowOverflow.description=\u30e1\u30e2\u30ea\u30fc\u5185\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u304c\u300c\u30e1\u30e2\u30ea\u30fc\u5185\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u300d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u3088\u308a\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5024\u3092\u8d85\u3048\u308b\u3053\u3068\u3092\u8a31\u53ef\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  TRUE - \u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u3092\u8a31\u53ef\u3057\u307e\u3059   FALSE - \u30e1\u30e2\u30ea\u30fc\u5185\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u3092\u300c\u30e1\u30e2\u30ea\u30fc\u5185\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u300d\u306b\u5236\u9650\u3057\u307e\u3059\u3002      
TuningParams.scheduleInvalidation.displayName=scheduleInvalidation
TuningParams.scheduleInvalidation.description=\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30c8\u30fb\u30b9\u30c8\u30a2\u304b\u3089\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u6d88\u53bb\u3059\u308b\u6642\u6a5f\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TuningParams.writeFrequency.description=\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u3044\u3064\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30c8\u30fb\u30b9\u30c8\u30a2\u306b\u66f8\u304d\u8fbc\u307e\u308c\u308b\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
TuningParams.writeInterval.displayName=writeInterval
TuningParams.writeInterval.description=\u66f8\u304d\u8fbc\u307f\u983b\u5ea6\u304c TIME_BASED_WRITE \u306b\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u5024\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u66f8\u304d\u8fbc\u307e\u308c\u308b\u983b\u5ea6\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u5024\u306f\u79d2\u5358\u4f4d\u3067\u6307\u5b9a\u3057\u30015 \u304b\u3089 9999 \u307e\u3067\u306e\u6b63\u306e\u6574\u6570\u3067\u6307\u5b9a\u3057\u307e\u3059\u3002 \u69cb\u6210\u3055\u308c\u308b\u5834\u5408\u3001InvalidationTimeout \u306f\u6700\u5c0f\u3067\u3082\u66f8\u304d\u8fbc\u307f\u9593\u9694\u306e 2 \u500d\u306b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
TuningParams.writeContents.description=\u66f4\u65b0\u3055\u308c\u305f\u5c5e\u6027\u3060\u3051\u3092\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30c8\u30fb\u30b9\u30c8\u30a2\u306b\u66f8\u304d\u8fbc\u3080\u304b\u3001\u307e\u305f\u306f\u5909\u66f4\u3055\u308c\u305f\u304b\u3069\u3046\u304b\u306b\u95a2\u4fc2\u306a\u304f\u3001\u3059\u3079\u3066\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u5c5e\u6027\u3092\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30c8\u30fb\u30b9\u30c8\u30a2\u306b\u66f8\u304d\u8fbc\u3080\u304b\u3002    \u66f4\u65b0\u3055\u308c\u305f\u5c5e\u6027\u306e\u307f\u3092\u6307\u5b9a\u3059\u308b\u3068\u3001\u66f4\u65b0\u3055\u308c\u305f\u5c5e\u6027\u306e\u307f\u304c\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30c8\u30fb\u30b9\u30c8\u30a2\u306b\u66f8\u304d\u8fbc\u307e\u308c\u307e\u3059\u3002
TuningParams.invalidationTimeout.displayName=invalidationTimeout
TuningParams.invalidationTimeout.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u672a\u4f7f\u7528\u306e\u3068\u304d\u306b\u3001\u305d\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u306f\u6709\u52b9\u3067\u306f\u306a\u3044\u3068\u898b\u306a\u3059\u307e\u3067\u306e\u6642\u9593\u9593\u9694\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  -1 \u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u5316\u3055\u308c\u306a\u3044\u3053\u3068\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  \u3053\u306e\u5024\u306f\u3001Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u306b\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306b\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002  \u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u3092\u4fdd\u6301\u3059\u308b\u305f\u3081\u3001\u7121\u52b9\u5316\u30bf\u30a4\u30de\u30fc\u306b\u306f\u79d2\u307e\u3067\u306e\u7cbe\u5ea6\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u3053\u306e\u30bf\u30a4\u30de\u30fc\u306f 2 \u5206\u4ee5\u5185\u306e\u7cbe\u5ea6\u3067\u3042\u308b\u3068\u60f3\u5b9a\u3059\u308b\u306e\u304c\u78ba\u5b9f\u3067\u3059\u3002  \u300c\u66f8\u304d\u8fbc\u307f\u983b\u5ea6\u300d\u304c\u6642\u9593\u306b\u57fa\u3065\u304f\u5834\u5408\u3001\u3053\u306e\u5024\u306f\u66f8\u304d\u8fbc\u307f\u9593\u9694\u306e\u6700\u5c0f\u3067\u3082 2 \u500d\u306b\u8a2d\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
WriteFrequencyEnum.END_OF_SERVLET_SERVICE=END_OF_SERVLET_SERVICE
WriteFrequencyEnum.MANUAL_UPDATE=MANUAL_UPDATE
WriteFrequencyEnum.TIME_BASED_WRITE=TIME_BASED_WRITE
WriteContentsEnum.ONLY_UPDATED_ATTRIBUTES=ONLY_UPDATED_ATTRIBUTES
WriteContentsEnum.ALL_SESSION_ATTRIBUTES=ALL_SESSION_ATTRIBUTES
InvalidationSchedule.displayName=InvalidationSchedule
InvalidationSchedule.description=\u4f7f\u7528\u53ef\u306e\u5834\u5408\u3001\u7121\u52b9\u5316\u30d7\u30ed\u30bb\u30b9\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u3001\u7121\u52b9\u306b\u306a\u3063\u305f\u6301\u7d9a\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u3057\u306b\u884c\u304f\u30011 \u65e5\u306e\u4e2d\u306e 2 \u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30b5\u30a4\u30c8\u3078\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u30fc\u304c\u6700\u5c0f\u3067\u3042\u308b\u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u30a2\u30af\u30c6\u30a3\u30d3\u30c6\u30a3\u30fc\u3092\u524a\u6e1b\u3059\u308b\u305f\u3081\u306b\u884c\u3046\u3082\u306e\u3067\u3059\u3002 \u3053\u308c\u3092\u30aa\u30f3\u306b\u3059\u308b\u3068\u3001HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u5b58\u7d9a\u3059\u308b\u305f\u3081\u306b\u5fc5\u8981\u306a\u3001\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3078\u306e\u66f4\u65b0\u306e\u6570\u304c\u524a\u6e1b\u3055\u308c\u307e\u3059\u3002 \u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u30aa\u30d5\u306b\u3059\u308b\u3068\u3001\u7121\u52b9\u5316\u30d7\u30ed\u30bb\u30b9\u304c\u6570\u5206\u3054\u3068\u306b\u5b9f\u884c\u3055\u308c\u3001\u7121\u52b9\u306b\u306a\u3063\u3066\u3044\u308b HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u9664\u53bb\u3055\u308c\u307e\u3059\u3002
InvalidationSchedule.smallIcon=InvalidationSchedule.gif
InvalidationSchedule.largeIcon=InvalidationSchedule32X32.gif
InvalidationSchedule.firstHour.displayName=firstHour
InvalidationSchedule.firstHour.description=\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u5916\u90e8\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u6d88\u53bb\u3055\u308c\u308b\u6700\u521d\u306e\u6642\u9593\u3002 \u3053\u306e\u5024\u306f\u30010 \u304b\u3089 23 \u307e\u3067\u306e\u6b63\u306e\u6574\u6570\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u3001\u7121\u52b9\u5316\u30b9\u30b1\u30b8\u30e5\u30fc\u30eb\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
InvalidationSchedule.secondHour.displayName=secondHour
InvalidationSchedule.secondHour.description=\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u5916\u90e8\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u6d88\u53bb\u3055\u308c\u308b 2 \u756a\u76ee\u306e\u6642\u9593\u3002 \u3053\u306e\u5024\u306f\u30010 \u304b\u3089 23 \u307e\u3067\u306e\u6b63\u306e\u6574\u6570\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u3001\u7121\u52b9\u5316\u30b9\u30b1\u30b8\u30e5\u30fc\u30eb\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
HTTPTransport.displayName=HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8
HTTPTransport.description=\u8981\u6c42\u3092 Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u901a\u4fe1\u3059\u308b\u305f\u3081\u306e HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3002
HTTPTransport.smallIcon=HTTPTransport.gif
HTTPTransport.largeIcon=HTTPTransport32X32.gif
DRSSettings.displayName=\u5185\u90e8\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0
DRSSettings.description=\u30e1\u30e2\u30ea\u30fc\u304b\u3089\u30e1\u30e2\u30ea\u30fc\u3078\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u8907\u88fd\u306e\u69cb\u6210
DRSSettings.smallIcon=DRSSettings.gif
DRSSettings.largeIcon=DRSSettings32X32.gif
DRSSettings.dataReplicationMode.displayName=dataReplicationMode
DRSSettings.dataReplicationMode.description=WebSphere \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u3001\u5185\u90e8\u8907\u88fd\u3092\u4ecb\u3057\u3066\u30c7\u30fc\u30bf\u9001\u4fe1\u306e\u307f\u3092\u884c\u3046\u304b\u3001\u53d7\u4fe1\u306e\u307f\u3092\u884c\u3046\u304b\u3001\u307e\u305f\u306f\u305d\u306e\u4e21\u65b9\u3092\u884c\u3046\u304b\u3092\u5224\u5225\u3057\u307e\u3059\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30e2\u30fc\u30c9\u306f\u4e21\u65b9\u3067\u3059\u3002
DRSSettings.messageBrokerDomainName.displayName=messageBrokerDomainName
DRSSettings.messageBrokerDomainName.description=\u3053\u306e WebSphere \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u5185\u90e8\u8907\u88fd\u30c9\u30e1\u30a4\u30f3\u3002
DRSSettings.preferredLocalDRSBrokerName.displayName=preferredLocalDRSBrokerName
DRSSettings.preferredLocalDRSBrokerName.description=\u3053\u306e WebSphere \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u6700\u521d\u306b\u63a5\u7d9a\u3055\u308c\u308b\u8907\u88fd\u30c9\u30e1\u30a4\u30f3\u5185\u306e\u7279\u5b9a\u306e\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u3002
DRSSettings.overrideHostConnectionPoints.displayName=overrideHostConnectionPoints
DRSSettings.overrideHostConnectionPoints.description=\u30bb\u30eb\u306e\u8907\u88fd\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u9078\u629e\u3059\u308b\u306e\u3067\u306f\u306a\u304f\u3001\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u7279\u5b9a\u306e IP \u30a2\u30c9\u30ec\u30b9\u3068\u30dd\u30fc\u30c8\u306e\u8a2d\u5b9a\u3092\u8a31\u53ef\u3057\u307e\u3059\u3002
DRSSettings.hostPort.error=\u30db\u30b9\u30c8\u304a\u3088\u3073\u30dd\u30fc\u30c8\u306f\u7121\u52b9\u3067\u3042\u308b\u304b\u3001\u30df\u30b9\u30de\u30c3\u30c1\u3067\u3059\u3002 \u6307\u5b9a\u3055\u308c\u305f\u5404\u30db\u30b9\u30c8\u306b\u306f\u3001\u5bfe\u5fdc\u3059\u308b\u30dd\u30fc\u30c8\u756a\u53f7\u304c\u5fc5\u8981\u3067\u3059\u3002
SessionPersistenceKind.NONE=NONE
SessionPersistenceKind.DATABASE=DATABASE
SessionPersistenceKind.DATA_REPLICATION=DATA_REPLICATION

Server.displayName=\u30b5\u30fc\u30d0\u30fc
Server.description=\u30e2\u30c7\u30eb\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u540d\u3092\u8b58\u5225\u3059\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30e2\u30c7\u30eb\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002 \u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306f\u69cb\u6210\u5024\u306e\u7d99\u627f\u306e\u6982\u5ff5\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u3059\u3002\u3064\u307e\u308a\u69cb\u6210\u5024\u304c\u30b5\u30fc\u30d0\u30fc\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u30e9\u30f3\u30bf\u30a4\u30e0\u306f\u305d\u306e\u8a2d\u5b9a\u306b\u3064\u3044\u3066\u3001modelID \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u8b58\u5225\u3055\u308c\u308b\u30e2\u30c7\u30eb\u304c\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u305d\u306e\u30e2\u30c7\u30eb\u3092\u53c2\u7167\u3057\u307e\u3059\u3002
Server.smallIcon=Server.gif
Server.largeIcon=Server32X32.gif
Server.customServices.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9
Server.customServices.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u3068\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5185\u3067\u5b9f\u884c\u3059\u308b\u3001\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30af\u30e9\u30b9\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
Server.components.displayName=\u30b5\u30fc\u30d0\u30fc\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
Server.components.description=\u69cb\u6210\u53ef\u80fd\u306a\u8ffd\u52a0\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3002
Server.components.ServerComponent.displayName=\u30b5\u30fc\u30d0\u30fc\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
Server.extensions.displayName=\u62e1\u5f35\u5b50
Server.started=\u958b\u59cb
Server.stopped=\u505c\u6b62
Service.displayName=\u30b5\u30fc\u30d3\u30b9
Service.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u5185\u3067\u5b9f\u884c\u3059\u308b\u30b5\u30fc\u30d3\u30b9\u306e\u69cb\u6210\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Service.smallIcon=Service.gif
Service.largeIcon=Service32X32.gif
Service.context.displayName=\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
Service.context.description=\u30b5\u30fc\u30d3\u30b9\u304c\u7a3c\u50cd\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u307e\u305f\u306f\u74b0\u5883\u3002
Service.context.Component.displayName=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
Service.context.Server.displayName=\u30b5\u30fc\u30d0\u30fc
Service.properties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Service.properties.description=\u69cb\u6210\u53ef\u80fd\u306a\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3059\u308b\u8ffd\u52a0\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
Service.enable.displayName=\u59cb\u52d5
Service.enable.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u59cb\u52d5\u6642\u306b\u6307\u5b9a\u3055\u308c\u305f\u30b5\u30fc\u30d3\u30b9\u3092\u59cb\u52d5\u3057\u3088\u3046\u3068\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
CustomService.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9
CustomService.description=\u30d7\u30e9\u30b0\u30a4\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u69cb\u6210\u30c7\u30fc\u30bf\u306b\u5bfe\u3057\u3066\u62e1\u5f35\u30dd\u30a4\u30f3\u30c8\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002  \u30ab\u30b9\u30bf\u30de\u30fc\u304c\u3001\u30d7\u30ed\u30bb\u30b9\u521d\u671f\u5316\u3067\u5b9f\u884c\u3055\u308c\u308b\u30ab\u30b9\u30bf\u30e0\u30fb\u30b3\u30fc\u30c9\u3092\u8ffd\u52a0\u3067\u304d\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
CustomService.smallIcon=CustomService.gif
CustomService.largeIcon=CustomService32X32.gif
CustomService.prerequisiteServices.displayName=prerequisiteServices
CustomService.prerequisiteServices.description=\u3053\u306e\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u304c\u521d\u671f\u5316\u3055\u308c\u308b\u524d\u306b\u5f85\u6a5f\u3059\u308b\u3001\u3053\u306e\u30d7\u30ed\u30bb\u30b9\u3067\u5b9a\u7fa9\u3055\u308c\u305f\u4ed6\u306e\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u3078\u306e\u53c2\u7167\u306e\u30ea\u30b9\u30c8\u3002
CustomService.externalConfigURL.displayName=\u5916\u90e8\u69cb\u6210 URL
CustomService.externalConfigURL.description=\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u306e URL \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
CustomService.classname.displayName=\u30af\u30e9\u30b9\u540d
CustomService.classname.description=\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u30af\u30e9\u30b9\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u30af\u30e9\u30b9\u306f\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
CustomService.displayName.displayName=\u8868\u793a\u540d
CustomService.displayName.description=\u30b5\u30fc\u30d3\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
CustomService.description.displayName=\u8aac\u660e
CustomService.description.description=\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9\u3092\u8a18\u8ff0\u3057\u307e\u3059\u3002
CustomService.classpath.displayName=\u30af\u30e9\u30b9\u30d1\u30b9
CustomService.classpath.description=\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3059\u308b\u30af\u30e9\u30b9\u304a\u3088\u3073 JAR \u3092\u691c\u51fa\u3059\u308b\u5834\u5408\u306b\u4f7f\u7528\u3055\u308c\u308b\u30af\u30e9\u30b9\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ThreadPool.displayName=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb
ThreadPool.description=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u306b\u3088\u3063\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306f\u30b9\u30ec\u30c3\u30c9\u3092\u518d\u5229\u7528\u3067\u304d\u3001\u5b9f\u884c\u6642\u306b\u65b0\u898f\u30b9\u30ec\u30c3\u30c9\u306e\u4f5c\u6210\u3092\u884c\u3046\u5fc5\u8981\u304c\u306a\u304f\u306a\u308a\u307e\u3059\u3002\u901a\u5e38\u3001\u65b0\u898f\u30b9\u30ec\u30c3\u30c9\u306e\u4f5c\u6210\u306f\u6642\u9593\u3068\u30ea\u30bd\u30fc\u30b9\u3092\u96c6\u7d04\u3057\u305f\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u3059\u3002
ThreadPool.smallIcon=ThreadPool.gif
ThreadPool.largeIcon=ThreadPool32X32.gif
ThreadPool.minimumSize.displayName=\u6700\u5c0f\u30b5\u30a4\u30ba
ThreadPool.minimumSize.description=\u30d7\u30fc\u30eb\u3067\u53ef\u80fd\u306a\u6700\u5c0f\u30b9\u30ec\u30c3\u30c9\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ThreadPool.maximumSize.displayName=\u6700\u5927\u30b5\u30a4\u30ba
ThreadPool.maximumSize.description=\u30d7\u30fc\u30eb\u3067\u53ef\u80fd\u306a\u6700\u5927\u30b9\u30ec\u30c3\u30c9\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ThreadPool.inactivityTimeout.description=\u30b9\u30ec\u30c3\u30c9\u304c\u518d\u5229\u7528\u3055\u308c\u308b\u307e\u3067\u306b\u7d4c\u904e\u3059\u308b\u975e\u6d3b\u52d5\u306e\u30df\u30ea\u79d2\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ThreadPool.isGrowable.displayName=\u62e1\u5f35\u53ef\u80fd
ThreadPool.isGrowable.description=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u306b\u5bfe\u3057\u3066\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u6700\u5927\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u3066\u3001\u30b9\u30ec\u30c3\u30c9\u6570\u3092\u5897\u3084\u3059\u3053\u3068\u304c\u3067\u304d\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
MessageFormatKind.BASIC=\u57fa\u672c
MessageFormatKind.ADVANCED=\u62e1\u5f35
ServiceContext.displayName=\u30b5\u30fc\u30d3\u30b9\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
ServiceContext.description=\u30b5\u30fc\u30d3\u30b9\u304c\u7a3c\u50cd\u3055\u308c\u308b\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u307e\u305f\u306f\u74b0\u5883\u3002
ServiceContext.smallIcon=ServiceContext.gif
ServiceContext.largeIcon=ServiceContext32X32.gif
ServiceContext.services.displayName=\u30b5\u30fc\u30d3\u30b9
ServiceContext.services.description=\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u5185\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3001\u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u63d0\u4f9b\u3059\u308b\u30b5\u30fc\u30d3\u30b9\u3002  \u30b3\u30f3\u30c6\u30ca\u30fc\u304c\u63d0\u4f9b\u3059\u308b\u30b5\u30fc\u30d3\u30b9\u306e\u30bf\u30a4\u30d7\u306f\u3001\u30b5\u30fc\u30d3\u30b9\u306e\u6709\u52b9\u7bc4\u56f2\u3068\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u6709\u52b9\u7bc4\u56f2\u3068\u306e\u6bd4\u8f03\u306b\u57fa\u3065\u3044\u305f\u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u30bf\u30a4\u30d7\u306b\u3088\u3063\u3066\u5236\u9650\u3055\u308c\u307e\u3059\u3002  
ServiceContext.services.CustomService.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30b5\u30fc\u30d3\u30b9
Component.displayName=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
Component.description=\u30ea\u30e2\u30fc\u30c8\u547c\u3073\u51fa\u3057\u306e\u53ef\u80fd\u306a\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u542b\u307e\u308c\u305f\u30d7\u30ed\u30bb\u30b9\u3092\u8868\u3057\u307e\u3059\u3002  \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u72ec\u81ea\u306e\u30d7\u30ed\u30bb\u30b9 (\u30b5\u30fc\u30d3\u30b9\u306a\u3069) \u306b\u3042\u308b\u89aa\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u304b\u3089\u72ec\u7acb\u3057\u3066\u5b9f\u884c\u3059\u308b\u3053\u3068\u306e\u3067\u304d\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u69cb\u6210\u60c5\u5831\u3092\u8868\u3057\u307e\u3059\u3002  \u8907\u6570\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u3001JVM\u3000\u5185\u3067\u5b9f\u884c\u53ef\u80fd\u3067\u3059\u3002
Component.smallIcon=Component.gif
Component.largeIcon=Component32X32.gif
Component.properties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Component.properties.description=\u3053\u306e\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u5bfe\u3059\u308b\u8ffd\u52a0\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002 \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u306f\u3001\u3053\u3053\u3067\u5b9a\u7fa9\u3067\u304d\u308b\u30ab\u30b9\u30bf\u30e0\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u5229\u7528\u3067\u304d\u307e\u3059\u3002
Component.parentComponent.displayName=parentComponent
Component.parentComponent.description=\u69cb\u6210\u8a2d\u5b9a\u3092\u542b\u3080\u3001\u3088\u308a\u5927\u304d\u3044\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3002
Component.parentComponent.ServerComponent.displayName=ServerComponents
Component.components.displayName=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
Component.components.description=\u69cb\u6210\u53ef\u80fd\u306a\u8ffd\u52a0\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3002
Component.components.ServerComponent.displayName=ServerComponents
Component.server.displayName=\u30b5\u30fc\u30d0\u30fc
Component.server.description=\u5185\u90e8\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b\u30b3\u30f3\u30c6\u30ca\u30fc\u304a\u3088\u3073\u30b5\u30fc\u30d3\u30b9\u304b\u3089\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30b5\u30fc\u30d3\u30b9\u3068\u30ea\u30bd\u30fc\u30b9\u3092\u63d0\u4f9b\u3059\u308b\u30ce\u30fc\u30c9\u3067\u5b9f\u884c\u3057\u3066\u3044\u308b\u30d7\u30ed\u30bb\u30b9 (\u307e\u305f\u306f 1 \u3064\u306e\u8ad6\u7406\u30d7\u30ed\u30bb\u30b9\u3068\u3057\u3066\u6a5f\u80fd\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u30fb\u30bb\u30c3\u30c8)\u3002
Agent.displayName=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8
Agent.description=
Agent.smallIcon=Agent.gif
Agent.largeIcon=Agent32X32.gif
Server.stateManagement.displayName=\u72b6\u614b\u7ba1\u7406
Server.stateManagement.description=\u7ba1\u7406\u5bfe\u8c61\u30ea\u30bd\u30fc\u30b9\u306e\u72b6\u614b\u3092\u5236\u5fa1\u3059\u308b\u6a5f\u80fd\u3002 \u3064\u307e\u308a\u3001\u30ea\u30bd\u30fc\u30b9\u3092\u958b\u59cb\u304a\u3088\u3073\u505c\u6b62\u3057\u307e\u3059\u3002
Server.statisticsProvider.displayName=\u7d71\u8a08\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
Server.statisticsProvider.description=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e1\u30c8\u30ea\u30c3\u30af\u3092\u751f\u6210\u3059\u308b\u7ba1\u7406\u6e08\u307f\u30ea\u30bd\u30fc\u30b9\u306e\u6a5f\u80fd\u3002
ManagedObject.name.displayName=\u540d\u524d
ManagedObject.name.description=\u3053\u306e\u30e9\u30a4\u30d6\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u8868\u3059\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u4f7f\u7528\u3059\u308b\u540d\u524d\u3002  \u3053\u306e\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u540d\u524d\u306f\u3001\u5b9f\u884c\u6642\u306b\u30e9\u30a4\u30d6\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u64cd\u4f5c\u5236\u5fa1\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u898b\u3064\u3051\u308b\u305f\u3081\u306b ManagementAgent \u30d7\u30ed\u30bb\u30b9\u3068\u5171\u306b\u4f7f\u7528\u3067\u304d\u308b\u3001\u7b97\u51fa\u3055\u308c\u305f\u968e\u5c64\u540d\u306e 1 \u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3068\u3057\u3066\u632f\u308b\u821e\u3044\u307e\u3059\u3002
ExecutionState.START=START
ExecutionState.STOP=STOP
StateManageable.displayName=StateManageable
StateManageable.description=\u30e9\u30a4\u30d5\u30fb\u30b5\u30a4\u30af\u30eb (\u59cb\u52d5\u3001\u505c\u6b62\u306a\u3069) \u304c\u3042\u308b\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u69cb\u6210\u8a2d\u5b9a\u3092\u8868\u3057\u307e\u3059\u3002
StateManageable.smallIcon=StateManageable.gif
StateManageable.largeIcon=StateManageable32X32.gif
StateManageable.managedObject.displayName=managedObject
StateManageable.managedObject.description=\u958b\u59cb\u307e\u305f\u306f\u505c\u6b62\u3067\u304d\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3002
StateManageable.managedObject.ServiceContext.displayName=ServiceContexts
StateManageable.initialState.displayName=\u521d\u671f\u72b6\u614b
StateManageable.initialState.description=\u30b5\u30fc\u30d0\u30fc\u304c\u6700\u521d\u306b\u958b\u59cb\u3055\u308c\u308b\u3068\u304d\u306b\u8981\u6c42\u3055\u308c\u308b\u5b9f\u884c\u72b6\u614b\u3002
ServerComponent.StateManageable.initialState.description=\u30b5\u30fc\u30d0\u30fc\u304c\u6700\u521d\u306b\u958b\u59cb\u3055\u308c\u308b\u3068\u304d\u306b\u8981\u6c42\u3055\u308c\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u5b9f\u884c\u72b6\u614b\u3002
StatisticsProvider.displayName=StatisticsProvider
StatisticsProvider.description=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30c7\u30fc\u30bf\u306a\u3069\u306e\u7d71\u8a08\u60c5\u5831\u3092\u63d0\u4f9b\u3059\u308b\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3059\u308b\u3001\u69cb\u6210\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StatisticsProvider.smallIcon=StatisticsProvider.gif
StatisticsProvider.largeIcon=StatisticsProvider32X32.gif
StatisticsProvider.managedObject.displayName=managedObject
StatisticsProvider.managedObject.description=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e1\u30c8\u30ea\u30c3\u30af\u3092\u63d0\u4f9b\u3059\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3002
StatisticsProvider.managedObject.ServiceContext.displayName=ServiceContexts
StatisticsProvider.specification.displayName=\u4ed5\u69d8
StatisticsProvider.specification.description=\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5bfe\u3057\u3066\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u8a2d\u5b9a\u3092\u6307\u5b9a\u3059\u308b\u306e\u306b\u4f7f\u7528\u3067\u304d\u308b\u4ed5\u69d8\u30b9\u30c8\u30ea\u30f3\u30b0\u3002
Extension.displayName=\u62e1\u5f35\u5b50
Extension.description=
Extension.smallIcon=Extension.gif
Extension.largeIcon=Extension32X32.gif
Extension.name.displayName=\u540d\u524d
Extension.name.description=
Extension.configURI.displayName=configURI
Extension.configURI.description=
ServerComponent.displayName=\u30b5\u30fc\u30d0\u30fc\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
ServerComponent.description=\u3053\u306e\u30d1\u30cd\u30eb\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3001JMS \u30b5\u30fc\u30d0\u30fc\u3001\u304a\u3088\u3073\u30cd\u30fc\u30e0\u30fb\u30b5\u30fc\u30d0\u30fc\u8a2d\u5b9a\u306a\u3069\u3001\u7279\u5b9a\u30bf\u30a4\u30d7\u306e\u30b5\u30fc\u30d0\u30fc\u6a5f\u80fd\u306b\u95a2\u9023\u3059\u308b\u69cb\u6210\u8a2d\u5b9a\u3078\u306e\u30a2\u30af\u30bb\u30b9\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002\u30b5\u30fc\u30d0\u30fc\u306e\u57fa\u672c\u30bf\u30a4\u30d7\u3054\u3068\u306b\u3001\u305d\u306e\u30b5\u30fc\u30d0\u30fc\u3067\u69cb\u6210\u3055\u308c\u308b\u30b5\u30fc\u30d0\u30fc\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30ea\u30b9\u30c8\u306f\u7570\u306a\u308a\u307e\u3059\u3002
ServerComponent.smallIcon=ServerComponent.gif
ServerComponent.largeIcon=ServerComponent32X32.gif
Server.name.displayName=\u540d\u524d
Server.name.description=\u30b5\u30fc\u30d0\u30fc\u306e\u540d\u524d\u3002
Server.adminService.displayName=\u7ba1\u7406\u30b5\u30fc\u30d3\u30b9
Server.adminService.description=\u7ba1\u7406\u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u8a2d\u5b9a\u3084\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3069\u306e\u3001\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u7ba1\u7406\u6a5f\u80fd\u306b\u5bfe\u3059\u308b\u3055\u307e\u3056\u307e\u306a\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

AdminService.displayName=\u7ba1\u7406\u30b5\u30fc\u30d3\u30b9
AdminService.description=\u7ba1\u7406\u30d7\u30ed\u30bb\u30b9\u5185\u306e\u3059\u3079\u3066\u306e\u7ba1\u7406\u6a5f\u80fd\u3092\u5236\u5fa1\u3059\u308b\u30b5\u30fc\u30d3\u30b9\u30fb\u30ed\u30b8\u30c3\u30af\u3002
AdminService.smallIcon=AdminService.gif
AdminService.largeIcon=AdminService32X32.gif
AdminService.connectors.displayName=JMX \u30b3\u30cd\u30af\u30bf\u30fc
AdminService.connectors.description=\u30b3\u30cd\u30af\u30bf\u30fc\u306f\u3001\u7279\u5b9a\u306e\u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u3044\u3066 WebSphere \u7ba1\u7406\u30d7\u30ed\u30bb\u30b9\u9593\u306e\u901a\u4fe1\u30c1\u30e3\u30cd\u30eb\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
AdminService.connectors.HTTPConnector.displayName=HTTPConnectors
AdminService.connectors.JMSConnector.displayName=JMSConnectors
AdminService.connectors.RMIConnector.displayName=RMIConnectors
AdminService.connectors.SOAPConnector.displayName=SOAPConnectors
AdminService.preferredConnector.displayName=\u512a\u5148\u30b3\u30cd\u30af\u30bf\u30fc
AdminService.preferredConnector.description=\u512a\u5148 JMX \u30b3\u30cd\u30af\u30bf\u30fc\u30fb\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 SOAPConnector \u3084 RMIConnector \u306a\u3069\u306e\u3001\u4f7f\u7528\u53ef\u80fd\u306a\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001JMX \u30b3\u30cd\u30af\u30bf\u30fc\u30fb\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u5b9a\u7fa9\u3055\u308c\u307e\u3059\u3002
AdminService.preferredConnector.HTTPConnector.displayName=HTTPConnector
AdminService.preferredConnector.JMSConnector.displayName=JMSConnector
AdminService.preferredConnector.RMIConnector.displayName=RMIConnector
AdminService.preferredConnector.SOAPConnector.displayName=SOAPConnector
AdminService.extensionMBeanProviders.displayName=\u62e1\u5f35 MBean \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
AdminService.extensionMBeanProviders.description=\u8ffd\u52a0\u306e JMX MBeans \u3092\u4f7f\u7528\u3057\u3066\u7ba1\u7406\u30b5\u30fc\u30d3\u30b9\u3092\u62e1\u5f35\u3059\u308b\u305f\u3081\u306e ExtensionMBean \u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u542b\u307e\u308c\u305f\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u30ea\u30b9\u30c8\u3002
AdminService.configRepository.displayName=\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9
AdminService.configRepository.description=\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3067\u4f7f\u7528\u3055\u308c\u308b\u69cb\u6210\u30c7\u30fc\u30bf\u3002
AdminService.standalone.displayName=\u30b9\u30bf\u30f3\u30c9\u30a2\u30ed\u30f3
AdminService.standalone.description=\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u304c\u3001\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30bb\u30eb\u306b\u53c2\u52a0\u3057\u3066\u3044\u308b\u306e\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 true \u306e\u5834\u5408\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u5206\u6563\u7ba1\u7406\u306b\u306f\u53c2\u52a0\u3057\u3066\u3044\u307e\u305b\u3093\u3002 false \u306e\u5834\u5408\u3001\u30b5\u30fc\u30d0\u30fc\u306f\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u53c2\u52a0\u3057\u3066\u3044\u307e\u3059\u3002
JMXConnector.displayName=JMX \u30b3\u30cd\u30af\u30bf\u30fc
JMXConnector.description=\u30b3\u30cd\u30af\u30bf\u30fc\u306f\u3001\u7279\u5b9a\u306e\u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u306b\u57fa\u3065\u3044\u3066 WebSphere \u7ba1\u7406\u30d7\u30ed\u30bb\u30b9\u9593\u306e\u901a\u4fe1\u30c1\u30e3\u30cd\u30eb\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
JMXConnector.smallIcon=JMXConnector.gif
JMXConnector.largeIcon=JMXConnector32X32.gif
JMXConnector.properties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
JMXConnector.properties.description=\u3053\u306e JMX \u30b3\u30cd\u30af\u30bf\u30fc\u306b\u9069\u7528\u3055\u308c\u308b\u4efb\u610f\u306e\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
jmx=JMX \u30b3\u30cd\u30af\u30bf\u30fc
ExtensionMBean.displayName=ExtensionMBean
ExtensionMBean.description=MBean \u306e\u30e1\u30bf\u30c7\u30fc\u30bf\u304c\u3042\u308b\u5834\u6240\u3092\u8b58\u5225\u3057\u307e\u3059\u3002
ExtensionMBean.smallIcon=ExtensionMBean.gif
ExtensionMBean.largeIcon=ExtensionMBean32X32.gif
ExtensionMBean.descriptorURI.displayName=descriptorURI
ExtensionMBean.descriptorURI.description=MBean \u306e\u30c7\u30a3\u30b9\u30af\u30ea\u30d7\u30bf\u30fc\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3 
ExtensionMBean.type.displayName=\u30bf\u30a4\u30d7
ExtensionMBean.type.description=MBean \u306e\u30bf\u30a4\u30d7\u3002
HTTPConnector.displayName=HTTPConnector
HTTPConnector.description=HTTP \u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b JMX \u30b3\u30cd\u30af\u30bf\u30fc\u3002
HTTPConnector.smallIcon=HTTPConnector.gif
HTTPConnector.largeIcon=HTTPConnector32X32.gif
JMSConnector.displayName=JMSConnector
JMSConnector.description=5.0 \u306b\u306f\u3001JMS \u30b3\u30cd\u30af\u30bf\u30fc\u306f\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u30dd\u30b9\u30c8 5.0 \u30e9\u30a4\u30f3\u9805\u76ee\u3067\u3059\u3002
JMSConnector.smallIcon=JMSConnector.gif
JMSConnector.largeIcon=JMSConnector32X32.gif
RMIConnector.displayName=RMIConnector
RMIConnector.description=RMI \u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b JMX \u30b3\u30cd\u30af\u30bf\u30fc\u3002
RMIConnector.smallIcon=RMIConnector.gif
RMIConnector.largeIcon=RMIConnector32X32.gif
SOAPConnector.displayName=SOAPConnector
SOAPConnector.description=SOAP \u901a\u4fe1\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b JMX \u30b3\u30cd\u30af\u30bf\u30fc\u3002
SOAPConnector.smallIcon=SOAPConnector.gif
SOAPConnector.largeIcon=SOAPConnector32X32.gif
RepositoryService.displayName=\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9
RepositoryService.description=\u69cb\u6210\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u7ba1\u7406\u3059\u308b\u30b5\u30fc\u30d3\u30b9\u30fb\u30ed\u30b8\u30c3\u30af\u3002
RepositoryService.smallIcon=RepositoryService.gif
RepositoryService.largeIcon=RepositoryService32X32.gif
RepositoryService.lockTimeout.displayName=\u30ed\u30c3\u30af\u30fb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
RepositoryService.lockTimeout.units=\u5206
RepositoryService.lockTimeout.description=\u624b\u52d5\u3067\u30a2\u30f3\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u306a\u3044\u3001\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u30ed\u30c3\u30af\u304c\u81ea\u52d5\u7684\u306b\u30a2\u30f3\u30ed\u30c3\u30af\u3055\u308c\u308b\u307e\u3067\u306b\u7d4c\u904e\u3059\u308b\u5fc5\u8981\u306e\u3042\u308b\u5206\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
RepositoryService.auditEnabled.displayName=\u76e3\u67fb\u4f7f\u7528\u53ef\u80fd
RepositoryService.auditEnabled.description=\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u4e2d\u306e\u76e3\u67fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
ExtensionMBeanProvider.displayName=\u62e1\u5f35 MBean \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
ExtensionMBeanProvider.description=JMX MBean \u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3068\u3001\u305d\u306e MBean XML \u8a18\u8ff0\u5b50\u30d5\u30a1\u30a4\u30eb\u3092\u542b\u3080\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3002\u30b3\u30a2\u7ba1\u7406\u30b7\u30b9\u30c6\u30e0\u3067\u3001\u65e2\u5b58\u306e WebSphere \u7ba1\u7406\u30ea\u30bd\u30fc\u30b9\u3092\u62e1\u5f35\u3059\u308b\u5834\u5408\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 
ExtensionMBeanProvider.smallIcon=ExtensionMBeanProvider.gif
ExtensionMBeanProvider.largeIcon=ExtensionMBeanProvider32X32.gif
ExtensionMBeanProvider.extensionMBeans.displayName=extensionMBeans
ExtensionMBeanProvider.extensionMBeans.description=\u57fa\u672c\u306e WebSphere \u88fd\u54c1\u306b\u7d44\u307f\u8fbc\u307e\u308c\u3066\u3044\u306a\u3044 MBean \u5b9a\u7fa9\u3002
ExtensionMBeanProvider.classpath.displayName=\u30af\u30e9\u30b9\u30d1\u30b9
ExtensionMBeanProvider.classpath.description=MBean \u8a18\u8ff0\u5b50\u3092\u7f6e\u304f\u3053\u3068\u304c\u3067\u304d\u308b\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u5185\u306e\u30af\u30e9\u30b9\u30d1\u30b9\u3002 Classloader \u306b\u306f\u3001\u62e1\u5f35 MBean XML \u8a18\u8ff0\u5b50\u30d5\u30a1\u30a4\u30eb\u3092\u30ed\u30fc\u30c9\u3057\u69cb\u6587\u89e3\u6790\u3059\u308b\u305f\u3081\u306b\u3001\u3053\u306e\u60c5\u5831\u304c\u5fc5\u8981\u3067\u3059\u3002
ExtensionMBeanProvider.description.displayName=\u8aac\u660e
ExtensionMBeanProvider.description.description=\u62e1\u5f35 MBean \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u69cb\u6210\u306b\u5bfe\u3059\u308b\u4efb\u610f\u306e\u8aac\u660e\u30c6\u30ad\u30b9\u30c8\u3002 \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u69cb\u6210\u3092\u8b58\u5225/\u533a\u5225\u3059\u308b\u5834\u5408\u306b\u5f79\u7acb\u3064\u30c6\u30ad\u30b9\u30c8\u306b\u5bfe\u3057\u3066\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
ExtensionMBeanProvider.name.displayName=\u540d\u524d
ExtensionMBeanProvider.name.description=\u62e1\u5f35 MBean \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u8b58\u5225\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u540d\u524d\u3002
JMXConnector.type.displayName=\u578b
JMXConnector.type.description=JMX \u30b3\u30cd\u30af\u30bf\u30fc\u306e\u30bf\u30a4\u30d7

JavaProcessDef.displayName=Java \u30d7\u30ed\u30bb\u30b9\u5b9a\u7fa9
JavaProcessDef.description=Java \u30d7\u30ed\u30bb\u30b9\u306f\u3001\u30d7\u30ed\u30bb\u30b9\u306e\u751f\u6210\u6642\u306b Java \u4eee\u60f3\u30de\u30b7\u30f3\u306b\u6e21\u3059\u3053\u3068\u304c\u3067\u304d\u308b\u8ffd\u52a0\u60c5\u5831\u3092\u5fc5\u8981\u3068\u3057\u307e\u3059\u3002
JavaProcessDef.smallIcon=JavaProcessDef.gif
JavaProcessDef.largeIcon=JavaProcessDef32X32.gif
JavaProcessDef.jvmEntries.displayName=jvmEntries
JavaProcessDef.jvmEntries.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u95a2\u9023\u3057\u305f Java \u4eee\u60f3\u30de\u30b7\u30f3\u306b\u5bfe\u3059\u308b\u69cb\u6210\u306e\u30ea\u30b9\u30c8\u3002
JavaProcessDef.executableTargetKind.displayName=executableTargetKind
JavaProcessDef.executableTargetKind.description=Java \u30af\u30e9\u30b9\u540d\u307e\u305f\u306f\u5b9f\u884c\u53ef\u80fd Jar \u306e\u540d\u524d\u304c\u3001\u3053\u306e Java \u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u884c\u53ef\u80fd\u30bf\u30fc\u30b2\u30c3\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
JavaProcessDef.executableTarget.displayName=executableTarget
JavaProcessDef.executableTarget.description=\u5b9f\u884c\u53ef\u80fd\u30bf\u30fc\u30b2\u30c3\u30c8 (executableTargetKind \u306b\u5fdc\u3058\u3066\u3001main() \u30e1\u30bd\u30c3\u30c9\u3092\u542b\u3080 Java \u30af\u30e9\u30b9\u3001\u307e\u305f\u306f\u5b9f\u884c\u53ef\u80fd jar) \u306e\u540d\u524d\u3002
ProcessDef.displayName=\u30d7\u30ed\u30bb\u30b9\u5b9a\u7fa9
ProcessDef.description=\u30d7\u30ed\u30bb\u30b9\u5b9a\u7fa9\u306f\u3001\u30d7\u30ed\u30bb\u30b9\u306e\u59cb\u52d5/\u521d\u671f\u8a2d\u5b9a\u306b\u5fc5\u8981\u306a\u30b3\u30de\u30f3\u30c9\u884c\u60c5\u5831\u3092\u5b9a\u7fa9\u3057\u307e\u3059\u3002
ProcessDef.smallIcon=ProcessDef.gif
ProcessDef.largeIcon=ProcessDef32X32.gif
ProcessDef.execution.displayName=\u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u884c
ProcessDef.execution.description=RunAs \u8a31\u53ef\u3001Umask\u3001\u30d7\u30ed\u30bb\u30b9\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306a\u3069\u306e\u3001\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u30fb\u30d7\u30ed\u30bb\u30b9\u304c\u3069\u306e\u3088\u3046\u306b\u5b9f\u884c\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3059\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bb\u30c3\u30c8\u3002
ProcessDef.ioRedirect.displayName=\u30d7\u30ed\u30bb\u30b9\u30fb\u30ed\u30b0
ProcessDef.ioRedirect.description=\u30d7\u30ed\u30bb\u30b9\u56fa\u6709\u306e\u5165\u529b/\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u3001\u3069\u306e\u3088\u3046\u306b\u9001\u4fe1\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3059\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bb\u30c3\u30c8\u3002
ProcessDef.environment.displayName=\u74b0\u5883\u30a8\u30f3\u30c8\u30ea\u30fc
ProcessDef.environment.description=\u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u884c\u74b0\u5883\u306b\u8ffd\u52a0\u3055\u308c\u308b\u8a2d\u5b9a\u306e\u30ea\u30b9\u30c8\u3002
ProcessDef.monitoringPolicy.displayName=\u30e2\u30cb\u30bf\u30fc\u30fb\u30dd\u30ea\u30b7\u30fc
ProcessDef.monitoringPolicy.description=\u30d7\u30ed\u30bb\u30b9\u304c\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306b\u3088\u3063\u3066\u3069\u306e\u3088\u3046\u306b\u30e2\u30cb\u30bf\u30fc\u3055\u308c\u308b\u304b\u3092\u5236\u5fa1\u3059\u308b\u3001\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30bb\u30c3\u30c8\u3002
ProcessDef.executableName.displayName=\u5b9f\u884c\u53ef\u80fd\u540d
ProcessDef.executableName.description=\u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u884c\u53ef\u80fd\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessDef.executableArguments.displayName=\u5b9f\u884c\u53ef\u80fd\u306e\u5f15\u304d\u6570
ProcessDef.executableArguments.description=\u30d7\u30ed\u30bb\u30b9\u3092\u958b\u59cb\u3059\u308b\u3068\u5b9f\u884c\u3055\u308c\u308b\u5b9f\u884c\u53ef\u80fd\u306a\u30b3\u30de\u30f3\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessDef.workingDirectory.displayName=\u4f5c\u696d\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc
ProcessDef.workingDirectory.description=\u30d7\u30ed\u30bb\u30b9\u304c\u5b9f\u884c\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessExecution.displayName=\u30d7\u30ed\u30bb\u30b9\u306e\u5b9f\u884c
ProcessExecution.description=\u8ffd\u52a0\u30d7\u30ed\u30bb\u30b9\u5b9f\u884c\u8a2d\u5b9a\u306e\u69cb\u6210\u3002 \u3053\u308c\u3089\u306e\u5024\u306f Windows \u30d7\u30e9\u30c3\u30c8\u30d5\u30a9\u30fc\u30e0\u3067\u306f\u4f7f\u7528\u3055\u308c\u307e\u305b\u3093\u3002
ProcessExecution.smallIcon=ProcessExecution.gif
ProcessExecution.largeIcon=ProcessExecution32X32.gif
ProcessExecution.processPriority.displayName=\u30d7\u30ed\u30bb\u30b9\u306e\u512a\u5148\u9806\u4f4d
ProcessExecution.processPriority.description=\u30d7\u30ed\u30bb\u30b9\u306b\u5bfe\u3059\u308b\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306e\u512a\u5148\u9806\u4f4d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u5024\u3092\u5909\u66f4\u3067\u304d\u308b\u306e\u306f\u3001\u30eb\u30fc\u30c8\u30fb\u30e6\u30fc\u30b6\u30fc\u306e\u307f\u3067\u3059\u3002
ProcessExecution.umask.displayName=Umask
ProcessExecution.umask.description=\u30d7\u30ed\u30bb\u30b9\u304c\u5b9f\u884c\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u30fb\u30de\u30b9\u30af (\u30d5\u30a1\u30a4\u30eb\u30fb\u30e2\u30fc\u30c9\u8a31\u53ef\u30de\u30b9\u30af) \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessExecution.runAsUser.displayName=Run-As \u30e6\u30fc\u30b6\u30fc
ProcessExecution.runAsUser.description=\u30d7\u30ed\u30bb\u30b9\u304c Run-As \u3059\u308b\u30e6\u30fc\u30b6\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessExecution.runAsGroup.displayName=Run-As \u30b0\u30eb\u30fc\u30d7
ProcessExecution.runAsGroup.description=\u30d7\u30ed\u30bb\u30b9\u304c\u30e1\u30f3\u30d0\u30fc\u3067\u3001Run-As \u3059\u308b\u30b0\u30eb\u30fc\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ProcessExecution.runInProcessGroup.displayName=\u30d7\u30ed\u30bb\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7\u3067\u306e\u5b9f\u884c
ProcessExecution.runInProcessGroup.description=\u7279\u5b9a\u306e\u30d7\u30ed\u30bb\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7\u306b\u5bfe\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u5206\u5272\u5316\u306a\u3069\u3092\u884c\u3046\u3068\u304d\u306b\u5f79\u7acb\u3061\u307e\u3059\u3002 \u305f\u3068\u3048\u3070\u300112 \u500b\u306e\u30d7\u30ed\u30bb\u30c3\u30b5\u30fc\u306e\u4e2d\u306e 6 \u500b\u3067\u5b9f\u884c\u3055\u308c\u308b\u3088\u3046\u306a\u30d7\u30ed\u30bb\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7\u3092\u3001\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406\u8005\u304c\u5272\u308a\u5f53\u3066\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8 (0) \u306f\u3001\u7279\u5b9a\u306e\u30b0\u30eb\u30fc\u30d7\u306b\u30d7\u30ed\u30bb\u30b9\u3092\u5272\u308a\u5f53\u3066\u307e\u305b\u3093\u3002
OutputRedirect.displayName=\u51fa\u529b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
OutputRedirect.description=\u3053\u3053\u3067\u6307\u5b9a\u3055\u308c\u305f\u30d5\u30a1\u30a4\u30eb\u306b\u3001\u6a19\u6e96\u5165\u529b\u3001\u51fa\u529b\u3001\u30a8\u30e9\u30fc\u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u307e\u3059\u3002
OutputRedirect.smallIcon=OutputRedirect.gif
OutputRedirect.largeIcon=OutputRedirect32X32.gif
OutputRedirect.stdinFilename.displayName=Stdin \u30d5\u30a1\u30a4\u30eb\u540d
OutputRedirect.stdinFilename.description=\u6a19\u6e96\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u30d5\u30a1\u30a4\u30eb\u5165\u51fa\u529b\u3092\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u307e\u3059\u3002
OutputRedirect.stdoutFilename.displayName=Stdout \u30d5\u30a1\u30a4\u30eb\u540d
OutputRedirect.stdoutFilename.description=\u6a19\u6e96\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u9001\u4fe1\u3055\u308c\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d5\u30a1\u30a4\u30eb\u540d\u306b\u306f\u3001\u5909\u6570\u30a8\u30f3\u30c8\u30ea\u30fc\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u30fb\u30d1\u30b9\u540d\u3092\u7d44\u307f\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
OutputRedirect.stderrFilename.displayName=Stderr \u30d5\u30a1\u30a4\u30eb\u540d
OutputRedirect.stderrFilename.description=\u6a19\u6e96\u30a8\u30e9\u30fc\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u304c\u9001\u4fe1\u3055\u308c\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d5\u30a1\u30a4\u30eb\u540d\u306b\u306f\u3001\u5909\u6570\u30a8\u30f3\u30c8\u30ea\u30fc\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u30fb\u30d1\u30b9\u540d\u3092\u7d44\u307f\u8fbc\u3080\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
JavaVirtualMachine.displayName=Java \u4eee\u60f3\u30de\u30b7\u30f3
JavaVirtualMachine.description=Java \u4eee\u60f3\u30de\u30b7\u30f3\u306e\u8a73\u7d30\u8a2d\u5b9a\u3002
JavaVirtualMachine.smallIcon=JavaVirtualMachine.gif
JavaVirtualMachine.largeIcon=JavaVirtualMachine32X32.gif
JavaVirtualMachine.systemProperties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
JavaVirtualMachine.systemProperties.description=\u3053\u306e JVM \u306b\u5bfe\u3057\u3066\u30e1\u30e2\u30ea\u30fc\u3067\u8a2d\u5b9a\u3055\u308c\u308b Java \u30b7\u30b9\u30c6\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
ManagedObject.stateManagement.description=\u7ba1\u7406\u5bfe\u8c61\u30ea\u30bd\u30fc\u30b9\u306e\u72b6\u614b\u3092\u5236\u5fa1\u3059\u308b\u6a5f\u80fd\u3002 \u3064\u307e\u308a\u3001\u30ea\u30bd\u30fc\u30b9\u3092\u958b\u59cb\u304a\u3088\u3073\u505c\u6b62\u3057\u307e\u3059\u3002
JavaVirtualMachine.classpath.displayName=\u30af\u30e9\u30b9\u30d1\u30b9
JavaVirtualMachine.classpath.description=Java \u4eee\u60f3\u30de\u30b7\u30f3\u304c\u30af\u30e9\u30b9\u3092\u691c\u7d22\u3059\u308b\u6a19\u6e96\u30af\u30e9\u30b9\u30fb\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
JavaVirtualMachine.bootClasspath.displayName=\u30d6\u30fc\u30c8\u30fb\u30af\u30e9\u30b9\u30d1\u30b9
JavaVirtualMachine.bootClasspath.description=JVM \u306b\u5bfe\u3059\u308b\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30fb\u30af\u30e9\u30b9\u3068\u30ea\u30bd\u30fc\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30fb\u30af\u30e9\u30b9\u3068\u30ea\u30bd\u30fc\u30b9\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b JVM \u306b\u5bfe\u3057\u3066\u306e\u307f\u4f7f\u7528\u53ef\u80fd\u3067\u3059\u3002 \u30b3\u30ed\u30f3 (:) \u307e\u305f\u306f\u30bb\u30df\u30b3\u30ed\u30f3 (;) (\u30ce\u30fc\u30c9\u306e\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u3088\u3063\u3066\u6c7a\u307e\u308b) \u3067\u8907\u6570\u306e\u30d1\u30b9\u3092\u5206\u96e2\u3067\u304d\u307e\u3059\u3002
JavaVirtualMachine.verboseModeClass.displayName=\u5197\u9577\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c9
JavaVirtualMachine.verboseModeClass.description=\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c9\u306e\u305f\u3081\u306b\u5197\u9577\u30c7\u30d0\u30c3\u30b0\u51fa\u529b\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u5197\u9577\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u305b\u3093\u3002
JavaVirtualMachine.verboseModeGarbageCollection.displayName=\u5197\u9577\u30ac\u30fc\u30d9\u30c3\u30b8\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3
JavaVirtualMachine.verboseModeGarbageCollection.description=\u30ac\u30fc\u30d9\u30c3\u30b8\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u306e\u5197\u9577\u30c7\u30d0\u30c3\u30b0\u51fa\u529b\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u5197\u9577\u30ac\u30fc\u30d9\u30c3\u30b8\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u305b\u3093\u3002
JavaVirtualMachine.verboseModeJNI.displayName=\u5197\u9577 JNI
JavaVirtualMachine.verboseModeJNI.description=\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e1\u30bd\u30c3\u30c9\u3092\u8d77\u52d5\u3059\u308b\u305f\u3081\u306e\u5197\u9577\u30c7\u30d0\u30c3\u30b0\u51fa\u529b\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u5197\u9577 JNI \u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u305b\u3093\u3002
JavaVirtualMachine.initialHeapSize.displayName=\u521d\u671f\u30d2\u30fc\u30d7\u30fb\u30b5\u30a4\u30ba
JavaVirtualMachine.initialHeapSize.description=JVM \u3067\u4f7f\u7528\u53ef\u80fd\u306a\u521d\u671f\u30d2\u30fc\u30d7\u30fb\u30b5\u30a4\u30ba (\u30e1\u30ac\u30d0\u30a4\u30c8) \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 
JavaVirtualMachine.maximumHeapSize.displayName=\u6700\u5927\u30d2\u30fc\u30d7\u30fb\u30b5\u30a4\u30ba
JavaVirtualMachine.maximumHeapSize.description=JVM \u3067\u4f7f\u7528\u53ef\u80fd\u306a\u6700\u5927\u30d2\u30fc\u30d7\u30fb\u30b5\u30a4\u30ba\u3092\u30e1\u30ac\u30d0\u30a4\u30c8\u3067\u6307\u5b9a\u3057\u307e\u3059\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8\u306f 256 \u3067\u3059\u3002
JavaVirtualMachine.runHProf.displayName=HProf \u306e\u5b9f\u884c
JavaVirtualMachine.runHProf.description=HProf \u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u30fb\u30b5\u30dd\u30fc\u30c8\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u5225\u306e\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001HProf \u5f15\u304d\u6570\u8a2d\u5b9a\u3092\u4f7f\u7528\u3057\u3066\u3001\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001HProf \u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u30fb\u30b5\u30dd\u30fc\u30c8\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u305b\u3093\u3002
JavaVirtualMachine.hprofArguments.displayName=HProf \u5f15\u304d\u6570
JavaVirtualMachine.hprofArguments.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u958b\u59cb\u3059\u308b Java \u4eee\u60f3\u30de\u30b7\u30f3\u306b\u6e21\u3059\u3001\u30b3\u30de\u30f3\u30c9\u884c\u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u5f15\u304d\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u5f15\u304d\u6570\u3092\u6307\u5b9a\u3067\u304d\u308b\u306e\u306f\u3001HProf \u30d7\u30ed\u30d5\u30a1\u30a4\u30e9\u30fc\u30fb\u30b5\u30dd\u30fc\u30c8\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u3068\u304d\u3067\u3059\u3002
JavaVirtualMachine.debugMode.displayName=\u30c7\u30d0\u30c3\u30b0\u30fb\u30e2\u30fc\u30c9
JavaVirtualMachine.debugMode.description=JVM \u30c7\u30d0\u30c3\u30b0\u51fa\u529b\u3092\u4f7f\u7528\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u30c7\u30d0\u30c3\u30b0\u30fb\u30e2\u30fc\u30c9\u30fb\u30b5\u30dd\u30fc\u30c8\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u305b\u3093\u3002
JavaVirtualMachine.debugArgs.displayName=\u30c7\u30d0\u30c3\u30b0\u5f15\u304d\u6570
JavaVirtualMachine.debugArgs.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u958b\u59cb\u3059\u308b Java \u4eee\u60f3\u30de\u30b7\u30f3\u306b\u6e21\u3059\u3001\u30b3\u30de\u30f3\u30c9\u884c\u30c7\u30d0\u30c3\u30b0\u5f15\u304d\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u5f15\u304d\u6570\u3092\u6307\u5b9a\u3067\u304d\u308b\u306e\u306f\u3001\u30c7\u30d0\u30c3\u30b0\u30fb\u30e2\u30fc\u30c9\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u3068\u304d\u3067\u3059\u3002
JavaVirtualMachine.genericJvmArguments.displayName=\u6c4e\u7528 JVM \u5f15\u304d\u6570
JavaVirtualMachine.genericJvmArguments.description=JVM \u306b\u5bfe\u3059\u308b\u8ffd\u52a0\u306e\u30b3\u30de\u30f3\u30c9\u884c\u5f15\u304d\u6570\u3002
JavaVirtualMachine.executableJarFileName.displayName=\u5b9f\u884c\u53ef\u80fd JAR \u30d5\u30a1\u30a4\u30eb\u540d
JavaVirtualMachine.executableJarFileName.description=Java \u4eee\u60f3\u30de\u30b7\u30f3\u304c\u4f7f\u7528\u3059\u308b\u5b9f\u884c\u53ef\u80fd JAR \u30d5\u30a1\u30a4\u30eb\u306e\u7d76\u5bfe\u30d1\u30b9\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
JavaVirtualMachine.disableJIT.displayName=JIT \u3092\u4f7f\u7528\u4e0d\u53ef\u306b\u3059\u308b
JavaVirtualMachine.disableJIT.description=\u30b8\u30e3\u30b9\u30c8\u30a4\u30f3\u30bf\u30a4\u30e0 (JIT) \u30b3\u30f3\u30d1\u30a4\u30e9\u30fc\u304c\u4f7f\u7528\u4e0d\u53ef\u3068\u306a\u308b\u3088\u3046\u306b\u3001JVM \u3092\u69cb\u6210\u3057\u307e\u3059\u3002
JavaVirtualMachine.osName.displayName=\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u540d
JavaVirtualMachine.osName.description=\u6307\u5b9a\u3055\u308c\u305f\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u5bfe\u3059\u308b JVM \u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u59cb\u52d5\u6642\u3001\u30d7\u30ed\u30bb\u30b9\u306f\u3001\u30ce\u30fc\u30c9\u306e\u30aa\u30da\u30ec\u30fc\u30c6\u30a3\u30f3\u30b0\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u5bfe\u3059\u308b JVM \u8a2d\u5b9a\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
MonitoringPolicy.displayName=MonitoringPolicy
MonitoringPolicy.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u306e\u30dd\u30ea\u30b7\u30fc\u8a2d\u5b9a\u3002
MonitoringPolicy.smallIcon=MonitoringPolicy.gif
MonitoringPolicy.largeIcon=MonitoringPolicy32X32.gif
MonitoringPolicy.maximumStartupAttempts.displayName=\u59cb\u52d5\u306e\u6700\u5927\u8a66\u884c\u56de\u6570
MonitoringPolicy.maximumStartupAttempts.units=\u56de
MonitoringPolicy.maximumStartupAttempts.description=\u65ad\u5ff5\u3059\u308b\u524d\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u59cb\u52d5\u3092\u8a66\u307f\u308b\u6700\u5927\u56de\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
MonitoringPolicy.pingInterval.displayName=Ping \u9593\u9694
MonitoringPolicy.pingInterval.units=\u79d2\u9593
MonitoringPolicy.pingInterval.description=\u89aa\u30d7\u30ed\u30bb\u30b9 (\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u306a\u3069) \u3068\u3001\u89aa\u30d7\u30ed\u30bb\u30b9\u304c\u8d77\u52d5\u3057\u305f\u30d7\u30ed\u30bb\u30b9 (\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306a\u3069) \u3068\u306e\u9593\u3067\u306e\u901a\u4fe1\u8a66\u884c\u983b\u5ea6\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u5931\u6557\u3057\u305f\u30b5\u30fc\u30d0\u30fc\u306e\u518d\u59cb\u52d5\u8981\u4ef6\u3092\u57fa\u306b\u3001\u3053\u306e\u5024\u3092\u8abf\u6574\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u3053\u306e\u5024\u3092\u6e1b\u3089\u3059\u3068\u3001\u5931\u6557\u3092\u3088\u308a\u65e9\u304f\u691c\u51fa\u3067\u304d\u307e\u3059\u3002\u5024\u3092\u5897\u3084\u3059\u3068\u3001Ping \u983b\u5ea6\u304c\u6e1b\u3063\u3066\u3001\u30b7\u30b9\u30c6\u30e0\u306e\u30aa\u30fc\u30d0\u30fc\u30d8\u30c3\u30c9\u304c\u6e1b\u308a\u307e\u3059\u3002
MonitoringPolicy.pingTimeout.displayName=Ping \u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
MonitoringPolicy.pingTimeout.units=\u79d2\u9593
MonitoringPolicy.pingTimeout.description=\u30e2\u30cb\u30bf\u30fc\u3055\u308c\u3066\u3044\u308b\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u306e\u7121\u5fdc\u7b54\u3092\u3001\u969c\u5bb3\u3067\u3042\u308b\u3068\u898b\u306a\u3059\u307e\u3067\u306e\u9593\u9694\u3002
MonitoringPolicy.pingInitialTimeout.displayName=Ping \u521d\u671f\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
MonitoringPolicy.pingInitialTimeout.units=\u79d2\u9593
MonitoringPolicy.pingInitialTimeout.description=\u30b5\u30fc\u30d0\u30fc\u304c\u521d\u671f\u5316\u3092\u7d42\u4e86\u3059\u308b\u307e\u3067\u306e\u6700\u5927\u6642\u9593 (\u5206\u5358\u4f4d) \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u6642\u9593\u3092\u904e\u304e\u308b\u3068\u3001\u7ba1\u7406\u30b5\u30fc\u30d0\u30fc\u306f\u30b5\u30fc\u30d0\u30fc\u306e\u518d\u59cb\u52d5\u3092\u8a66\u884c\u3057\u307e\u3059\u3002
MonitoringPolicy.autoRestart.displayName=\u81ea\u52d5\u518d\u59cb\u52d5
MonitoringPolicy.autoRestart.description=\u30d7\u30ed\u30bb\u30b9\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u3001\u81ea\u52d5\u7684\u306b\u518d\u59cb\u52d5\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u81ea\u52d5\u7684\u306b\u30d7\u30ed\u30bb\u30b9\u3092\u518d\u59cb\u52d5\u3057\u307e\u3059\u3002
MonitoringPolicy.nodeRestartState.displayName=\u30ce\u30fc\u30c9\u518d\u59cb\u52d5\u72b6\u614b
MonitoringPolicy.nodeRestartState.description=autoRestart \u304c\u4f7f\u7528\u53ef\u80fd\u306e\u5834\u5408\u306b\u5230\u9054\u3055\u308c\u308b\u51e6\u7406\u72b6\u614b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  \u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001STOPPED\u3001RUNNING\u3001PREVIOUS \u3067\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f STOPPED \u3067\u3059\u3002
ExecutableTargetKind.JAVA_CLASS=JAVA_CLASS
ExecutableTargetKind.EXECUTABLE_JAR=EXECUTABLE_JAR
RestartStateKind.STOPPED=STOPPED
RestartStateKind.RUNNING=RUNNING
RestartStateKind.PREVIOUS=PREVIOUS

Server.services.DebugService.displayName=\u30c7\u30d0\u30c3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9
Server.services.DebugService.description=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u30fb\u30c7\u30d0\u30c3\u30b0\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3068\u4e00\u7dd2\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c7\u30d0\u30c3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DebugService.displayName=\u30c7\u30d0\u30c3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9
DebugService.description=JVM\u3001\u304a\u3088\u3073 BSF \u306a\u3069\u306e\u5404\u7a2e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e\u30c7\u30d0\u30c3\u30b0\u306b\u5fc5\u8981\u306a\u5c5e\u6027\u306e\u30e2\u30c7\u30eb
DebugService.smallIcon=DebugService.gif
DebugService.largeIcon=DebugService32X32.gif
DebugService.jvmDebugPort.displayName=JVM \u30c7\u30d0\u30c3\u30b0\u30fb\u30dd\u30fc\u30c8
DebugService.jvmDebugPort.description=JVM \u304c\u30c7\u30d0\u30c3\u30b0\u63a5\u7d9a\u306e\u305f\u3081\u306b listen \u3059\u308b\u30dd\u30fc\u30c8\u3002  
DebugService.jvmDebugArgs.displayName=JVM \u30c7\u30d0\u30c3\u30b0\u5f15\u304d\u6570
DebugService.jvmDebugArgs.description=JVM \u306b\u30c7\u30d0\u30c3\u30b0\u30fb\u30e2\u30fc\u30c9\u3067\u59cb\u52d5\u3059\u308b\u3053\u3068\u3092\u4f1d\u3048\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c7\u30d0\u30c3\u30b0\u5f15\u304d\u6570\u30b9\u30c8\u30ea\u30f3\u30b0\u3002  
DebugService.debugClassFilters.displayName=\u30c7\u30d0\u30c3\u30b0\u30fb\u30af\u30e9\u30b9\u30fb\u30d5\u30a3\u30eb\u30bf\u30fc
DebugService.debugClassFilters.description=\u3053\u308c\u306f\u3001\u30c7\u30d0\u30c3\u30b0\u4e2d\u306b\u30d5\u30a3\u30eb\u30bf\u30fc\u64cd\u4f5c\u3055\u308c\u308b\u30af\u30e9\u30b9\u306e\u914d\u5217\u3002   \u6bb5\u968e\u7684\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u3057\u305f\u5834\u5408\u3001\u30c7\u30d0\u30c3\u30ac\u30fc\u306f\u30d5\u30a3\u30eb\u30bf\u30fc\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u306b\u4e00\u81f4\u3059\u308b\u30af\u30e9\u30b9\u3067\u505c\u6b62\u3057\u307e\u305b\u3093\u3002  
DebugService.BSFDebugPort.displayName=BSF \u30c7\u30d0\u30c3\u30b0\u30fb\u30dd\u30fc\u30c8
DebugService.BSFDebugPort.description=BSF \u30c7\u30d0\u30c3\u30b0\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e listen \u3092\u958b\u59cb\u3059\u308b\u30dd\u30fc\u30c8\u3002  
DebugService.BSFLoggingLevel.displayName=BSF \u30ed\u30ae\u30f3\u30b0\u30fb\u30ec\u30d9\u30eb
DebugService.BSFLoggingLevel.description=BSF \u30c7\u30d0\u30c3\u30b0\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u63d0\u4f9b\u3059\u308b\u30ed\u30ae\u30f3\u30b0\u306e\u30ec\u30d9\u30eb\u3002
servermanagement.button.add=\u8ffd\u52a0>
BSFLoggingLevel.NOLOGGING=0 - \u30ed\u30ae\u30f3\u30b0\u306a\u3057
BSFLoggingLevel.SOMELOGGING=1 - \u4e00\u90e8\u30ed\u30ae\u30f3\u30b0 
BSFLoggingLevel.MORELOGGING=2 - \u3055\u3089\u306b\u591a\u304f\u306e\u30ed\u30ae\u30f3\u30b0
BSFLoggingLevel.LOTOFLOGGING=3 - \u591a\u304f\u306e\u30ed\u30ae\u30f3\u30b0
DebugService.portchanged.info1=DebugService JVMdebugArgs \u306f\u3001\u6307\u5b9a\u3055\u308c\u305f DebugService debugPort \u3068\u540c\u671f\u3059\u308b\u3088\u3046\u306b\u5909\u66f4\u3055\u308c\u307e\u3057\u305f
DebugService.portchanged.info2= DebugService JVMdebugPort \u306f\u3001\u30a2\u30c9\u30ec\u30b9\u3092\u4f7f\u3063\u3066\u6307\u5b9a\u3055\u308c\u305f JVM \u30c7\u30d0\u30c3\u30ac\u30fc\u30fb\u30dd\u30fc\u30c8\u3068\u540c\u671f\u3059\u308b\u3088\u3046\u306b\u5909\u66f4\u3055\u308c\u307e\u3057\u305f

JMSServer.displayName=JMS \u30b5\u30fc\u30d0\u30fc
JMSServer.description=WebSphere Application Server \u7ba1\u7406\u30c9\u30e1\u30a4\u30f3\u5185\u306e\u30ce\u30fc\u30c9\u306e JMS \u6a5f\u80fd\u306f\u3001\u305d\u306e\u30ce\u30fc\u30c9\u4e0a\u306e JMS \u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002  \u3053\u306e\u30d1\u30cd\u30eb\u3092\u4f7f\u3063\u3066\u3001\u9078\u629e\u3057\u305f JMS \u30b5\u30fc\u30d0\u30fc\u306e\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8868\u793a\u307e\u305f\u306f\u5909\u66f4\u3057\u307e\u3059\u3002
JMSServer.smallIcon=JMSServer.gif
JMSServer.largeIcon=JMSServer32X32.gif
JMSServer.securityPort.displayName=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30dd\u30fc\u30c8\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8
JMSServer.securityPort.description=JMS \u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u5185\u90e8\u7684\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ea\u30b9\u30ca\u30fc\u30fb\u30dd\u30fc\u30c8\u306e TCP/IP \u30dd\u30fc\u30c8\u756a\u53f7\u3002
JMSServer.description.displayName=\u8aac\u660e
JMSServer.description.description=\u7ba1\u7406\u3092\u76ee\u7684\u3068\u3057\u305f\u3001JMS \u30b5\u30fc\u30d0\u30fc\u306e\u8aac\u660e\u3002
JMSServer.numThreads.displayName=\u30b9\u30ec\u30c3\u30c9\u306e\u6570
JMSServer.numThreads.description=Pub/Sub \u30de\u30c3\u30c1\u30f3\u30b0\u30fb\u30a8\u30f3\u30b8\u30f3\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u73fe\u884c\u30b9\u30ec\u30c3\u30c9\u6570\u3002
JMSServer.queueNames.displayName=\u30ad\u30e5\u30fc\u540d
JMSServer.queueNames.description=\u3053\u306e JMS \u30b5\u30fc\u30d0\u30fc\u306b\u3088\u3063\u3066\u30db\u30b9\u30c8\u3055\u308c\u308b\u30ad\u30e5\u30fc\u306e\u540d\u524d\u3002
JMSServer.must.be.selected=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u884c\u3046\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 JMS \u30b5\u30fc\u30d0\u30fc\u3092 1 \u3064\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
jmsserver.cannot.be.started=Embedded Messaging \u304c {0} \u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u306a\u304b\u3063\u305f\u305f\u3081\u3001JMSServer \u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002
JMSTransport.displayName=JMSTransport
JMSTransport.description=
JMSTransport.smallIcon=JMSTransport.gif
JMSTransport.largeIcon=JMSTransport32X32.gif
EndPoint.displayName=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30dd\u30fc\u30c8\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8
EndPoint.description=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30dd\u30fc\u30c8\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u8aac\u660e
EndPoint.host.displayName=\u30db\u30b9\u30c8
EndPoint.host.description=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9 (\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3001JSP\u3001\u307e\u305f\u306f HTML \u30da\u30fc\u30b8\u306a\u3069) \u3092\u8981\u6c42\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b IP \u30a2\u30c9\u30ec\u30b9\u3001\u30c9\u30e1\u30a4\u30f3\u30fb\u30cd\u30fc\u30e0\u30fb\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u306e\u4ed8\u3044\u305f DNS \u30db\u30b9\u30c8\u540d\u3001\u307e\u305f\u306f\u5358\u306a\u308b DNS \u30db\u30b9\u30c8\u540d\u3067\u3059\u3002
EndPoint.port.displayName=\u30dd\u30fc\u30c8
EndPoint.port.description=Web \u30b5\u30fc\u30d0\u30fc\u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8981\u6c42\u3092\u53d7\u4fe1\u3059\u308b\u3088\u3046\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30dd\u30fc\u30c8\u3002 \u30db\u30b9\u30c8\u540d\u3068\u3068\u3082\u306b\u30dd\u30fc\u30c8\u5024\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

NameServer.displayName=\u30cd\u30fc\u30e0\u30fb\u30b5\u30fc\u30d0\u30fc
NameServer.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306e\u8a2d\u5b9a
NameServer.smallIcon=NameServer.gif
NameServer.largeIcon=NameServer32X32.gif
NameServer.bootstrapServerAddress.displayName=bootstrapServerAddress
NameServer.bootstrapServerAddress.description=\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30a2\u30c9\u30ec\u30b9\u306f\u3001\u30cd\u30fc\u30e0\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3067\u3059\u3002 \u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306b\u306f\u3001\u30db\u30b9\u30c8\u540d\u3068\u30dd\u30fc\u30c8\u756a\u53f7\u304c\u7d44\u307f\u8fbc\u307e\u308c\u307e\u3059\u3002  \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u3001\u95a2\u9023\u3057\u305f\u30cd\u30fc\u30e0\u30fb\u30b5\u30fc\u30d0\u30fc\u304b\u3089\u521d\u671f\u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3092\u7372\u5f97\u3059\u308b\u305f\u3081\u306b\u3001\u30d6\u30fc\u30c8\u30b9\u30c8\u30e9\u30c3\u30d7\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30db\u30b9\u30c8\u3068\u30dd\u30fc\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

Service.type.displayName=\u30b5\u30fc\u30d3\u30b9\u30fb\u30bf\u30a4\u30d7
Service.type.description=\u30b5\u30fc\u30d3\u30b9\u306e\u30bf\u30a4\u30d7\u3002
nav.websphere.servers    
Domain.webcontainers.displayName=Web \u30b3\u30f3\u30c6\u30ca\u30fc

webcontainer.description=Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306e\u69cb\u6210
webcontainer.detail.title=Web \u30b3\u30f3\u30c6\u30ca\u30fc
webcontainer.displayName=Web \u30b3\u30f3\u30c6\u30ca\u30fc
webcontainer.threadpool.displayName=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb
webcontainer.sessionmanager.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406
webcontainer.sessionmanager.description=\u3053\u306e Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u95a2\u9023\u3057\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3092\u69cb\u6210\u3057\u307e\u3059
webcontainer.httptransports.displayName=HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8
webcontainer.httptransports.description=\u3053\u306e Web \u30b3\u30f3\u30c6\u30ca\u30fc\u306b\u95a2\u9023\u3057\u305f HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3092\u69cb\u6210\u3057\u307e\u3059
webcontainer.virtualhost.displayName=\u30c7\u30d5\u30a9\u30eb\u30c8\u4eee\u60f3\u30db\u30b9\u30c8:
webcontainer.virtualhost.description=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u4eee\u60f3\u30db\u30b9\u30c8
webcontainer.enableServletCaching.displayName=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306e\u30ad\u30e3\u30c3\u30b7\u30e5
webcontainer.enableServletCaching.description=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u3059\u3002
webcontainer.enableServletCaching.units=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b


ThreadPool.size.units=\u30b9\u30ec\u30c3\u30c9
ThreadPool.inactivityTimeout.displayName=\u30b9\u30ec\u30c3\u30c9\u975e\u6d3b\u52d5\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
ThreadPool.inactivityTimeout.units=\u30df\u30ea\u79d2
ThreadPool.isGrowable.units=\u6700\u5927\u30b9\u30ec\u30c3\u30c9\u30fb\u30b5\u30a4\u30ba\u3092\u8d85\u3048\u305f\u30b9\u30ec\u30c3\u30c9\u5272\u308a\u632f\u308a\u3092\u8a31\u53ef

SessionManager.sessionTracking.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0\u30fb\u30e1\u30ab\u30cb\u30ba\u30e0:
SessionManager.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406
SessionManager.sessionDatabasePersistence.description=\u5206\u6563\u74b0\u5883\u3067\u3001\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059
SessionManager.tuningParams.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc
SessionManager.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u3088\u3063\u3066\u3001HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30b5\u30dd\u30fc\u30c8\u306e\u52d5\u4f5c\u3092\u5236\u5fa1\u3067\u304d\u307e\u3059
SessionManager.sessionTracking.description=HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306e\u305f\u3081\u306e\u30e1\u30ab\u30cb\u30ba\u30e0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SessionManager.overflow.displayName=\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc:
SessionManager.overflow.description=\u30e1\u30e2\u30ea\u30fc\u5185\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u6570\u304c\u300c\u30e1\u30e2\u30ea\u30fc\u5185\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570\u300d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5024\u3092\u8d85\u3048\u308b\u3053\u3068\u3092\u8a31\u53ef\u3059\u308b\u304b\u3069\u3046\u304b\u3002 \u3053\u308c\u306f\u3001\u975e\u6c38\u7d9a\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30e2\u30fc\u30c9\u3067\u306e\u307f\u6709\u52b9\u3067\u3059\u3002
SessionManager.overflow.units=\u30aa\u30fc\u30d0\u30fc\u30d5\u30ed\u30fc\u306e\u8a31\u53ef
SessionManager.sessionCount.displayName=\u30e1\u30e2\u30ea\u30fc\u5185\u306e\u6700\u5927\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30ab\u30a6\u30f3\u30c8:
SessionManager.sessionCount.description=\u30e1\u30e2\u30ea\u30fc\u306b\u4fdd\u6301\u3059\u308b\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u6700\u5927\u6570\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SessionManager.sessionTimeout.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8:
SessionManager.sessionTimeout.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u672a\u4f7f\u7528\u306e\u307e\u307e\u306e\u3068\u304d\u306b\u3001\u3053\u308c\u4ee5\u4e0a\u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u3067\u3042\u308b\u3068\u898b\u306a\u3059\u307e\u3067\u306e\u8a31\u5bb9\u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002   \u300c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u8a2d\u5b9a\u300d\u307e\u305f\u306f\u300c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3057\u300d\u306e\u3044\u305a\u308c\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u300c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u8a2d\u5b9a\u300d\u3092\u9078\u629e\u3057\u305f\u5834\u5408\u3001\u3053\u306e\u5024\u306b\u306f\u5c11\u306a\u304f\u3068\u3082 2 \u5206\u4ee5\u4e0a\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SessionManager.sessionTimeout.noTimeout=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306a\u3057
SessionManager.sessionTimeout.setTimeout=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u8a2d\u5b9a
SessionManager.sessionTimeout.units=\u5206
SessionManager.sessionTracking.sslEnabled=SSL ID \u30c8\u30e9\u30c3\u30ad\u30f3\u30b0\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
SessionManager.sessionTracking.cookiesEnabled=Cookie \u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
SessionManager.sessionTracking.urlRewritingEnabled=URL \u518d\u66f8\u304d\u8fbc\u307f\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
SessionManager.sessionTracking.protocolRewritingEnabled=\u30d7\u30ed\u30c8\u30b3\u30eb\u30fb\u30b9\u30a4\u30c3\u30c1\u518d\u66f8\u304d\u8fbc\u307f\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
SessionManager.sessionCount.units=\u30bb\u30c3\u30b7\u30e7\u30f3
SessionManager.button.modify=\u5909\u66f4...
SessionManager.defaultCookieSettings.displayName=Cookie \u8a2d\u5b9a
SessionManager.persistence.displayName=\u5206\u6563\u74b0\u5883\u8a2d\u5b9a
SessionManager.persistence.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u30fb\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SessionManager.serialAccess.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a2\u30af\u30bb\u30b9\u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba:
SessionManager.serialAccess.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a2\u30af\u30bb\u30b9\u306e\u30b7\u30ea\u30a2\u30e9\u30a4\u30ba\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc (JVM) \u3067\u306e\u4e26\u884c\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a2\u30af\u30bb\u30b9\u3092\u8a8d\u3081\u306a\u3044\u304b\u3069\u3046\u304b\u3092\u793a\u3057\u307e\u3059\u3002
SessionManager.serialAccess.units=\u30b7\u30ea\u30a2\u30eb\u30fb\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b
SessionManager.maxWaitTime.displayName=\u6700\u5927\u5f85\u6a5f\u6642\u9593
SessionManager.maxWaitTime.description=\u6700\u5927\u5f85\u6a5f\u6642\u9593\u306e\u8aac\u660e
SessionManager.maxWaitTime.units=\u79d2\u9593
SessionManager.accessOnTimeout.displayName=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u6642\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30a2\u30af\u30bb\u30b9
SessionManager.accessOnTimeout.description=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306e\u8aac\u660e
SessionManager.accessOnTimeout.units=\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u6642\u306e\u30a2\u30af\u30bb\u30b9\u3092\u8a31\u53ef\u3059\u308b
SessionManager.enable.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306e\u4e0a\u66f8\u304d
SessionManager.enable.description=\u3053\u306e SessionManager \u8a2d\u5b9a\u304c\u73fe\u884c\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u4f7f\u7528\u3055\u308c\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001\u89aa\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306b\u5b9a\u7fa9\u3055\u308c\u305f\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u8a2d\u5b9a\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
SessionManager.enable.units=\u4e0a\u66f8\u304d
SessionManager.securityIntegration.displayName=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u7d71\u5408
SessionManager.securityIntegration.description=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u7d71\u5408\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u5834\u5408\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u30e6\u30fc\u30b6\u30fc\u306e ID \u3092 HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u306b\u95a2\u9023\u4ed8\u3051\u307e\u3059\u3002
SessionManager.securityIntegration.units=\u4f7f\u7528\u53ef\u80fd

Cookie.displayName=Cookie
Cookie.description=HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306e\u305f\u3081\u306e cookie \u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Cookie.secure.displayName=\u30bb\u30ad\u30e5\u30a2 cookie
Cookie.secure.units=Cookie \u3092 HTTPS \u30bb\u30c3\u30b7\u30e7\u30f3\u306b\u5236\u9650\u3057\u307e\u3059
Cookie.domain.displayName=Cookie \u30c9\u30e1\u30a4\u30f3
Cookie.maximumAge.displayName=Cookie \u6700\u5927\u7d4c\u904e\u6642\u9593 :
Cookie.path.displayName=Cookie \u30d1\u30b9
Cookie.name.displayName=Cookie \u540d
Cookie.name.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u7ba1\u7406\u306b\u4f7f\u7528\u3055\u308c\u308b Cookie \u306e\u56fa\u6709\u540d\u3002  \u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u4ed5\u69d8\u3067\u306f\u3001\u3053\u306e\u540d\u524d\u306f JSESSIONID \u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002 \u305f\u3060\u3057\u3001\u3053\u306e\u5024\u306f\u9806\u5fdc\u7684\u306b\u69cb\u6210\u3067\u304d\u307e\u3059\u3002
Cookie.secure.description=\u30bb\u30c3\u30b7\u30e7\u30f3 Cookie \u306b\u30bb\u30ad\u30e5\u30a2\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u304c\u7d44\u307f\u8fbc\u307e\u308c\u3066\u3044\u308b\u304b\u3069\u3046\u304b\u3002 \u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u3068\u3001cookie \u306e\u4ea4\u63db\u304c HTTPS \u30bb\u30c3\u30b7\u30e7\u30f3\u306b\u9650\u5b9a\u3055\u308c\u307e\u3059\u3002
Cookie.domain.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0 Cookie \u306e\u30c9\u30e1\u30a4\u30f3\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u5024\u3002 \u3053\u306e\u5024\u306f\u3001Cookie \u3092\u7279\u5b9a\u30b5\u30fc\u30d0\u30fc\u306b\u9001\u4fe1\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u6307\u793a\u3057\u307e\u3059\u3002 \u305f\u3068\u3048\u3070\u3001\u7279\u5b9a\u306e\u30c9\u30e1\u30a4\u30f3\u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u3001\u30bb\u30c3\u30b7\u30e7\u30f3 Cookie \u306f\u305d\u306e\u30c9\u30e1\u30a4\u30f3\u5185\u306e\u30db\u30b9\u30c8\u306b\u3060\u3051\u9001\u4fe1\u3055\u308c\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30c9\u30e1\u30a4\u30f3\u306f\u30b5\u30fc\u30d0\u30fc\u3067\u3059\u3002
Cookie.maximumAge.description=Cookie \u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u5b58\u7d9a\u3059\u308b\u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u5024\u306f\u3001Cookie \u4ed5\u69d8\u306b\u8a18\u8ff0\u3055\u308c\u3066\u3044\u308b\u5b58\u7d9a\u6642\u9593 (TTL) \u5024\u306b\u5bfe\u5fdc\u3057\u307e\u3059\u3002  
Cookie.path.description=\u3053\u308c\u306f\u3001\u30d1\u30b9\u3092\u57fa\u306b\u3001\u8981\u6c42\u3055\u308c\u305f URI \u306b cookie \u3092\u9001\u4fe1\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u30d6\u30e9\u30a6\u30b6\u30fc\u306b\u6307\u793a\u3057\u307e\u3059\u3002 \u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30d1\u30b9\u3092\u8868\u3059\u4efb\u610f\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 "/" \u306f\u3001\u30eb\u30fc\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u793a\u3057\u307e\u3059\u3002   cookie \u306e\u9001\u4fe1\u5148\u306e\u30d1\u30b9\u3092\u9650\u5b9a\u3059\u308b\u305f\u3081\u306b\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d1\u30b9\u3092\u5236\u9650\u3059\u308b\u3053\u3068\u306b\u3088\u308a\u3001Cookie \u304c\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u7279\u5b9a\u306e URL \u306b\u9001\u4fe1\u3055\u308c\u306a\u3044\u3088\u3046\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \u30eb\u30fc\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u6307\u5b9a\u3059\u308b\u3068\u3001\u6307\u5b9a\u30b5\u30fc\u30d0\u30fc\u306e\u3069\u306e\u30d1\u30b9\u304c\u30a2\u30af\u30bb\u30b9\u3055\u308c\u3066\u3082 Cookie \u304c\u9001\u4fe1\u3055\u308c\u307e\u3059\u3002
Cookie.age.browserSession=\u30ab\u30ec\u30f3\u30c8\u30fb\u30d6\u30e9\u30a6\u30b6\u30fc\u30fb\u30bb\u30c3\u30b7\u30e7\u30f3 
Cookie.age.maximumAge=\u6700\u5927\u7d4c\u904e\u6642\u9593\u306e\u8a2d\u5b9a
Cookie.age.units=\u79d2\u9593

Persistence.displayName=\u5206\u6563\u30bb\u30c3\u30b7\u30e7\u30f3
Persistence.description=\u5206\u6563\u74b0\u5883\u3067\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u4fdd\u7ba1\u3059\u308b\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Persistence.button.modify=\u5909\u66f4...
Persistence.button.advanced=\u62e1\u5f35...
Persistence.none=\u306a\u3057
Persistence.database=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9
Persistence.messaging=\u30e1\u30e2\u30ea\u30fc\u5bfe\u30e1\u30e2\u30ea\u30fc\u8907\u88fd
Persistence.domain=\u5185\u90e8\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30c9\u30e1\u30a4\u30f3:

SessionManager.sessionDRSPersistence.displayName=DRS \u8a2d\u5b9a
DRSSettings.both=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3068\u30b5\u30fc\u30d0\u30fc\u306e\u4e21\u65b9
DRSSettings.bothpp=push \u3068 pull \u306e\u4e21\u65b9
DRSSettings.pull=pull \u306e\u307f
DRSSettings.push=push \u306e\u307f
DRSSettings.none=\u5171\u6709\u3057\u306a\u3044
DRSSettings.client=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306e\u307f
DRSSettings.server=\u30b5\u30fc\u30d0\u30fc\u306e\u307f
DRSSettings.replication.domainSelection=\u6b21\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u3001\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u3092\u9078\u629e\u3057\u307e\u3059
DRSSettings.replication.replicators=\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc: 
DRSSettings.replication.otherDomain=\u5225\u306e\u30c9\u30e1\u30a4\u30f3\u304b\u3089\u3001\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u3092\u9078\u629e\u3057\u307e\u3059
DRSSettings.replication.address=IP \u30a2\u30c9\u30ec\u30b9:
DRSSettings.replication.port=\u30dd\u30fc\u30c8:
DRSSettings.replication.description=Memory to Memory \u8907\u88fd\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002
DRSSettings.replication.displayName=\u8907\u88fd:
DRSSettings.partition.displayName=\u533a\u753b ID \u3092 listen \u3059\u308b:
DRSSettings.partition.description=\u30b5\u30fc\u30d0\u30fc\u30fb\u30e2\u30fc\u30c9\u3067\u5b9f\u884c\u3059\u308b\u5834\u5408\u306b\u3001\u3053\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c Memory To Memory \u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u8907\u88fd\u3092 listen \u3059\u308b\u533a\u753b\u3002  \u300c\u5185\u90e8\u8907\u88fd\u306e\u7ba1\u7406\u300d\u30da\u30fc\u30b8\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u533a\u753b\u306e\u6570\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001\u3059\u3079\u3066\u306e\u533a\u753b\u3092 listen \u3057\u307e\u3059\u3002
DRSSettings.mode.displayName=\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30e2\u30fc\u30c9:
DRSSettings.mode.description=\u30c7\u30fc\u30bf\u306e\u30ec\u30d7\u30ea\u30ab\u751f\u6210\u306e\u5236\u5fa1\u306b\u4f7f\u7528\u3059\u308b\u30e2\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DRSSettings.frequency.displayName=push \u983b\u5ea6
DRSSettings.frequency.description=\u65b0\u898f\u307e\u305f\u306f\u5909\u66f4\u6e08\u307f\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u9805\u76ee\u3092\u4ed6\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u30d7\u30c3\u30b7\u30e5\u3059\u308b\u307e\u3067\u306b\u5f85\u6a5f\u3059\u308b\u6642\u9593 (\u79d2\u5358\u4f4d) \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DRSSettings.frequency.units=\u79d2\u9593
DRSSettings.messaging.displayName=\u5185\u90e8\u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30b5\u30fc\u30d0\u30fc
DRSSettings.messaging.description=\u30c7\u30fc\u30bf\u306e\u8907\u88fd\u5143\u306e\u30c9\u30e1\u30a4\u30f3\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
DRSSettings.noDomains.error=\u8907\u88fd\u30c9\u30e1\u30a4\u30f3\u304c\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u307e\u305b\u3093


SessionDatabasePersistence.displayName=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u8a2d\u5b9a
SessionDatabasePersistence.description=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u8a2d\u5b9a\u306e\u8a18\u8ff0
SessionDatabasePersistence.datasourceJNDIName.displayName=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9 JNDI \u540d:
SessionDatabasePersistence.datasourceJNDIName.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u63a5\u7d9a\u3092\u53d6\u5f97\u3059\u308b\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e JNDI \u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SessionDatabasePersistence.userId.displayName=\u30e6\u30fc\u30b6\u30fc ID:
SessionDatabasePersistence.userId.description=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30a2\u30af\u30bb\u30b9\u306e\u305f\u3081\u306e\u30e6\u30fc\u30b6\u30fc ID\u3002
SessionDatabasePersistence.password.displayName=\u30d1\u30b9\u30ef\u30fc\u30c9:
SessionDatabasePersistence.password.description=\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30fb\u30a2\u30af\u30bb\u30b9\u306e\u305f\u3081\u306e\u30d1\u30b9\u30ef\u30fc\u30c9
SessionDatabasePersistence.password2.displayName=\u78ba\u8a8d\u30d1\u30b9\u30ef\u30fc\u30c9:
SessionDatabasePersistence.password2.description=\u6b63\u3057\u304f\u8a18\u9332\u3055\u308c\u305f\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u3092 2 \u56de\u5165\u529b\u3057\u307e\u3059\u3002
SessionDatabasePersistence.db2RowSize.displayName=DB2 \u884c\u30b5\u30a4\u30ba:
SessionDatabasePersistence.db2RowSize.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c6\u30fc\u30d6\u30eb\u7528\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30c6\u30fc\u30d6\u30eb\u30fb\u30b9\u30da\u30fc\u30b9\u306e\u30da\u30fc\u30b8\u30fb\u30b5\u30a4\u30ba (DB2 \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408)\u3002 \u6307\u5b9a\u53ef\u80fd\u306a\u5024\u306f\u30014\u30018\u300116\u3001\u304a\u3088\u3073 32 K \u30d0\u30a4\u30c8 (KB) \u3067\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u884c\u30b5\u30a4\u30ba\u306f 4K \u30d0\u30a4\u30c8\u3067\u3059\u3002
SessionDatabasePersistence.tableSpaceName.displayName=\u30c6\u30fc\u30d6\u30eb\u30fb\u30b9\u30da\u30fc\u30b9\u540d:
SessionDatabasePersistence.tableSpaceName.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c6\u30fc\u30d6\u30eb\u306b\u4f7f\u7528\u3055\u308c\u308b\u30c6\u30fc\u30d6\u30eb\u30fb\u30b9\u30da\u30fc\u30b9\u3002
SessionDatabasePersistence.multiRowSchema.displayName=\u8907\u6570\u884c\u30b9\u30ad\u30fc\u30de
SessionDatabasePersistence.multiRowSchema.description=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u306e\u5404\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u5185\u306e\u5225\u3005\u306e\u884c\u306b\u7f6e\u304f\u304b\u3069\u3046\u304b\u3002
SessionDatabasePersistence.multiRowSchema.units=\u8907\u6570\u884c\u30b9\u30ad\u30fc\u30de\u3092\u4f7f\u7528\u3059\u308b
SessionDatabasePersistence.passwords.match.error=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u4e00\u81f4\u3057\u307e\u305b\u3093\u3002 \u4e21\u65b9\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u30fb\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u3082\u3046\u4e00\u5ea6\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044


Tuning.displayName=\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc
Tuning.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u5206\u6563\u3055\u308c\u305f\u74b0\u5883\u3067\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u3092\u7ba1\u7406\u3059\u308b\u305f\u3081\u306e\u69d8\u3005\u306a\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30aa\u30d7\u30b7\u30e7\u30f3\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
Tuning.level.displayName=\u30c1\u30e5\u30fc\u30cb\u30f3\u30b0\u30fb\u30ec\u30d9\u30eb:
Tuning.level.description=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306b\u5f71\u97ff\u3059\u308b\u7279\u5b9a\u306e\u4e8b\u524d\u5b9a\u7fa9\u6e08\u307f\u8a2d\u5b9a\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
Tuning.setting.veryHigh=\u975e\u5e38\u306b\u9ad8 (\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u306e\u6700\u9069\u5316)
Tuning.setting.high=\u9ad8
Tuning.setting.medium=\u4e2d
Tuning.setting.low=\u4f4e (\u30d5\u30a7\u30a4\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u6700\u9069\u5316)
Tuning.setting.custom=\u30ab\u30b9\u30bf\u30e0\u8a2d\u5b9a
Tuning.button.modify=\u5909\u66f4...

TuningParams.contents.all=\u3059\u3079\u3066\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u5c5e\u6027
TuningParams.contents.updated=\u66f4\u65b0\u3055\u308c\u305f\u5c5e\u6027\u306e\u307f
TuningParams.frequency.servlet=\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u30fb\u30b5\u30fc\u30d3\u30b9\u306e\u7d42\u4e86
TuningParams.frequency.manual=\u624b\u52d5\u66f4\u65b0
TuningParams.frequency.units=\u79d2\u9593
TuningParams.frequency.timeBased=\u6642\u9593\u57fa\u6e96:
TuningParams.database.displayName=\u5206\u6563\u30bb\u30c3\u30b7\u30e7\u30f3\u306e\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u30fb\u30b9\u30b1\u30b8\u30e5\u30fc\u30eb\u306e\u6307\u5b9a
TuningParams.database.first=\u6700\u521d\u306e\u6642\u523b (0-23):
TuningParams.database.second=2 \u756a\u76ee\u306e\u6642\u523b (0-23):
TuningParams.writeFrequency.displayName=\u66f8\u304d\u8fbc\u307f\u983b\u5ea6
TuningParams.writeContents.displayName=\u66f8\u304d\u8fbc\u307f\u306e\u5185\u5bb9
TuningParams.cleanup.displayName=\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30af\u30ea\u30fc\u30f3\u30a2\u30c3\u30d7\u306e\u30b9\u30b1\u30b8\u30e5\u30fc\u30eb:
TuningParams.cleanup.description=\u5916\u90e8\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u304b\u3089\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u3044\u3064\u6d88\u53bb\u3059\u308b\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

Transport.host.displayName=\u30db\u30b9\u30c8
Transport.port.displayName=\u30dd\u30fc\u30c8            
Transport.host.description=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306b\u5bfe\u3057\u3066\u30d0\u30a4\u30f3\u30c9\u3059\u308b\u30db\u30b9\u30c8 IP \u30a2\u30c9\u30ec\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Transport.port.description=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306b\u5bfe\u3057\u3066\u30d0\u30a4\u30f3\u30c9\u3059\u308b\u30dd\u30fc\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 1 \u304b\u3089 65535 \u307e\u3067\u306e\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30dd\u30fc\u30c8\u756a\u53f7\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u30de\u30b7\u30f3\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3054\u3068\u306b\u3001\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
Transport.sslEnabled.units=SSL \u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b

DynamicCache.startup.displayName=\u59cb\u52d5\u72b6\u614b:
DynamicCache.startup.description=\u30b5\u30fc\u30d0\u30fc\u306e\u59cb\u52d5\u6642\u306b\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30fc\u30d3\u30b9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u5834\u5408\u306f\u3001\u30c1\u30a7\u30c3\u30af\u30fb\u30dc\u30c3\u30af\u30b9\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002
DynamicCache.startup.units=\u30b5\u30fc\u30d0\u30fc\u59cb\u52d5\u6642\u306b\u30b5\u30fc\u30d3\u30b9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
DynamicCache.cacheSize.displayName=\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b5\u30a4\u30ba
DynamicCache.defaultPriority.displayName=\u30c7\u30d5\u30a9\u30eb\u30c8\u512a\u5148\u9806\u4f4d
DynamicCache.diskoffload.displayName=\u30c7\u30a3\u30b9\u30af\u30fb\u30aa\u30d5\u30ed\u30fc\u30c9:
DynamicCache.diskoffload.description=\u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u3001\u52d5\u7684\u30ad\u30e3\u30c3\u30b7\u30e5\u3067\u306f\u3001\u30e1\u30e2\u30ea\u30fc\u3067\u69cb\u6210\u3055\u308c\u305f\u30a8\u30f3\u30c8\u30ea\u30fc\u6570\u306e\u307f\u304c\u4fdd\u6301\u3055\u308c\u307e\u3059\u3002 \u30ad\u30e3\u30c3\u30b7\u30e5\u304c\u30d5\u30eb\u3067\u3042\u308b\u9593\u306b\u65b0\u898f\u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u4f5c\u6210\u3055\u308c\u305f\u5834\u5408\u306f\u3001\u5404\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u306b\u69cb\u6210\u3055\u308c\u305f\u512a\u5148\u9806\u4f4d\u3092\u3001LRU \u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3068\u4e00\u7dd2\u306b\u4f7f\u7528\u3057\u3066\u3001\u30ad\u30e3\u30c3\u30b7\u30e5\u304b\u3089\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u9664\u53bb\u3057\u307e\u3059\u3002 \u30e1\u30e2\u30ea\u30fc\u304b\u3089\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u9664\u53bb\u3059\u308b\u4ee3\u308f\u308a\u306b\u30c7\u30a3\u30b9\u30af\u306e\u30aa\u30d5\u30ed\u30fc\u30c9\u3092\u69cb\u6210\u3067\u304d\u307e\u3059\u3002\u30a8\u30f3\u30c8\u30ea\u30fc\u306f\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0 (\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u69cb\u6210\u53ef\u80fd) \u306b\u30b3\u30d4\u30fc\u3055\u308c\u3001\u5f8c\u304b\u3089\u306e\u30a2\u30af\u30bb\u30b9\u304c\u53ef\u80fd\u3067\u3059\u3002
DynamicCache.diskoffload.enable=\u30c7\u30a3\u30b9\u30af\u30fb\u30aa\u30d5\u30ed\u30fc\u30c9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
DynamicCache.diskoffload.location=\u30aa\u30d5\u30ed\u30fc\u30c9\u4f4d\u7f6e:
DynamicCache.diskoffload.hashSize=\u30cf\u30c3\u30b7\u30e5\u30fb\u30b5\u30a4\u30ba:
DynamicCache.cachereplication.displayName=\u30ad\u30e3\u30c3\u30b7\u30e5\u8907\u88fd:
DynamicCache.cachereplication.description=\u3053\u3053\u3067\u30ad\u30e3\u30c3\u30b7\u30e5\u8907\u88fd\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u3059
DynamicCache.cachereplication.enable=\u30ad\u30e3\u30c3\u30b7\u30e5\u8907\u88fd\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
DynamicCache.cachereplication.advanced=\u62e1\u5f35...
DynamicCache.cacheGroups.displayName=\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7

ExternalCacheGroup.name.displayName=\u540d\u524d
ExternalCacheGroup.type.displayName=\u578b
ExternalCacheGroup.displayName=\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7
ExternalCacheGroup.members.displayName=\u5916\u90e8\u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30b0\u30eb\u30fc\u30d7\u30fb\u30e1\u30f3\u30d0\u30fc

ExternalCacheGroupMember.address.displayName=\u30a2\u30c9\u30ec\u30b9
ExternalCacheGroupMember.adapterBeanName.displayName=\u30a2\u30c0\u30d7\u30bf\u30fc Bean \u540d

ObjectRequestBroker.displayName=ORB \u30b5\u30fc\u30d3\u30b9
ObjectRequestBroker.description=\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u30fb\u30ea\u30af\u30a8\u30b9\u30c8\u30fb\u30d6\u30ed\u30fc\u30ab\u30fc (ORB) \u306e\u69cb\u6210\u8a2d\u5b9a\u3002
ObjectRequestBroker.smallIcon=ObjectRequestBroker.gif
ObjectRequestBroker.largeIcon=ObjectRequestBroker32X32.gif
ObjectRequestBroker.interceptors.displayName=\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc
ObjectRequestBroker.interceptors.description=IIOP \u8981\u6c42\u306e\u5ea6\u306b ORB \u304c\u547c\u3073\u51fa\u3059\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc\u306e\u30ea\u30b9\u30c8\u3002
ObjectRequestBroker.plugins.displayName=\u30d7\u30e9\u30b0\u30a4\u30f3
ObjectRequestBroker.plugins.description=ORB \u306e\u521d\u671f\u5316\u4e2d\u306b ORB \u304c\u547c\u3073\u51fa\u3059\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u30ea\u30b9\u30c8\u3002
ObjectRequestBroker.lsdConnection.displayName=lsdConnection
ObjectRequestBroker.lsdConnection.description=\u9593\u63a5\u7684 IOR \u306e\u89e3\u6c7a\u306b\u5fc5\u8981\u306a\u5834\u5408\u306b ORB \u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30e2\u30f3\u3078\u306e\u53c2\u7167\u3002
ObjectRequestBroker.threadPool.displayName=\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb
ObjectRequestBroker.threadPool.description=ORB \u306e\u30b9\u30ec\u30c3\u30c9\u30fb\u30d7\u30fc\u30eb\u8a2d\u5b9a\u3002
ObjectRequestBroker.ssl.displayName=ssl
ObjectRequestBroker.ssl.description=\u30bb\u30ad\u30e5\u30a2\u30fb\u30bd\u30b1\u30c3\u30c8\u30fb\u30ec\u30a4\u30e4\u30fc\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
ObjectRequestBroker.requestTimeout.displayName=\u8981\u6c42\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
ObjectRequestBroker.requestTimeout.units=\u79d2\u9593
ObjectRequestBroker.requestTimeout.description=\u8981\u6c42\u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308b\u307e\u3067\u5f85\u6a5f\u3059\u308b\u6642\u9593 (\u79d2\u5358\u4f4d)\u3002
ObjectRequestBroker.requestRetriesCount.displayName=\u8981\u6c42\u518d\u8a66\u884c\u30ab\u30a6\u30f3\u30c8
ObjectRequestBroker.requestRetriesCount.units=\u518d\u8a66\u884c
ObjectRequestBroker.requestRetriesCount.description=\u30b5\u30fc\u30d0\u30fc\u304c\u5931\u6557\u3057\u305f\u5834\u5408\u3001ORB \u304c\u8981\u6c42\u306e\u9001\u4fe1\u3092\u8a66\u884c\u3059\u308b\u56de\u6570\u3002 \u518d\u8a66\u884c\u306b\u3088\u308a\u3001\u4e00\u6642\u7684\u306a\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u969c\u5bb3\u304c\u30ea\u30ab\u30d0\u30ea\u30fc\u3059\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002
ObjectRequestBroker.requestRetriesDelay.displayName=\u8981\u6c42\u518d\u8a66\u884c\u306e\u9045\u5ef6
ObjectRequestBroker.requestRetriesDelay.units=\u30df\u30ea\u79d2
ObjectRequestBroker.requestRetriesDelay.description=\u8981\u6c42\u518d\u8a66\u884c\u6642\u9593 (\u30df\u30ea\u79d2\u5358\u4f4d) \u3002
ObjectRequestBroker.connectionCacheMaximum.displayName=\u63a5\u7d9a\u30ad\u30e3\u30c3\u30b7\u30e5\u6700\u5927
ObjectRequestBroker.connectionCacheMaximum.units=\u63a5\u7d9a
ObjectRequestBroker.connectionCacheMaximum.description=\u30b5\u30fc\u30d3\u30b9\u306e\u63a5\u7d9a\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u5360\u6709\u3092\u8a31\u53ef\u3055\u308c\u308b\u6700\u5927\u63a5\u7d9a\u6570\u3002
ObjectRequestBroker.connectionCacheMinimum.displayName=\u63a5\u7d9a\u30ad\u30e3\u30c3\u30b7\u30e5\u6700\u5c0f
ObjectRequestBroker.connectionCacheMinimum.units=\u63a5\u7d9a
ObjectRequestBroker.connectionCacheMinimum.description=\u30b5\u30fc\u30d3\u30b9\u306e\u63a5\u7d9a\u30ad\u30e3\u30c3\u30b7\u30e5\u306e\u5360\u6709\u3092\u8a31\u53ef\u3055\u308c\u308b\u6700\u5c0f\u63a5\u7d9a\u6570\u3002
ObjectRequestBroker.commTraceEnabled.displayName=ORB \u30c8\u30ec\u30fc\u30b9
ObjectRequestBroker.commTraceEnabled.description=ORB GIOP \u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u30c8\u30ec\u30fc\u30b9\u3002 ORB \u30c8\u30ec\u30fc\u30b9\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u3053\u306e\u8a2d\u5b9a\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
ObjectRequestBroker.locateRequestTimeout.displayName=\u4f4d\u7f6e\u6307\u5b9a\u8981\u6c42\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
ObjectRequestBroker.locateRequestTimeout.description=LocateRequest \u30e1\u30c3\u30bb\u30fc\u30b8\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308b\u307e\u3067\u5f85\u6a5f\u3059\u308b\u6642\u9593 (\u79d2\u5358\u4f4d)\u3002
ObjectRequestBroker.forceTunnel.displayName=\u30c8\u30f3\u30cd\u30eb\u306e\u5f37\u5236
ObjectRequestBroker.forceTunnel.description=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8 ORB \u304c HTTP \u30c8\u30f3\u30cd\u30eb\u306e\u4f7f\u7528\u3092\u8a66\u884c\u3059\u308b\u65b9\u6cd5\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002
ForceTunnelMode.WHENREQUIRED=WHENREQUIRED
ForceTunnelMode.ALWAYS=ALWAYS
ForceTunnelMode.NEVER=NEVER                             
ObjectRequestBroker.tunnelAgentURL.displayName=\u30c8\u30f3\u30cd\u30eb\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8 URL
ObjectRequestBroker.tunnelAgentURL.description=HTTP \u30c8\u30f3\u30cd\u30ea\u30f3\u30b0\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u306e URL\u3002\u300c\u30c8\u30f3\u30cd\u30ea\u30f3\u30b0\u3092\u5f37\u5236\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u304c ALWAYS \u307e\u305f\u306f WHENREQUIRED \u306b\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306b\u306e\u307f\u5fc5\u8981\u3067\u3059\u3002\u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u306f\u3001ORB \u306b\u3088\u3063\u3066\u7121\u8996\u3055\u308c\u307e\u3059\u3002
ObjectRequestBroker.noLocalCopies.displayName=\u53c2\u7167\u306b\u3088\u308b\u53d7\u3051\u6e21\u3057
ObjectRequestBroker.noLocalCopies.description=\u3053\u308c\u304c\u4f7f\u7528\u53ef\u80fd\u306e\u5834\u5408\u306f\u3001ORB \u304c\u3001\u5024\u3067\u306f\u306a\u304f\u3001\u53c2\u7167\u306b\u3088\u3063\u3066\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3092\u6e21\u3059\u3053\u3068\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u305d\u308c\u306b\u3088\u3063\u3066\u3001\u30b3\u30d4\u30fc\u30fb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u30d0\u30a4\u30d1\u30b9\u3055\u308c\u307e\u3059\u3002 \u4e88\u671f\u3057\u306a\u3044\u52d5\u4f5c\u304c\u8d77\u3053\u308b\u53ef\u80fd\u6027\u304c\u3042\u308b\u306e\u3067\u3001\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u5834\u5408\u306f\u6c17\u3092\u4ed8\u3051\u3066\u304f\u3060\u3055\u3044\u3002
ObjectRequestBroker.externalConfigURL.displayName=externalConfigURL
ObjectRequestBroker.externalConfigURL.description=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u8aac\u660e\u306f\u3042\u308a\u307e\u305b\u3093\u3002
ObjectRequestBroker.properties.description=\u69cb\u6210\u53ef\u80fd\u306a\u3053\u306e\u30b5\u30fc\u30d3\u30b9\u306b\u5bfe\u3059\u308b\u8ffd\u52a0\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002 \u8ffd\u52a0\u306e\u30ab\u30b9\u30bf\u30e0 ORB \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u3053\u306e\u30d1\u30cd\u30eb\u3067\u8ffd\u52a0\u3067\u304d\u307e\u3059\u3002 \u305f\u3060\u3057\u3001IBM \u30c6\u30af\u30cb\u30ab\u30eb\u30fb\u30b5\u30dd\u30fc\u30c8\u306e\u62c5\u5f53\u8005\u306b\u6307\u793a\u3055\u308c\u306a\u3044\u9650\u308a\u3001\u88fd\u54c1\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6642\u306b\u8a2d\u5b9a\u3055\u308c\u305f\u30c7\u30d5\u30a9\u30eb\u30c8\u5024\u3092\u5909\u66f4\u307e\u305f\u306f\u524a\u9664\u3057\u306a\u3044\u3053\u3068\u3092\u5f37\u304f\u304a\u52e7\u3081\u3057\u307e\u3059\u3002
ORBPlugin.displayName=ORBPlugin
ORBPlugin.description=ORB \u3092\u62e1\u5f35\u3059\u308b\u305f\u3081\u306b\u30ab\u30b9\u30bf\u30e0\u30fb\u30b3\u30fc\u30c9\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u30d7\u30e9\u30b0\u30a4\u30f3\u306f\u3001\u30ab\u30b9\u30bf\u30e0\u30fb\u30ed\u30b8\u30c3\u30af\u3092\u542b\u3080\u30af\u30e9\u30b9\u3092\u53d6\u308a\u8fbc\u307f\u307e\u3059\u3002  \u30b5\u30fc\u30d0\u30fc\u306e\u521d\u671f\u5316\u4e2d\u306b\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u540d\u524d\u3092\u53d6\u5f97\u3057\u3001com.ibm.CORBA.ORBPluginClass.XXX \u3092\u524d\u306b\u4ed8\u52a0\u3057\u307e\u3059\u3002
ORBPlugin.smallIcon=ORBPlugin.gif
ORBPlugin.largeIcon=ORBPlugin32X32.gif
ORBPlugin.name.displayName=\u540d\u524d
ORBPlugin.name.description=\u30ed\u30fc\u30c9\u304a\u3088\u3073\u521d\u671f\u5316\u3059\u308b\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u300c\u4fee\u98fe\u306e\u306a\u3044\u300d\u30af\u30e9\u30b9\u540d\u3002
Interceptor.displayName=\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc
Interceptor.description=\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc\u306f\u3001ORB \u306b\u3088\u308a\u3001IIOP \u8981\u6c42\u306e\u5ea6\u306b\u547c\u3073\u51fa\u3055\u308c\u307e\u3059\u3002
Interceptor.smallIcon=Interceptor.gif
Interceptor.largeIcon=Interceptor32X32.gif
Interceptor.name.displayName=\u540d\u524d
Interceptor.name.description=\u30a4\u30f3\u30bf\u30fc\u30bb\u30d7\u30bf\u30fc\u306e\u30af\u30e9\u30b9\u540d\u3002
LSDConnection.displayName=LSDConnection
LSDConnection.description=LocationServiceDaemon \u3078\u306e\u63a5\u7d9a\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  LSD \u306f\u3001\u56fa\u5b9a\u30dd\u30fc\u30c8\u4e0a\u3067 listen \u3057\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u3067\u3001\u8981\u6c42\u3092\u51e6\u7406\u3057\u3066\u6c38\u7d9a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u53c2\u7167\u3092\u691c\u51fa\u3057\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u3092\u9069\u5207\u306a\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3057\u307e\u3059\u3002  LSD \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u69cb\u6210\u306b\u3064\u3044\u3066\u306f\u3001LocationServiceDaemonServer \u30b5\u30fc\u30d0\u30fc\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LSDConnection.smallIcon=LSDConnection.gif
LSDConnection.largeIcon=LSDConnection32X32.gif
LSDConnection.endPoint.displayName=endPoint
LSDConnection.endPoint.description=
LSDConnection.mode.displayName=\u30e2\u30fc\u30c9
LSDConnection.mode.description=\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30c7\u30fc\u30e2\u30f3\u306e\u30e2\u30fc\u30c9\u3002
LSDMode.NONE=NONE
LSDMode.IMPLICIT_CLIENT=IMPLICIT_CLIENT
LSDMode.EXPLICIT_CLIENT=EXPLICIT_CLIENT
LSDMode.PROVIDER=PROVIDER

Server.errorStreamRedirect.displayName=\u30a8\u30e9\u30fc\u30fb\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
Server.errorStreamRedirect.description=System.err \u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u8a2d\u5b9a
Server.outputStreamRedirect.displayName=\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
Server.outputStreamRedirect.description=System.out \u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u8a2d\u5b9a
Server.clusterName.displayName=\u30af\u30e9\u30b9\u30bf\u30fc\u540d
Server.clusterName.description=\u30b5\u30fc\u30d0\u30fc\u304c\u30af\u30e9\u30b9\u30bf\u30fc\u306e\u4e00\u90e8\u3067\u3042\u308b\u5834\u5408\u3001\u30af\u30e9\u30b9\u30bf\u30fc\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Server.modelId.displayName=modelId
Server.modelId.description=
StreamRedirect.displayName= \u30b9\u30c8\u30ea\u30fc\u30e0\u30fb\u30ea\u30c0\u30a4\u30ec\u30af\u30c8
StreamRedirect.description=\u6a19\u6e96 Java \u5165\u51fa\u529b\u30b9\u30c8\u30ea\u30fc\u30e0\u306e\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.smallIcon=StreamRedirect.gif
StreamRedirect.largeIcon=StreamRedirect32X32.gif
StreamRedirect.fileName.displayName=\u30d5\u30a1\u30a4\u30eb\u540d
StreamRedirect.fileName.description=\u30b9\u30c8\u30ea\u30fc\u30e0\u3092\u30ea\u30c0\u30a4\u30ec\u30af\u30c8\u3059\u308b\u5148\u306e\u30d5\u30a1\u30a4\u30eb\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.rolloverType.displayName=\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u30fb\u30bf\u30a4\u30d7
StreamRedirect.rolloverType.description=\u3069\u306e\u30bf\u30a4\u30d7\u306e\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u30fb\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u304c\u7528\u3044\u3089\u308c\u3066\u3044\u308b\u306e\u304b\u3092\u793a\u3057\u307e\u3059\u3002
StreamRedirect.maxNumberOfBackupFiles.displayName=\u30d0\u30c3\u30af\u30a2\u30c3\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u6700\u5927\u6570
StreamRedirect.maxNumberOfBackupFiles.description=\u30a2\u30fc\u30ab\u30a4\u30d6\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u6570\u3002
StreamRedirect.rolloverSize.displayName=\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u30fb\u30b5\u30a4\u30ba
StreamRedirect.rolloverSize.description=\u30b5\u30a4\u30ba\u30fb\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u306e\u30b5\u30a4\u30ba\u3092\u30e1\u30ac\u30d0\u30a4\u30c8\u5358\u4f4d\u3067\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.baseHour.displayName=\u57fa\u672c\u6642\u9593
StreamRedirect.baseHour.description=\u6642\u9593\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u304c\u958b\u59cb\u3059\u308b\u6642\u523b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.rolloverPeriod.displayName=\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u671f\u9593
StreamRedirect.rolloverPeriod.description=\u6642\u9593\u30d9\u30fc\u30b9\u306e\u30ed\u30fc\u30eb\u30aa\u30fc\u30d0\u30fc\u671f\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.formatWrites.displayName=\u66f8\u304d\u8fbc\u307f\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8
StreamRedirect.formatWrites.description=\u66f8\u304d\u8fbc\u307f\u304c\u3001Websphere \u30ed\u30b0\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u306e\u3088\u3046\u306b\u3001\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3055\u308c\u308b\u5fc5\u8981\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.messageFormatKind.displayName=\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u7a2e\u985e
StreamRedirect.messageFormatKind.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u306b\u5bfe\u3059\u308b\u671b\u307f\u306e\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u3002 \u6709\u52b9\u306a\u5024\u306f\u3001\u57fa\u672c\u3068\u62e1\u5f35\u3067\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u57fa\u672c\u3067\u3059\u3002
StreamRedirect.suppressWrites.displayName=\u66f8\u304d\u8fbc\u307f\u6291\u5236
StreamRedirect.suppressWrites.description=\u3053\u306e\u30b9\u30c8\u30ea\u30fc\u30e0\u3078\u306e\u66f8\u304d\u8fbc\u307f\u3092\u6291\u5236\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
StreamRedirect.suppressStackTrace.displayName=\u30b9\u30bf\u30c3\u30af\u30fb\u30c8\u30ec\u30fc\u30b9\u306e\u6291\u5236
StreamRedirect.suppressStackTrace.description=\u4f8b\u5916\u30e1\u30c3\u30bb\u30fc\u30b8\u3060\u3051\u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30b9\u30bf\u30c3\u30af\u30fb\u30c8\u30ec\u30fc\u30b9\u3092\u7f6e\u304d\u63db\u3048\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f false \u3067\u3059\u3002 (\u6291\u6b62\u306a\u3057)
ManagedObject.displayName=\u7ba1\u7406\u4e0b\u306e\u30aa\u30d6\u30b8\u30a7\u30af\u30c8
ManagedObject.description=\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u30fb\u30d7\u30ed\u30bb\u30b9\u304c\u7ba1\u7406\u53ef\u80fd\u306a\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u69cb\u6210\u3092\u8868\u3057\u307e\u3059\u3002
ManagedObject.smallIcon=ManagedObject.gif
ManagedObject.largeIcon=ManagedObject32X32.gif
ManagedObject.stateManagement.displayName=\u72b6\u614b\u7ba1\u7406
ManagedObject.statisticsProvider.displayName=\u7d71\u8a08\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
ManagedObject.statisticsProvider.description=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e1\u30c8\u30ea\u30c3\u30af\u3092\u751f\u6210\u3059\u308b\u7ba1\u7406\u6e08\u307f\u30ea\u30bd\u30fc\u30b9\u306e\u6a5f\u80fd\u3002
server.stop.title=\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u4e2d
server.stop.warning1=\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u7ba1\u7406\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u4e2d\u3067\u3059\u3002
server.stop.warning2=\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3059\u308b\u3068\u3001\u73fe\u5728\u306e HTTP \u30bb\u30c3\u30b7\u30e7\u30f3\u304b\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u3066\u3001\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u306e\u3053\u306e\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f7f\u7528\u3067\u304d\u306a\u304f\u306a\u308a\u307e\u3059\u3002
server.stop.warning3=\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u3092\u518d\u59cb\u52d5\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001LTPA cookie \u304c\u5f15\u304d\u7d9a\u304d\u6709\u52b9\u306a\u3068\u304d\u306b\u3001\u6b21\u56de\u30d7\u30ed\u30f3\u30d7\u30c8\u304c\u51fa\u3055\u308c\u306a\u304f\u3066\u3082\u3001\u30d6\u30e9\u30a6\u30b6\u30fc\u3067\u30ed\u30b0\u30a4\u30f3\u3067\u304d\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002  LTPA cookie \u306f\u30b7\u30f3\u30b0\u30eb\u30fb\u30b5\u30a4\u30f3\u30aa\u30f3 (\u8907\u6570\u30b5\u30fc\u30d0\u30fc\u4f7f\u7528) \u5411\u3051\u306e\u305f\u3081\u3001\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u306e\u30ed\u30b0\u30a2\u30a6\u30c8\u6642\u306b\u30d6\u30e9\u30a6\u30b6\u30fc\u304b\u3089\u9664\u53bb\u3055\u308c\u307e\u305b\u3093\u3002
goodbye.title=\u3055\u3088\u3046\u306a\u3089
goodbye.message1=WebSphere \u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u3092\u3054\u4f7f\u7528\u3044\u305f\u3060\u304d\u3001\u3042\u308a\u304c\u3068\u3046\u3054\u3056\u3044\u307e\u3059\u3002
Server.services.PMIService.displayName=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9
Server.services.PMIService.description=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u306e\u4f7f\u7528\u53ef\u80fd\u6027\u3001PMI \u30e2\u30b8\u30e5\u30fc\u30eb\u306e\u9078\u629e\u3001\u304a\u3088\u3073\u30e2\u30cb\u30bf\u30fc\u30fb\u30ec\u30d9\u30eb\u306e\u8a2d\u5b9a\u3092\u542b\u3081\u3001\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
PMIService.displayName=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9
PMIService.description=Performance Monitoring Infrastructure (PMI) \u306e\u69cb\u6210\u3068\u30e9\u30f3\u30bf\u30a4\u30e0\u8a2d\u5b9a
PMIService.smallIcon=PMIService.gif
PMIService.largeIcon=PMIService32X32.gif
PMIService.initialSpecLevel.displayName=\u521d\u671f\u4ed5\u69d8\u30ec\u30d9\u30eb
PMIService.initialSpecLevel.description=\u30b5\u30fc\u30d0\u30fc\u5185\u306e\u3059\u3079\u3066\u306e\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306e PMI \u4ed5\u69d8\u30ec\u30d9\u30eb\u3092\u4fdd\u7ba1\u3057\u3066\u3044\u308b Performance Monitoring Infrastructure (PMI) \u4ed5\u69d8\u30b9\u30c8\u30ea\u30f3\u30b0\u3002\u30ec\u30d9\u30eb N\u3001L\u3001M\u3001H\u3001X \u306f\u3001\u305d\u308c\u305e\u308c\u3001\u306a\u3057\u3001\u4f4e\u3001\u4e2d\u3001\u9ad8\u3001\u6700\u5927\u3092\u8868\u3057\u307e\u3059\u3002
PMIService.modules=PMI \u30e2\u30b8\u30e5\u30fc\u30eb
PMIService.monitoringLevel=\u30e2\u30cb\u30bf\u30fc\u30fb\u30ec\u30d9\u30eb
PMIService.specification=\u4ed5\u69d8
PMIService.mbean.notFound=\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u306e\u8a2d\u5b9a\u3092\u691c\u51fa\u3067\u304d\u307e\u305b\u3093\u3002\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u5bfe\u3057\u3066\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u30fb\u30e2\u30cb\u30bf\u30fc\u30fb\u30b5\u30fc\u30d3\u30b9\u304c\u4f7f\u7528\u53ef\u80fd\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PMIService.invalidSetting=\u3053\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306b\u5bfe\u3059\u308b\u8a2d\u5b9a\u304c\u7121\u52b9\u3067\u3057\u305f\u3002
PMIService.thevalidSettings=N (\u306a\u3057)\u3001L (\u4f4e)\u3001M (\u4e2d)\u3001H (\u9ad8)\u3001\u307e\u305f\u306f X (\u6700\u5927) \u306e\u3044\u305a\u308c\u304b\u3092\u5165\u529b\u3057\u307e\u3059\u3002
PMIService.LevelNone=\u306a\u3057 - \u4e0b\u306e\u3059\u3079\u3066\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f &quot;N&quot; (\u306a\u3057) \u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
PMIService.LevelStandard=\u6a19\u6e96 - \u4e0b\u306e\u3059\u3079\u3066\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u306f &quot;H&quot; (\u9ad8) \u306b\u8a2d\u5b9a\u3055\u308c\u307e\u3059\u3002
PMIService.LevelCustom=\u30ab\u30b9\u30bf\u30e0 - \u4e0b\u306e\u30ea\u30b9\u30c8\u306e\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u5909\u66f4\u3001\u8ffd\u52a0\u3001\u307e\u305f\u306f\u9664\u53bb\u3057\u307e\u3059\u3002


distmanagement.appserver.create.new=\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u4f5c\u6210
distmanagement.appserver.create.new.description=\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u4f5c\u6210
appserver.new.step1=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306e\u9078\u629e
appserver.new.step2=\u30ce\u30fc\u30c9\u306e\u9078\u629e
appserver.new.step3=\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u78ba\u8a8d
distmanagement.button.edit=\u7de8\u96c6
appserver.selectAppServer.msg1=\u65e2\u5b58\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u3001\u65b0\u898f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3068\u3057\u3066\u9078\u629e\u3059\u308b\u304b\u3001\u3042\u308b\u3044\u306f\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002
appserver.selectAppServer.msg3=\u30ce\u30fc\u30c9\u306e\u9078\u629e
appserver.selectAppServer.msg4=\u3053\u306e\u30b9\u30c6\u30c3\u30d7\u306b\u3064\u3044\u3066\u3001\u3088\u308a\u8a73\u3057\u3044\u60c5\u5831\u3092\u8868\u793a\u3057\u307e\u3059
appserver.selectAppServer.msg5=\u3053\u306e\u30b9\u30c6\u30c3\u30d7\u3067\u9078\u629e\u3057\u305f\u30ce\u30fc\u30c9\u306f\u3001\u4f7f\u7528\u53ef\u80fd\u306a\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u3092\u6c7a\u5b9a\u3057\u3001\u6b21\u306e\u30b9\u30c6\u30c3\u30d7\u3067\u306f\u305d\u308c\u3089\u306e\u30d7\u30ed\u30bb\u30b9\u304b\u3089\u9078\u629e\u3057\u307e\u3059\u3002
appserver.selectAppServer.msg6=\u30b5\u30fc\u30d0\u30fc\u306e\u8ad6\u7406\u540d\u3002 \u540d\u524d\u306f\u30bb\u30eb\u5185\u3067\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
appserver.selectAppServer.msg7=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u306e\u9078\u629e
appserver.selectAppServer.msg8=\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc
appserver.selectAppServer.msg9=\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3068\u3057\u3066\u4f7f\u7528\u3059\u308b\u3068\u3001\u57fa\u672c\u7684\u306b\u306f\u3001\u9078\u629e\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u306e\u69cb\u6210\u3092\u30b3\u30d4\u30fc\u3057\u307e\u3059\u3002
appserver.selectAppServer.msg10=\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8
appserver.selectAppServer.errormsg1=\u30b5\u30fc\u30d0\u30fc\u540d\u304c\u5fc5\u8981\u3067\u3059
appserver.selectAppServer.errormsg2={0} \u306f\u30ce\u30fc\u30c9 {1} \u5185\u306b\u5b58\u5728\u3057\u307e\u3059
appserver.selectAppServer.copyApps1=\u30de\u30c3\u30d7\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 
appserver.selectAppServer.copyApps2=\u65e2\u5b58\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u304b\u3089\u306e\u30de\u30c3\u30d7\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
appserver.selectAppServer.copyApps3=\u3053\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306f\u3001\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3068\u3057\u3066\u3001\u300c\u65e2\u5b58\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u300d\u3092\u9078\u629e\u3057\u305f\u5834\u5408\u306e\u307f\u9069\u7528\u3055\u308c\u307e\u3059\u3002\u9078\u629e\u3055\u308c\u308b\u3068\u3001\u524d\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3001\u30bd\u30fc\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u3067\u5b9f\u884c\u3059\u308b\u3088\u3046\u306b\u30de\u30c3\u30d7\u3055\u308c\u3066\u3044\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u540c\u69d8\u306b\u65b0\u3057\u3044\u30b5\u30fc\u30d0\u30fc\u3067\u5b9f\u884c\u3059\u308b\u3088\u3046\u306b\u81ea\u52d5\u7684\u306b\u30de\u30c3\u30d7\u3055\u308c\u3001\u524d\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831 (\u30e6\u30fc\u30b6\u30fc\u304a\u3088\u3073\u30b0\u30eb\u30fc\u30d7\u306e\u5272\u308a\u5f53\u3066\u306a\u3069) \u306f\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002\u3053\u308c\u306f\u3001\u540c\u3058\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30d0\u30a4\u30ca\u30ea\u30fc\u3092\u3001\u7570\u306a\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u540d\u3067\u65b0\u898f\u30b5\u30fc\u30d0\u30fc\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3059\u308b\u306e\u3068\u306f\u7570\u306a\u308a\u307e\u3059\u3002 \u305d\u306e\u5834\u5408\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5bfe\u3059\u308b\u5225\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306e\u30b3\u30d4\u30fc\u304c\u4fdd\u5b88\u3055\u308c\u307e\u3059\u3002
generate.unique.ports=\u56fa\u6709 HTTP \u30dd\u30fc\u30c8\u306e\u751f\u6210
generate.unique.ports.desc=\u30bd\u30fc\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u3059\u3079\u3066\u306e HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306b\u5bfe\u3057\u3066\u56fa\u6709\u30dd\u30fc\u30c8\u756a\u53f7\u3092\u751f\u6210\u3057\u307e\u3059\u3002\u3053\u308c\u306b\u3088\u308a\u4f5c\u6210\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u306f\u3001\u30aa\u30ea\u30b8\u30ca\u30eb\u306e\u30b5\u30fc\u30d0\u30fc\u307e\u305f\u306f\u540c\u4e00\u30ce\u30fc\u30c9\u4e0a\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30b5\u30fc\u30d0\u30fc\u3068\u7af6\u5408\u3059\u308b HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3092\u6301\u3061\u307e\u305b\u3093\u3002
generate.unique.ports.label=HTTP \u30dd\u30fc\u30c8
appserver.selectAppServer.serverName=\u30b5\u30fc\u30d0\u30fc\u540d
appserver.confirmAppServer.msg1=\u9078\u629e\u306e\u8981\u7d04\u306f\u6b21\u306e\u901a\u308a\u3067\u3059\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u4f5c\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3001\u300c\u7d42\u4e86\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
appserver.confirmAppServer.msg2=\u5909\u66f4\u3057\u305f\u3044\u8a2d\u5b9a\u304c\u3042\u308b\u5834\u5408\u306f\u3001\u524d\u306e\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u30b5\u30fc\u30d0\u30fc\u8a2d\u5b9a\u3092\u518d\u691c\u8a0e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
appserver.confirmAppServer.msg3=\u4ee5\u4e0b\u306e\u51e6\u7406\u304c\u5b9f\u884c\u3055\u308c\u307e\u3059
appserver.confirmAppServer.msg4=\u30b5\u30fc\u30d0\u30fc\u306e\u65b0\u898f\u4f5c\u6210\u51e6\u7406\u3067\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc \"{0}\" \u3092\u30ce\u30fc\u30c9 \"{1}\" \u4e0a\u306b\u65b0\u898f\u4f5c\u6210\u3057\u307e\u3059\u3002
appserver.confirmAppServer.msg7=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u539f\u56e0\u3067\u8d77\u3053\u308a\u3046\u308b\u3053\u3068
appserver.confirmAppServer.msg8=\u30ce\u30fc\u30c9 \"{0}\" \u306b\u5e7e\u3064\u304b\u306e\u51e6\u7406\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u306e\u306b\u5341\u5206\u306a\u30e1\u30e2\u30ea\u30fc\u304c\u3042\u308b\u304b\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30e1\u30e2\u30ea\u30fc\u304c\u4e0d\u5341\u5206\u306a\u5834\u5408\u306f\u3001\u30d1\u30d5\u30a9\u30fc\u30de\u30f3\u30b9\u304c\u4f4e\u4e0b\u3057\u307e\u3059\u3002
appserver.createAppServer.msg1=\u65b0\u898f\u30b5\u30fc\u30d0\u30fc\u306f\u6b63\u5e38\u306b\u4f5c\u6210\u3055\u308c\u307e\u3057\u305f\u3002
appserver.createAppServer.msg2=\u65b0\u898f\u306b\u4f5c\u6210\u3055\u308c\u305f\u30b5\u30fc\u30d0\u30fc\u3092\u5b9f\u884c\u3059\u308b\u524d\u306b\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30d6\u30ed\u30fc\u30ab\u30fc\u30fb\u30ad\u30e5\u30fc\u540d\u306a\u3069\u306e\u3001\u5909\u6570\u3001\u30ea\u30bd\u30fc\u30b9\u3001\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u8a2d\u5b9a\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ensure.unique.httpports=\u30b5\u30fc\u30d0\u30fc\u3092\u59cb\u52d5\u3059\u308b\u524d\u306b\u3001HTTP \u30dd\u30fc\u30c8\u304c\u3053\u306e\u30ce\u30fc\u30c9\u306b\u5bfe\u3057\u3066\u56fa\u6709\u3067\u3042\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
error.create.server=\u65b0\u898f\u30b5\u30fc\u30d0\u30fc\u306e\u4f5c\u6210\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002

application.server.already.started={0} \u306f\u3059\u3067\u306b\u958b\u59cb\u6e08\u307f\u3067\u3059
node.agent.not.active=\u30ce\u30fc\u30c9 {0} \u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 \u30b5\u30fc\u30d0\u30fc\u3092\u958b\u59cb\u3067\u304d\u307e\u305b\u3093\u3002 
synch.server.before.start=\u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c\u5909\u66f4\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u30b5\u30fc\u30d0\u30fc\u3092\u958b\u59cb\u3059\u308b\u524d\u306b\u3001\u69cb\u6210\u3092\u30de\u30b9\u30bf\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u4fdd\u7ba1\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 
object.must.be.selected=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
application.server.not.started={0} \u306f\u958b\u59cb\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f
could.not.stop.server={0} \u3092\u505c\u6b62\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30a8\u30e9\u30fc\u30fb\u30ed\u30b0\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
server.started.successfully={0} \u30b5\u30fc\u30d0\u30fc\u306f\u6b63\u5e38\u306b\u59cb\u52d5\u3055\u308c\u307e\u3057\u305f
server.view.jvm.logs1=\u8a73\u7d30\u306f\u3001JVM \u30ed\u30b0\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002</a>
could.not.start.server={0} \u30b5\u30fc\u30d0\u30fc\u306f\u59cb\u52d5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f
server.stopped.successfully={0} \u30b5\u30fc\u30d0\u30fc\u306f\u6b63\u5e38\u306b\u505c\u6b62\u3055\u308c\u307e\u3057\u305f
server.should.be.stopped=\u524a\u9664\u3059\u308b\u3059\u3079\u3066\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u505c\u6b62\u3057\u3066\u304f\u3060\u3055\u3044\u3002
deleteserver.page.title=\u30b5\u30fc\u30d0\u30fc\u306e\u524a\u9664 
deleteserver.page.msg1=\u6b21\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u524a\u9664\u3059\u308b\u306b\u306f\u3001\u4ee5\u4e0b\u306e\u300cOK\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002\u30b5\u30fc\u30d0\u30fc\u3092\u524a\u9664\u3057\u305f\u304f\u306a\u3044\u5834\u5408\u306f\u3001\u300c\u30ad\u30e3\u30f3\u30bb\u30eb\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u76f4\u524d\u306e\u30da\u30fc\u30b8\u306b\u623b\u3063\u3066\u304f\u3060\u3055\u3044\u3002
error.createmq=createmq \u3092\u5b9f\u884c\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001JMSServer \u306f\u958b\u59cb\u3067\u304d\u307e\u305b\u3093
error.deletemq=deleteemq \u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306b\u5931\u6557\u3057\u307e\u3057\u305f
NodeAgent.not.found=\u30b7\u30b9\u30c6\u30e0\u306f\u30b5\u30fc\u30d0\u30fc\u3092\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3059\u308b\u30d7\u30ed\u30bb\u30b9\u306b\u9023\u7d61\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u524a\u9664\u3059\u308b\u524d\u306b\u30b5\u30fc\u30d0\u30fc\u304c\u30b7\u30e3\u30c3\u30c8\u30c0\u30a6\u30f3\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
nodes.not.present=\u69cb\u6210\u3067\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u30ce\u30fc\u30c9\u304c\u3042\u308a\u307e\u305b\u3093\u3002  \u65b0\u3057\u3044 Application Server \u306e\u4f5c\u6210\u3092\u8a66\u307f\u308b\u524d\u306b\u3001<a href="navigatorCmd.do?forwardName=Node.content.main">\u30ce\u30fc\u30c9\u30fb\u30b3\u30ec\u30af\u30b7\u30e7\u30f3</a>\u307e\u305f\u306f\u30b3\u30de\u30f3\u30c9\u884c\u304b\u3089\u3001addNode \u30b3\u30de\u30f3\u30c9\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002

ExecutionState.PARTIAL_STOP=\u90e8\u5206\u505c\u6b62
ExecutionState.PARTIAL_START=\u90e8\u5206\u59cb\u52d5
ExecutionState.STOPPING=\u505c\u6b62\u4e2d
ExecutionState.STARTING=\u59cb\u52d5\u4e2d



NamedEndPoint.displayName=\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8
NamedEndPoint.description=\u63a5\u7d9a\u306e\u305f\u3081\u306b\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u304c\u4f7f\u7528\u3059\u308b\u91cd\u8981\u306a TCP/IP \u30dd\u30fc\u30c8\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
NamedEndPoint.smallIcon=NamedEndPoint.gif
NamedEndPoint.largeIcon=NamedEndPoint32X32.gif
NamedEndPoint.endPoint.displayName=\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8
NamedEndPoint.endPoint.description=
NamedEndPoint.endPointName.displayName=\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u540d
NamedEndPoint.endPointName.description=
NamedEndPoints.not.available=\u69cb\u6210\u53ef\u80fd\u306a\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u304c\u3042\u308a\u307e\u305b\u3093
SystemMessageServer.displayName=\u30b7\u30b9\u30c6\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8\u30fb\u30b5\u30fc\u30d0\u30fc
AppServer.displayName=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc

Server.productInfo.displayName=\u88fd\u54c1\u60c5\u5831
Server.productInfo.description=WebSphere Application Server \u306e\u3053\u306e\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306e\u88fd\u54c1\u60c5\u5831
ProductInfo.components.dislayName=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
ProductInfo.components.description=\u73fe\u884c\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
ProductInfo.extensions.dislayName=\u62e1\u5f35\u5b50
ProductInfo.extensions.description=\u73fe\u884c\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u62e1\u5f35\u5b50
ProductInfo.eFixes.dislayName=e-Fix
ProductInfo.eFixes.description=\u73fe\u884c\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b e-Fix
ProductInfo.product.name=\u88fd\u54c1\u540d
ProductInfo.product.id=ID
ProductInfo.product.version=\u30d0\u30fc\u30b8\u30e7\u30f3
ProductInfo.product.buildDate=\u30d3\u30eb\u30c9\u65e5
ProductInfo.product.buildLevel=\u30d3\u30eb\u30c9\u30fb\u30ec\u30d9\u30eb
ProductInfo.product.buildversion=\u30d3\u30eb\u30c9\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3
ProductInfo.product.builddate=\u30d3\u30eb\u30c9\u65e5
ProductInfo.component.name=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u540d
ProductInfo.component.specversion=\u30b9\u30da\u30c3\u30af\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3
ProductInfo.extension.name=\u62e1\u5f35\u5b50\u540d
ProductInfo.efix.id=e-Fix ID
ProductInfo.efix.buildversion=\u30d3\u30eb\u30c9\u30fb\u30d0\u30fc\u30b8\u30e7\u30f3
ProductInfo.efix.buildDate=\u30d3\u30eb\u30c9\u65e5
ProductInfo.efix.components=\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8
ProductInfo.efix.prereq=\u524d\u63d0\u6761\u4ef6
ProductInfo.efix.coreq=\u76f8\u4e92\u5fc5\u8981\u6761\u4ef6            
ProductInfo.ptfs.dislayName=PTF
ProductInfo.ptfs.description=\u73fe\u884c\u30b7\u30b9\u30c6\u30e0\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u6e08\u307f\u306e PTF
ProductInfo.ptf.id=PTF ID
ProductInfo.ptf.products=\u88fd\u54c1
ProductInfo.productReport.dislayName=\u88fd\u54c1\u5831\u544a\u66f8
ProductInfo.productReport.description=\u30b7\u30b9\u30c6\u30e0\u306e\u73fe\u5728\u306e\u72b6\u614b\u306e\u8a73\u7d30\u88fd\u54c1\u60c5\u5831\u5831\u544a\u66f8\u3092\u8868\u793a\u3057\u307e\u3059\u3002
ProductInfo.historyReport.dislayName=\u30d2\u30b9\u30c8\u30ea\u30fc\u5831\u544a\u66f8
ProductInfo.historyReport.description=\u88fd\u54c1\u60c5\u5831\u306e\u8a73\u7d30\u30d2\u30b9\u30c8\u30ea\u30ab\u30eb\u5831\u544a\u66f8\u3092\u8868\u793a\u3057\u307e\u3059\u3002
Data.not.present=\u306a\u3057

accessibility.needs=\u30a2\u30af\u30bb\u30b9\u652f\u63f4\u3092\u5fc5\u8981\u3068\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u306f\u3001\u30a4\u30e1\u30fc\u30b8\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u72b6\u6cc1\u3092\u5165\u624b\u3067\u304d\u307e\u3059\u3002
