<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres du r&eacute;pertoire de configuration SSL (Secure Sockets Layer)</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="usectssl"></a>
<h2>Param&egrave;tres du r&eacute;pertoire de configuration SSL (Secure Sockets Layer)</h2>

<p>Cette page permet de d&eacute;finir un nouvel alias SSL (Secure Sockets Layer). Par le biais du r&eacute;pertoire de configuration SSL, les administrateurs
peuvent d&eacute;finir autant de param&egrave;tres SSL qu'ils le souhaitent pour
configurer des connexions HTTPS (Hypertext Transfer Protocol with SSL),
IIOPS (Internet InterORB Protocol with SSL) ou LDAPS (Lightweight
Directory Access Protocol with SSL). Vous pouvez extraire un des
param&egrave;tres SSL d&eacute;finis ici &agrave; partir d'un emplacement de la console
d'administration qui prend en charge les connexions SSL. Cette op&eacute;ration
simplifie le processus de configuration, &eacute;tant donn&eacute; que vous r&eacute;utilisez
un grand nombre de configurations SSL en indiquant l'alias &agrave; plusieurs
emplacements.</p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>S&eacute;curit&eacute;</strong> &gt; <strong>SSL</strong>.</p>

<p>Cliquez sur <strong>Nouveau</strong> pour cr&eacute;er un alias de r&eacute;pertoire de
configuration SSL. </p>

<p>Cliquez sur <strong>Supprimer</strong> pour supprimer un alias de r&eacute;pertoire de
configuration SSL. Si un alias de configuration SSL est r&eacute;f&eacute;renc&eacute; dans la
configuration et supprim&eacute; ici, la connexion SSL &eacute;choue au moment o&ugrave; vous
acc&eacute;dez &agrave; l'alias supprim&eacute;.</p>

<dl>
<dt>
<strong><a name="Security_defaultSSLSettings_description"></a>Alias</strong>
</dt>
<dd>Indique le nom du param&egrave;tre SSL sp&eacute;cifique.
<p></p>


</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
