<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de configurations SSL HTTP</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_transssl"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Collection de configurations SSL HTTP</h2>

<p>Cette page permet de configurer la s&eacute;curit&eacute;
SSL (Secure Sockets Layer) au niveau du transport. Cette configuration est utile lorsqu'un service Web est client d'un
autre.</p>

<p>Vous pouvez utiliser la s&eacute;curit&eacute; au niveau du transport pour
activer SSL HTTP (HTTPS). Ce type de s&eacute;curit&eacute; peut &ecirc;tre activ&eacute;e ou
d&eacute;sactiv&eacute;e ind&eacute;pendamment de celle au niveau des messages.
Sachant qu'elle suppose une s&eacute;curit&eacute; minimale, utilisez celle au
niveau des message lorsque la protection d'une application de service
Web est essentielle.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Applications &gt; Applications d'entreprise &gt; </strong><em>nom_application</em>. </li>

<li>Dans la
section Articles li&eacute;s, cliquez sur <strong>Module Web &gt;
</strong><em>nom_fichier_URI</em><strong> &gt; Services Web : Liaisons de s&eacute;curit&eacute; du client</strong>.</li>

<li>Dans la section Authentification SSL HTTP, cliquez sur <strong>Editer</strong>. </li>

</ol>
</p>

<p>Vous pouvez &eacute;galement d&eacute;finir l'authentification de base en suivant la proc&eacute;dure
ci-apr&egrave;s : <ol>

<li>Cliquez sur <strong>Applications &gt; Applications d'entreprise &gt; </strong><em>nom_application</em>. </li>

<li>Dans la
section Articles li&eacute;s, cliquez sur <strong>Module Web &gt;
</strong><em>nom_fichier_URI</em><strong> &gt; Services Web : Liaisons de s&eacute;curit&eacute; du client</strong>.</li>

<li>Dans <strong>Configuration HTTP de base</strong>, cliquez sur <strong>Editer</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_transsslconfigen"></a>HTTP SSL activ&eacute; </strong>
</dt>
<dd>S&eacute;lectionnez cette option pour activer les communications
s&eacute;curis&eacute;es par socket pour le transport HTTP concernant ce
port. Apr&egrave;s activation, WebSphere Application Server utilise le
param&egrave;tre de configuration SSL HTTP. </dd>
<dt>
<strong><a name="sec_transsslconfigalias"></a>Configuration SSL HTTP </strong>
</dt>
<dd>Indique l'alias de la configuration SSL &agrave; utiliser avec le
transport HTTP pour ce port. 
<p>Cette option est utilis&eacute;e si vous s&eacute;lectionnez <strong>HTTP SSL activ&eacute;</strong>. Les
alias SSL sont d&eacute;finis dans le r&eacute;pertoire de configuration Secure
Sockets Layer, modifiable en cliquant sur <strong>S&eacute;curit&eacute; &gt; SSL</strong>.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_websvcb.html">Services Web : Liaisons par d&eacute;faut pour la collection Web Services Security</a>
<br>

<a href="uwbs_wsclientbind.html">Services Web : Collection de liaisons de s&eacute;curit&eacute; du client</a>
<br>

<a href="uwbs_wsservrbind.html">Services Web : Collection de liaisons de s&eacute;curit&eacute; du server</a>
<br>

</div>
</body>
</html>
