<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection &eacute;valuateur d'ID digne de confiance</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_trstide"></a>
<h2>
<img alt="[Fix Pack 5.0.2 and later]" src="v502.gif" border="0">Collection &eacute;valuateur d'ID digne de confiance</h2>

<p>Cette page permet d'afficher la liste des &eacute;valuateurs
d'identit&eacute; (ID) dignes de confiance.
L'&eacute;valuateur d'ID digne de confiance d&eacute;termine s'il doit faire confiance &agrave;
l'autorit&eacute; qui v&eacute;rifie l'identit&eacute;. Une fois l'ID accept&eacute;, WebSphere Application
Server g&eacute;n&egrave;re les justificatifs appropri&eacute;s, qui sont utilis&eacute;s dans un
appel en aval pour demander des ressources.
L'&eacute;valuateur d'ID digne de confiance impl&eacute;mente l'interface
com.ibm.wsspi.wssecurity.id.TrustedIDEvaluator.</p>

<p>Pour afficher cette page de la console d'administration, suivez la proc&eacute;dure ci-apr&egrave;s. <ol>

<li>Cliquez sur <strong>Serveurs &gt; Serveurs d'applications &gt; </strong><em>nom_serveur</em>.</li>

<li>Dans la section Services suppl&eacute;mentaires, cliquez sur <strong>Services Web : Liaisons par
d&eacute;faut pour la s&eacute;curit&eacute; des services Web &gt; Evaluateurs d'ID dignes de confiance</strong>.</li>

</ol>
</p>

<p>Cliquez sur <strong>Nouveau</strong> pour cr&eacute;er un &eacute;valuateur d'ID digne de
confiance.</p>

<p>Cliquez sur <strong>Supprimer</strong> pour supprimer un &eacute;valuateur d'ID digne de confiance.</p>

<p>A partir de ce panneau, suivez la proc&eacute;dure ci-apr&egrave;s.<ol>

<li>Indiquez un nom d'&eacute;valuateur d'ID dignes de confiance et un nom de classe pour ce dernier. </li>

<li>Sauvegardez vos modifications en cliquant sur <strong>Sauvegarder</strong> dans la partie sup&eacute;rieure de
la console d'administration. Lorsque vous cliquez sur <strong>Sauvegarder</strong>, vous revenez au panneau
d'accueil de la console d'administration. </li>

<li>Revenez au panneau d'&eacute;valuateur
d'ID dignes de confiance pour mettre &agrave; jour l'ex&eacute;cution de la s&eacute;curit&eacute;
des services Web avec les informations de liaison par d&eacute;faut figurant
dans le fichier <samp>ws_security.xml</samp>. </li>

<li>Cliquez sur <strong>Mettre &agrave; jour l'ex&eacute;cution</strong>. Les modifications de configuration apport&eacute;es aux autres services Web sont &eacute;galement mis &agrave; jour dans l'environnement d'ex&eacute;cution de s&eacute;curit&eacute; des services Web.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_trstname"></a>Nom d'&eacute;valuateur d'ID digne de confiance</strong>
</dt>
<dd>Indique le nom unique de l'&eacute;valuateur d'ID digne de confiance.</dd>
<dt>
<strong><a name="sec_trstclname"></a>Nom de classe d'&eacute;valuateur d'ID digne de confiance</strong>
</dt>
<dd>Indique le nom de classe de l'&eacute;valuateur d'ID digne de confiance.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="uwbs_trstiden.html">Param&egrave;tres de configuration des &eacute;valuateurs d'ID dignes de confiance</a>
<br>

</div>
</body>
</html>
