<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_pageusage"></a>
<h2>Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</h2>

<p>En este tema se proporciona informaci&oacute;n sobre los elementos b&aacute;sicos de una p&aacute;gina de consola administrativa como, por ejemplo, las distintas pesta&ntilde;as que pueden aparecer.</p>

<p>Las p&aacute;ginas de la consola administrativa se organizan seg&uacute;n unos patrones b&aacute;sicos. Si entiende bien su dise&ntilde;o y su comportamiento podr&aacute; utilizarlas m&aacute;s f&aacute;cilmente.</p>

<p>
<strong>P&aacute;ginas de colecci&oacute;n</strong>
</p>

<p>Utilice las p&aacute;ginas de colecci&oacute;n para gestionar una colecci&oacute;n de objetos administrativos existentes. Una p&aacute;gina de colecci&oacute;n generalmente contiene uno o m&aacute;s de los elementos siguientes:</p>

<dl>

<dt>
<strong>&Aacute;mbito, filtro y preferencias.</strong>
</dt>
<dd>Estos se describen en  <a href="rcon_scope.html">Valores de &aacute;mbito de la consola administrativa</a>, <a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>,
y <a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>.</dd>

<dt>
<strong>Tabla de objetos existentes</strong>
</dt>
<dd>La tabla muestra los objetos administrativos existentes del tipo que especifica la p&aacute;gina de la colecci&oacute;n. Las columnas de la tabla resumen los valores de las configuraciones claves de estos objetos. Si todav&iacute;a no hay ning&uacute;n objeto, se mostrar&aacute; una tabla vac&iacute;a. Utilice los botones disponibles para crear un objeto nuevo.</dd>

<dt>
<strong>Botones para realizar acciones</strong>
</dt>
<dd>Los botones disponibles se describen en <a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>. En la
mayor&iacute;a de los casos, debe seleccionar uno o varios objetos de la tabla y, a continuaci&oacute;n,
pulsar un bot&oacute;n.
La acci&oacute;n se aplicar&aacute; a los objetos seleccionados.</dd>

<dt>
<strong>Botones para modificar el orden de clasificaci&oacute;n</strong>
</dt>
<dd>Despu&eacute;s de cada cabecera de la columna de la tabla encontrar&aacute; iconos para clasificar
en orden ascendente (^) y en orden descendente (v). Por omisi&oacute;n, los elementos como, por ejemplo, los nombres, se clasifican por orden descendente (por orden alfab&eacute;tico). Para activar otro orden de clasificaci&oacute;n, pulse en los iconos de la columna cuyos elementos desea clasificar.</dd>

</dl>

<p>
<strong>P&aacute;ginas de detalles</strong>
</p>

<p>Utilice las p&aacute;ginas de detalles para configurar objetos administrativos espec&iacute;ficos como, por ejemplo, un servidor de aplicaciones. Una p&aacute;gina de detalles generalmente contiene uno o m&aacute;s de los elementos siguientes:</p>

<dl>

<dt>
<strong>P&aacute;gina de configuraci&oacute;n con separadores</strong>
</dt>
<dd>Esta p&aacute;gina con separadores sirve para modificar la configuraci&oacute;n de un objeto de  administraci&oacute;n.</dd>

<dt>
<strong>P&aacute;gina de ejecuci&oacute;n con separadores</strong>
</dt>
<dd>Esta p&aacute;gina con separadores muestra la
configuraci&oacute;n que est&aacute; utiliz&aacute;ndose actualmente para el objeto administrativo. En la mayor parte de los casos es de s&oacute;lo lectura.</dd>

<dt>
<strong>Botones para realizar acciones</strong>
</dt>
<dd>Los botones disponibles se describen en <a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>.</dd>

</dl>

<p>
<strong>P&aacute;ginas del asistente</strong>
</p>

<p>Utilice las p&aacute;ginas del asistente para completar un proceso de configuraci&oacute;n que conste de varios pasos. Debe tener en cuenta que los asistentes muestran u ocultan determinados pasos dependiendo de las caracter&iacute;sticas del objeto espec&iacute;fico que est&eacute; configurando.</p>

</body>
</html>
