<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de antememoria de EJB</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uejbcash"></a>
<h2>Valores de antememoria de EJB</h2>

<p>Utilice esta p&aacute;gina para configurar y gestionar la antememoria para un contenedor de EJB espec&iacute;fico. 
Para determinar el l&iacute;mite absoluto de la antememoria, multiplique el n&uacute;mero de enterprise
beans activos de una transacci&oacute;n cualquiera por el n&uacute;mero total de transacciones
concurrentes que se esperan. A continuaci&oacute;n, a&ntilde;ada el n&uacute;mero de instancias de bean de sesi&oacute;n activadas. 
Puede utilizar Tivoli Performance Viewer para ver la informaci&oacute;n de
rendimiento del bean.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Servidores</strong>
<strong>&gt;</strong> <strong>Servidores de aplicaciones</strong> <strong>&gt;</strong> <em>nombreServidor</em> <strong>&gt;</strong> <strong>Contenedor de EJB</strong> <strong>&gt;</strong> <strong>Valores de antememoria de EJB</strong>.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="EJBCache_cleanupInterval_description"></a>Intervalo de limpieza</strong>
</dt>
<dd>Especifica el intervalo durante el cual el contenedor intenta eliminar elementos no
utilizados de la antememoria para reducir el n&uacute;mero total de elementos en la antememoria al
valor del tama&ntilde;o de antememoria.
<p>El gestor de antememoria intenta mantener algunas entradas no asignadas que se puedan asignar tan r&aacute;pido como sea posible. Una hebra subordinada intenta liberar algunas entradas a la vez que mantiene algunas entradas no asignadas. Si la hebra se ejecuta mientras el servidor de aplicaciones est&aacute; desocupado, cuando el servidor de aplicaciones necesite asignar nuevas entradas de antememoria, no tendr&aacute; que eliminar entradas de la antememoria para mantener el rendimiento. Como norma general, aumente este par&aacute;metro a medida que aumente el tama&ntilde;o de la antememoria.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Integer</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unidades</td>
<td align="left" valign="top" class="base">Milisegundos</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Rango</td>
<td align="left" valign="top" class="base">Mayor que 0</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">3000</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="EJBCache_cacheSize_description"></a>Tama&ntilde;o de antememoria</strong>
</dt>
<dd>Especifica el n&uacute;mero de cubetas en la lista de instancias activas del contenedor de EJB.
<p>Una cubeta puede contener m&aacute;s de una instancia de enterprise bean activa, aunque el rendimiento se maximiza si cada cubeta de la tabla tiene asignado un n&uacute;mero m&iacute;nimo de instancias. Cuando el n&uacute;mero de instancias activas del contenedor sobrepasa el n&uacute;mero de cubetas ,es decir, el tama&ntilde;o de antememoria, &eacute;ste intenta reducir peri&oacute;dicamente el n&uacute;mero de instancias activas de la tabla mediante la desactivaci&oacute;n de algunas instancias activas. Para obtener los mejores resultados de rendimiento y uso de memoria, configure este valor con el n&uacute;mero m&aacute;ximo de instancias activas previstas durante un carga de trabajo corriente.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Integer</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unidades</td>
<td align="left" valign="top" class="base">Cubetas en la tabla de totales de control</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Rango</td>
<td align="left" valign="top" class="base">Superior a 0. El contenedor selecciona el siguiente n&uacute;mero primo m&aacute;s alto que sea igual al valor especificado o superior.</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">2053</td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="uejb_recnt.html">Valores de contenedor de EJB</a>
<br>

</div>
</body>
</html>
