<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores del servicio de supervisi&oacute;n del rendimiento</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uprf_rmonitorsettings"></a>
<h2>Valores del servicio de supervisi&oacute;n del rendimiento</h2>

<p>Utilice esta p&aacute;gina para especificar valores para la supervisi&oacute;n del rendimiento, por ejemplo, para habilitar la supervisi&oacute;n del rendimiento, seleccionar el m&oacute;dulo PMI y establecer niveles de supervisi&oacute;n.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Servidores</strong> &gt;
<strong>Servidores de aplicaciones</strong> &gt; <em>servidor</em> &gt; <strong>Supervisi&oacute;n del rendimiento</strong>.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="PMIService_enabled_description"></a>Arranque</strong>
</dt>
<dd>Especifica si el servidor de aplicaciones intentar&aacute; iniciar el servicio especificado. Si un servidor de aplicaciones se inicia cuando est&aacute; inhabilitado el servicio de supervisi&oacute;n del rendimiento, tendr&aacute; que reiniciar el servidor para poder habilitarlo.  </dd>
<dt>
<strong><a name="PMIService_initialSpecLevel_description"></a>Nivel de especificaci&oacute;n inicial</strong>
</dt>
<dd>Especifica una serie de PMI (Performance Monitoring Infrastructure) que almacena los
niveles de especificaci&oacute;n de PMI, por ejemplo, los niveles de m&oacute;dulos, para todos los
componentes del servidor.
<p>Para establecer los niveles de especificaci&oacute;n de PMI, seleccione el recuadro de selecci&oacute;n <em>ninguna</em>, <em>est&aacute;ndar</em> o <em>personalizada</em>.
Si selecciona <em>ninguna</em>, todos los m&oacute;dulos PMI est&aacute;n establecidos en el nivel <em>ninguno</em>.
Si se selecciona
<em>est&aacute;ndar</em>, se establecen todos los m&oacute;dulo PMI en <em>alto</em> y se habilitan todos los
datos PMI, a excepci&oacute;n de los datos de nivel de m&eacute;todo y los datos de JVMPI. Si selecciona
personalizada, se le proporciona la opci&oacute;n de cambiar el nivel de cada uno de los m&oacute;dulos
PMI. Puede establecer el nivel en N, L, M, H o X (ninguno, bajo, medio, alto y m&aacute;ximo). <strong>Tenga en cuenta</strong> que no debe modificar los nombres de m&oacute;dulo.</p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Pesta&ntilde;a Tiempo de ejecuci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="PMIService_specification_description"></a>Especificaciones</strong>
</dt>
<dd>Especifica el m&oacute;dulo PMI y el nivel de supervisi&oacute;n que ha establecido.
<p>Para establecer los niveles de especificaci&oacute;n de PMI, seleccione el recuadro de selecci&oacute;n <em>ninguna</em>, <em>est&aacute;ndar</em> o <em>personalizada</em>.
Si selecciona <em>ninguna</em>, todos los m&oacute;dulos PMI est&aacute;n establecidos en el nivel <em>ninguno</em>.
Si se selecciona
<em>est&aacute;ndar</em>, se establecen todos los m&oacute;dulo PMI en <em>alto</em> y se habilitan todos los
datos PMI, a excepci&oacute;n de los datos de nivel de m&eacute;todo y los datos de JVMPI. Si selecciona
personalizada, se le proporciona la opci&oacute;n de cambiar el nivel de cada uno de los m&oacute;dulos
PMI. Puede establecer el nivel en N, L, M, H o X (ninguno, bajo, medio, alto y m&aacute;ximo). <strong>Tenga en cuenta</strong> que no debe modificar los nombres de m&oacute;dulo.</p>

</dd>
</dl>
</div>
</body>
</html>
