<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de cookies</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="cook_set"></a>
<h2>Valores de cookies</h2>

<p>Utilice esta p&aacute;gina para configurar valores de cookies para la gesti&oacute;n de sesiones.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse
<strong>Servidores</strong> &gt; <strong>Servidores de aplicaciones</strong> &gt;
<em>nombre_servidor</em> &gt; <strong>Contenedor Web</strong> &gt; <strong>Gesti&oacute;n de
sesiones</strong> &gt; <strong>Habilitar cookies</strong>.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="Cookie_name_description"></a>Nombre de cookie  </strong>
</dt>
<dd>Especifica un nombre &uacute;nico para la cookie de gesti&oacute;n de sesiones. La especificaci&oacute;n
de servlet requiere que el nombre sea JSESSIONID. Sin embargo, por razones de flexibilidad este
valor se puede puede configurar. </dd>
<dt>
<strong><a name="Cookie_secure_description"></a>cookies de seguridad </strong>
</dt>
<dd>Especifica que las cookies de la sesi&oacute;n incluyen el campo protegido. Si se habilita,
se restringe el intercambio de cookies s&oacute;lo a sesiones HTTPS. </dd>
<dt>
<strong><a name="Cookie_domain_description"></a>Dominio de cookie</strong>
</dt>
<dd>Especifica el valor del campo de dominio de una cookie de rastreo de sesiones. Este
valor controla si un navegador env&iacute;a o no una cookie a determinados servidores. Por ejemplo, si
especifica un dominio determinado, las cookies de la sesi&oacute;n s&oacute;lo se enviar&aacute;n a los sistemas
principales de ese dominio. El dominio por omisi&oacute;n es el servidor.</dd>
<dt>
<strong><a name="Cookie_path_description"></a>V&iacute;a de acceso de cookie</strong>
</dt>
<dd>Especifica que una cookie se env&iacute;a al URL designado en la v&iacute;a de acceso.
Especifique
cualquier serie que represente una v&iacute;a de acceso en el servidor. "/" indica el directorio ra&iacute;z.
  Especifique un valor para restringir las v&iacute;as de acceso a las que se enviar&aacute; la cookie.
Al
restringir las v&iacute;as de acceso, puede impedir que la cookie se env&iacute;e a determinados URL del
servidor. Si especifica el directorio ra&iacute;z, la cookie se enviar&aacute; independientemente de la v&iacute;a de
acceso del servidor a la que se acceda.</dd>
<dt>
<strong><a name="Cookie_maximum_age"></a>Antig&uuml;edad m&aacute;xima de cookie  </strong>
</dt>
<dd>Especifica el tiempo que la cookie est&aacute; en vigor en el navegador del cliente.   Especifica que la cookie est&aacute; s&oacute;lo en vigor lo que dura la sesi&oacute;n de navegador actual o una antig&uuml;edad m&aacute;xima. Si selecciona la opci&oacute;n de antig&uuml;edad m&aacute;xima, especifique la duraci&oacute;n en segundos.  Este valor corresponde al valor TTL (tiempo de duraci&oacute;n) descrito en la especificaci&oacute;n de la cookie.
<p>El valor por omisi&oacute;n es la sesi&oacute;n de navegador actual, que es equivalente a establecer el valor en -1.</p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

</div>
</body>
</html>
