<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de los problemas de configuraci&oacute;n</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="configproblems_description"></a>
<h2>Valores de los problemas de configuraci&oacute;n</h2>

<p>Utilice esta p&aacute;gina para identificar y ver los problemas que se han producido en la configuraci&oacute;n actual.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse
<strong>Resoluci&oacute;n de problemas &gt; Problemas de configuraci&oacute;n</strong> en el
&aacute;rbol de navegaci&oacute;n de la consola.</p>

<p>Pulse un problema de configuraci&oacute;n en la tabla Problemas de
configuraci&oacute;n para ver m&aacute;s informaci&oacute;n sobre el problema.</p>

<dl>
<dt>
<strong><a name="configproblems_validation_description"></a>Validaci&oacute;n de documentos de configuraci&oacute;n</strong>
</dt>
<dd>Utilice estos campos para especificar el nivel de validaci&oacute;n que se va a realizar en los documentos de configuraci&oacute;n.</dd>
<dt>
<strong><a name="configproblems_validation_crossDescription"></a>Validaci&oacute;n cruzada</strong>
</dt>
<dd>Habilita la validaci&oacute;n cruzada de documentos de configuraci&oacute;n.
<p>Al habilitar la validaci&oacute;n cruzada, se permite la comparaci&oacute;n de documentos de configuraci&oacute;n para identificar valores en conflicto.</p>

</dd>
<dt>
<strong><a name="resid_maybe"></a>Problemas de configuraci&oacute;n</strong>
</dt>
<dd>

<p>Muestra los mensajes de error del problema de configuraci&oacute;n actual. Pulse un mensaje para obtener informaci&oacute;n detallada sobre el problema.</p>

</dd>
<dt>
<strong><a name="resid_maybe"></a>&Aacute;mbito</strong>
</dt>
<dd>

<p>Ordena la lista de problemas de configuraci&oacute;n seg&uacute;n el archivo de
configuraci&oacute;n donde ocurre cada error. Pulse un mensaje para obtener informaci&oacute;n detallada sobre el problema.</p>

<p>
<strong>Campos que explican cada problema de configuraci&oacute;n:</strong>
</p>

<p>Los siguientes campos de informaci&oacute;n aparecen cuando pulsa un mensaje de problema de configuraci&oacute;n.</p>

</dd>
<dt>
<strong><a name="configproblems_message_textDesc"></a>Mensaje</strong>
</dt>
<dd>Muestra el mensaje devuelto por el validador.</dd>
<dt>
<strong><a name="configproblems_message_explanation"></a>Explicaci&oacute;n</strong>
</dt>
<dd>Una breve descripci&oacute;n del problema.</dd>
<dt>
<strong><a name="configproblems_message_recommendation"></a>Acci&oacute;n del usuario</strong>
</dt>
<dd>Especifica la acci&oacute;n recomendada para corregir el problema.</dd>
<dt>
<strong><a name="configproblems_message_targetDesc"></a>Objeto de destino</strong>
</dt>
<dd>Identifica el objeto de configuraci&oacute;n donde se ha producido el error de validaci&oacute;n.</dd>
<dt>
<strong><a name="configproblems_message_severityDesc"></a>Gravedad</strong>
</dt>
<dd>Indica la gravedad de un error de configuraci&oacute;n, siendo 1 un error grave. La
gravedad disminuye a medida que aumenta el descriptor de gravedad.</dd>
<dt>
<strong><a name="configproblems_message_localURIDesc"></a>URI local</strong>
</dt>
<dd>Especifica el URI local del archivo de configuraci&oacute;n donde se ha producido el error.</dd>
<dt>
<strong><a name="configproblems_message_fullURIDesc"></a>URI completo</strong>
</dt>
<dd>Especifica el URI completo del archivo de configuraci&oacute;n donde se ha producido el
error.</dd>
<dt>
<strong><a name="configproblems_message_validatorClassDesc"></a>Nombre de clase de validador</strong>
</dt>
<dd>Nombre de clase del validador que notifica el problema.</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_scope.html">Valores de &aacute;mbito de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

</div>
</body>
</html>
