<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Einstellungen f&uuml;r Ressourcenumgebungseintr&auml;ge</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="Resource_env_entry"></a>
<h2>Einstellungen f&uuml;r Ressourcenumgebungseintr&auml;ge</h2>

<p>Auf dieser Seite k&ouml;nnen Sie Ressourcenumgebungseintr&auml;ge festlegen, die die Konfiguration
f&uuml;r eine Umgebungsressource definieren, die im Deployment-Deskriptor einiger Anwendungen
das Bindungsziel f&uuml;r eine Referenz auf eine Ressourcenumgebung ist. </p>

<p>Klicken Sie zum Anzeigen dieser Seite der Administrationskonsole auf <strong>Ressourcen</strong> &gt;
<strong>Ressourcenumgebungsprovider</strong> &gt; <em>Ressourcenumgebungsprovider</em> &gt;
<strong>Ressourcenumgebungseintr&auml;ge</strong> &gt; <em>Ressourcenumgebungseintrag</em>. </p>

<div>
<p>
<strong>Register "Konfiguration"</strong>
</p>
<dl>
<dt>
<strong><a name="ResourceEnvEntry_detail_contextID"></a>Bereich</strong>
</dt>
<dd>Gibt die Ebene an, bis zu der diese Ressourcendefinition sichtbar ist - Zelle, Knoten oder Server.
<p>Ressourcen, wie z. B. JDBC-Provider, Namespace-Bindungen oder gemeinsam
benutzte Bibliotheken k&ouml;nnen in mehreren Bereichen definiert werden. Dabei &uuml;berschreiben Ressourcen, die in
spezifischeren Bereichen
definiert wurden, Ressourcen, die in allgemeineren Bereichen definiert wurden. </p>

<p>Die Merkmale einer Ressource gelten nur f&uuml;r eine bestimmte Serverebene, unabh&auml;ngig vom
Geltungsbereich einer definierten Ressource.
Wenn Sie beispielsweise den Geltungsbereich einer Datenquelle auf Zellenebene definieren,
k&ouml;nnen alle Benutzer in dieser Zelle diese Datenquelle durchsuchen und verwenden.
Die Einstellungen von Ressourcenmerkmalen gelten jedoch lokal f&uuml;r jeden Server in der Zelle.
Wenn Sie beispielsweise die <em>maximale Anzahl von Verbindungen</em> mit 10 definieren, kann jeder
Server in dieser Zelle 10 Verbindungen haben.
<dl>

<dt>
<strong>Zelle</strong>
</dt>
<dd>Der allgemeinste Bereich. Ressourcen, die im Zellenbereich definiert werden, sind auf
allen Knoten und Servern sichtbar, vorausgesetzt, sie wurden nicht &uuml;berschrieben.
M&ouml;chten Sie Ressourcen anzeigen, die im Zellenbereich definiert wurden, d&uuml;rfen Sie
keinen Server oder Knotennamen im Formular f&uuml;r die Bereichsauswahl angeben.</dd>

<dt>
<strong>Knoten</strong>
</dt>
<dd>Der Standardbereich f&uuml;r die meisten Ressourcentypen.  Ressourcen, die im Knotenbereich
definiert werden, &uuml;berschreiben alle Duplikate im Zellenbereich und sind auf allen Servern, die sich auf
demselben
Knoten befinden, sichtbar, vorausgesetzt, sie wurden nicht in einem Serverbereich auf diesem Knoten
&uuml;berschrieben. M&ouml;chten Sie Ressourcen anzeigen, die in einem Knotenbereich
definiert
wurden, d&uuml;rfen Sie keinen Server angeben, sondern m&uuml;ssen einen Knotennamen im Formular f&uuml;r
die Bereichsauswahl ausw&auml;hlen.</dd>

<dt>
<strong>Server</strong>
</dt>
<dd>Der spezifischste Bereich f&uuml;r die Definition von Ressourcen.  Ressourcen,
die im Serverbereich definiert werden, &uuml;berschreiben alle Duplikate von
Ressourcendefinitionen, die im Zellenbereich oder im &uuml;bergeordneten
Knotenbereich definiert wurden, und k&ouml;nnen nur von einem spezifischen Server erkannt werden. M&ouml;chten
Sie Ressourcen anzeigen, die in einem Serverbereich definiert wurden, m&uuml;ssen Sie im
Formular f&uuml;r die Bereichsauswahl einen Servernamen und einen Knotennamen ausw&auml;hlen.</dd>

</dl>
</p>

<p>Wenn Ressourcen erstellt werden, werden sie immer im aktuellen, in der Anzeige ausgew&auml;hlten Bereich
erstellt. M&ouml;chten Sie Ressourcen in anderen Bereichen anzeigen,
geben Sie einen anderen Knoten oder Server im Formular f&uuml;r die Bereichsauswahl an.  </p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ResourceEnvEntry_name_description"></a>Name</strong>
</dt>
<dd>Gibt den Anzeigenamen f&uuml;r die Ressource an. 
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ResourceEnvEntry_jndiname_description"></a>JNDI-Name</strong>
</dt>
<dd>Gibt den JNDI-Namen der Ressource einschlie&szlig;lich der
Namenssubkontexte an.
<p>Dieser Name wird als Verbindung zwischen den Bindungsinformationen der Plattform
f&uuml;r die Ressourcen, die vom Deployment-Deskriptor eines Moduls definiert wurden, und den Ressourcen
verwendet, die tats&auml;chlich von der Plattform an JNDI gebunden wurden.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ResourceEnvEntry_Description_description"></a>Beschreibung</strong>
</dt>
<dd>Gibt eine Textbeschreibung der Ressource an. 
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ResourceEnvEntry_Category_description"></a>Kategorie </strong>
</dt>
<dd>Gibt eine Kategoriezeichenfolge an, die zur Klassifizierung oder Gruppierung
der Ressource verwendet werden kann. 
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="Referenceable_displayName"></a>Referenzierbare Objekte</strong>
</dt>
<dd>Gibt das referenzierbare Objekt an, das den Klassennamen der Factory beinhaltet, die
Informationen
im Namespace in eine Klasseninstanz f&uuml;r den Typ der gew&uuml;nschten Ressource sowie f&uuml;r den Klassennamen des
zur&uuml;ckzugebenden Typs konvertiert.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Datentyp</td>
<td align="left" valign="top" class="base">Dropdown-Men&uuml;</td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Zugeh&ouml;rige Informationen</strong>
</p>
<a href="rcon_buttons.html">Kn&ouml;pfe in der Adminstrationskonsole</a>
<br>

<a href="rcon_pageusage.html">Funktionen auf den Seiten der Administrationskonsole</a>
<br>

</div>
</body>
</html>
