<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres de liaison de cha&icirc;ne</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="unam_rstring_namespace"></a>
<h2>Param&egrave;tres de liaison de cha&icirc;ne</h2>

<p>Cette page permet de configurer une nouvelle liaison de cha&icirc;ne
ou d'afficher ou d'&eacute;diter une liaison de cha&icirc;ne existante.</p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong> Environnement</strong> &gt;
<strong>Nommage</strong> &gt; <strong>Liaisons de l'espace de nom</strong> &gt; <em>liaison_espacenom_cha&icirc;ne</em>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="NameSpaceBinding_scope_description"></a>Port&eacute;e</strong>
</dt>
<dd>Affiche la port&eacute;e de la liaison configur&eacute;e. Cette valeur indique l'emplacement de
la configuration pour le fichier <samp>namebindings.xml</samp>. Cette zone contient des
informations et ne peut pas &ecirc;tre mise &agrave; jour. 
<p> Si la port&eacute;e de la liaison configur&eacute;e est celle de la cellule, le contexte de d&eacute;marrage est le contexte de racine persistante de la cellule.  Si la
port&eacute;e de la liaison configur&eacute;e est celle du noeud, le contexte de
d&eacute;marrage est le contexte de racine persistante du noeud.  Si la port&eacute;e de
la liaison configur&eacute;e est celle du serveur, le contexte de d&eacute;marrage est le
contexte de racine serveur du serveur.</p>

</dd>
<dt>
<strong><a name="NameSpaceBinding_bindingtype_description"></a>Type de liaison</strong>
</dt>
<dd>Affiche les types de liaison configur&eacute;s. Les choix possibles sont :  Cha&icirc;ne, EJB,
CORBA et Indirect. Cette zone contient des informations et ne peut pas &ecirc;tre mise
&agrave; jour. </dd>
<dt>
<strong><a name="NameSpaceBinding_name_description"></a>Identificateur de liaison</strong>
</dt>
<dd>Indique le nom qui identifie de mani&egrave;re unique cette liaison configur&eacute;e.</dd>
<dt>
<strong><a name="NameSpaceBinding_nameInNameSpace_description"></a>Nom dans l'espace de nom</strong>
</dt>
<dd>D&eacute;finit le nom utilis&eacute; pour cette liaison dans l'espace de nom. Il peut s'agir d'un nom
simple ou d'un nom compos&eacute; en fonction de la partie de l'espace de nom dans laquelle
cette liaison est configur&eacute;e. </dd>
<dt>
<strong><a name="StringNameSpaceBinding_stringToBind_description"></a>Valeur cha&icirc;ne</strong>
</dt>
<dd>Indique le nom &agrave; lier dans l'espace de nom.
<p></p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="unam_rmanage_namespace.html">collection de liaisons de l'espace de nom</a>
<br>

</div>
</body>
</html>
