<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>collection de liaisons de l'espace de nom</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="unam_rmanage_namespace"></a>
<h2>collection de liaisons de l'espace de nom</h2>

<p>Cette page permet de configurer une liaison de nom d'un EJB, d'un
&eacute;l&eacute;ment CosNaming NamingContext CORBA, d'un objet de noeud feuille CORBA, objet
que vous pouvez rechercher &agrave; l'aide de JNDI ou d'une valeur de cha&icirc;ne constante.</p>

<p>Les informations de liaison pour les liaisons configur&eacute;es sont stock&eacute;es dans la
configuration et appliqu&eacute;es au d&eacute;marrage du serveur de noms pour chaque
serveur situ&eacute; dans la port&eacute;e de la liaison.</p>

<p>Pour afficher la page de gestion des param&egrave;tres de liaisons de
l'espace de nom, cliquez sur <strong> Environnement &gt; Nommage &gt; Liaisons de l'espace de nom.</strong>
</p>

<p>Cliquez sur les cases &agrave; cocher pour s&eacute;lectionner un ou plusieurs des
utilisateurs de votre collection.
 Utilisez les boutons pour contr&ocirc;ler les utilisateurs s&eacute;lectionn&eacute;s.</p>

<dl>
<dt>
<strong><a name="NameSpaceBinding_name_description"></a>Nom</strong>
</dt>
<dd>Affiche les noms donn&eacute;s afin d'identifier de mani&egrave;re unique ces liaisons
configur&eacute;es.</dd>
<dt>
<strong><a name="NameSpaceBinding_name_scope"></a>Port&eacute;e</strong>
</dt>
<dd>Affiche la port&eacute;e de la liaison configur&eacute;e. Cette valeur indique l'emplacement de
la configuration pour le fichier <samp>namebindings.xml</samp>. Cette zone contient des
informations et ne peut pas &ecirc;tre mise &agrave; jour. 
 <p>Si la port&eacute;e de la liaison configur&eacute;e est celle de la cellule, le contexte de d&eacute;marrage est le contexte de racine persistante de la cellule. Si la
port&eacute;e de la liaison configur&eacute;e est celle du noeud, le contexte de
d&eacute;marrage est le contexte de racine persistante du noeud. Si la port&eacute;e de
la liaison configur&eacute;e est celle du serveur, le contexte de d&eacute;marrage est le
contexte de racine serveur du serveur.</p>
</dd>
<dt>
<strong><a name="NameSpaceBinding_name_bindingtype"></a>Type de liaison</strong>
</dt>
<dd>Affiche les types de liaison configur&eacute;s. Les choix possibles sont :  Cha&icirc;ne, EJB,
CORBA et Indirect. Cette zone contient des informations et ne peut pas &ecirc;tre mise
&agrave; jour.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="unam_rcorba_namespace.html">Param&egrave;tres de liaison de l'objet CORBA</a>
<br>

<a href="unam_rejb_namespace.html">Param&egrave;tres de liaison de l'EJB</a>
<br>

<a href="unam_rindirectlookup_namespace.html">Param&egrave;tres de liaison de recherche indirecte</a>
<br>

<a href="unam_rstring_namespace.html">Param&egrave;tres de liaison de cha&icirc;ne</a>
<br>

</div>
</body>
</html>
