<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Caract&eacute;ristiques de la page de la console d'administration</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_pageusage"></a>
<h2>Caract&eacute;ristiques de la page de la console d'administration</h2>

<p>Cette rubrique fournit des informations sur les &eacute;l&eacute;ments de base d'une page de la console d'administration, tels que les divers onglets que l(on peut s'attendre &agrave; rencontrer.</p>

<p>Les pages de la console d'administration sont arrang&eacute;es selon quelques sch&eacute;mas de base. Comprendre leur pr&eacute;sentation et leur comportement permet de les utiliser plus ais&eacute;ment.</p>

<p>
<strong>Pages de collection</strong>
</p>

<p>Utilisez les pages de la collection pour g&eacute;rer une collection d'objets d'administration existants. G&eacute;n&eacute;ralement, ce type de page contient un ou plusieurs des &eacute;l&eacute;ments suivants :</p>

<dl>

<dt>
<strong>Port&eacute;e, Filtre et Pr&eacute;f&eacute;rences</strong>
</dt>
<dd>Ces &eacute;l&eacute;ments sont d&eacute;crits dans les rubriques <a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>, <a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a> et <a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>.</dd>

<dt>
<strong>Table d'objets existants</strong>
</dt>
<dd>La table pr&eacute;sente les objets d'administration existants du type sp&eacute;cifi&eacute; par la page de la collection. Les colonnes de la table r&eacute;sument les valeurs des
principaux param&egrave;tres pour ces objets. Si aucun objet n'existe encore, une table vide est affich&eacute;e. Utilisez les boutons disponibles pour cr&eacute;er un nouvel objet.</dd>

<dt>
<strong>Boutons d'actions</strong>
</dt>
<dd>Les boutons disponibles sont d&eacute;crits
dans la rubrique <a href="rcon_buttons.html">Boutons de la console administrative</a>. Dans la plupart des cas, vous devez s&eacute;lectionner un ou plusieurs objets dans la table, puis cliquer sur un bouton.
L'action est alors appliqu&eacute;e aux objets s&eacute;lectionn&eacute;s.</dd>

<dt>
<strong>Boutons &agrave; bascule pour le tri</strong>
</dt>
<dd>Les en-t&ecirc;tes de colonnes suivants
figurant dans la table sont des ic&ocirc;nes repr&eacute;sentant l'ordre croissant
(^) et l'ordre d&eacute;croissant (v). Par d&eacute;faut, les &eacute;l&eacute;ments tels que les
noms sont class&eacute;s par ordre d&eacute;croissant (par ordre alphab&eacute;tique). Pour activer un autre ordre de tri, cliquez sur les ic&ocirc;nes
correspondant aux colonnes &agrave; trier.</dd>

</dl>

<p>
<strong>Pages de d&eacute;tails</strong>
</p>

<p>Utilisez ces pages pour configurer des objets d'administration sp&eacute;cifiques, tels qu'un serveur d'applications. G&eacute;n&eacute;ralement, ce type de page contient un ou plusieurs des &eacute;l&eacute;ments suivants :</p>

<dl>

<dt>
<strong>Page de configuration &agrave; onglets</strong>
</dt>
<dd>Cette page compos&eacute;e de
diff&eacute;rents onglets permet de modifier la configuration d'un objet
d'administration.</dd>

<dt>
<strong>Page d'ex&eacute;cution &agrave; onglets</strong>
</dt>
<dd>Ce type de page affiche la configuration en cours, utilis&eacute;e pour l'objet d'administration. Dans la plupart des cas, ces
pages sont accessibles en lecture seulement.</dd>

<dt>
<strong>Boutons d'actions</strong>
</dt>
<dd>Les boutons disponibles sont d&eacute;crits
dans la rubrique <a href="rcon_buttons.html">Boutons de la console administrative</a>.</dd>

</dl>

<p>
<strong>Pages d'assistant</strong>
</p>

<p>Utilisez ces pages pour effectuer une proc&eacute;dure de configuration, compos&eacute;e de plusieurs &eacute;tapes. N'oubliez pas que les assistants affichent ou masquent certaines &eacute;tapes de la proc&eacute;dure en fonction
des caract&eacute;ristiques de l'objet sp&eacute;cifique que vous configurez.</p>

</body>
</html>
