<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres du service de mise en cache dynamique</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="udyn_rcachesettings"></a>
<h2>Param&egrave;tres du service de mise en cache dynamique</h2>

<p>Cette page permet de configurer et de g&eacute;rer les param&egrave;tres du service de mise en cache dynamique. </p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>Serveurs</strong> &gt; <strong>Serveurs d'applications</strong> &gt; <em>serveur </em> &gt; <strong>Service de cache dynamique</strong>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="DynamicCache__startup_description"></a>Etat au d&eacute;marrage</strong>
</dt>
<dd>Indique si la cache dynamique est activ&eacute;e.</dd>
<dt>
<strong><a name="DynamicCache_cacheSize_description"></a>Taille de la cache</strong>
</dt>
<dd>Indique un entier positif sp&eacute;cifiant le nombre maximal d'entr&eacute;es que peut contenir la cache. 
<p>Dans cette zone, entrez la taille de la cache ; &agrave; savoir, une valeur comprise entre 100 &agrave; 200 000.</p>

</dd>
<dt>
<strong><a name="DynamicCache_defaultPriority_description"></a>Priorit&eacute; par d&eacute;faut</strong>
</dt>
<dd>Indique la priorit&eacute; par d&eacute;faut des entr&eacute;es de m&eacute;moire cache, d&eacute;terminant le d&eacute;lai de conservation d'une entr&eacute;e dans une m&eacute;moire cache enti&egrave;re. 
<table border="1" cellpadding="1">

<tr>

<td align="left" valign="top" class="base">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">1</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="DynamicCache_enableDiskOffload_description"></a>D&eacute;chargement du disque</strong>
</dt>
<dd>Indique si le d&eacute;chargement du disque est activ&eacute;.
<p>Par d&eacute;faut, la m&eacute;moire cache dynamique g&egrave;re le nombre d'entr&eacute;es configur&eacute;es en m&eacute;moire.  Si de nouvelles entr&eacute;es sont cr&eacute;&eacute;es lorsque la cache est satur&eacute;e, les propri&eacute;t&eacute;s configur&eacute;es pour chaque entr&eacute;e de cache, ainsi qu'un algorithme LRU, sont utilis&eacute;s pour supprimer des entr&eacute;es de la cache.  Vous avez &eacute;galement la possibilit&eacute; de configurer le d&eacute;chargement du disque et, au lieu de supprimer les entr&eacute;es de la m&eacute;moire, vous pouvez les copier sur le syst&egrave;me de fichiers (l'emplacement est configurable) et y acc&eacute;der ult&eacute;rieurement.</p>

</dd>
</dl>
</div>
</body>
</html>
