<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres de cookie</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="cook_set"></a>
<h2>Param&egrave;tres de cookie</h2>

<p>Cette page permet de configurer des param&egrave;tres de cookies pour la gestion des sessions.</p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>Serveurs</strong> &gt; <strong>Serveurs
d'applications</strong> &gt; <em>nom_serveur</em> &gt; <strong>Conteneur Web</strong> &gt; <strong>Gestion de session</strong> &gt; <strong>Activer les
cookies</strong>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="Cookie_name_description"></a>Nom du cookie  </strong>
</dt>
<dd>Nom unique du cookie de gestion de session. La sp&eacute;cification de servlet requiert le nom JSESSIONID. Cette valeur peut
cependant &ecirc;tre configur&eacute;e pour offrir plus de flexibilit&eacute;. </dd>
<dt>
<strong><a name="Cookie_secure_description"></a>Cookies s&eacute;curis&eacute;s </strong>
</dt>
<dd>Indique que les cookies de session incluent la zone
"secure". Lorsque cette option est activ&eacute;e, l'&eacute;change des cookies se
limite uniquement aux sessions HTTPS. </dd>
<dt>
<strong><a name="Cookie_domain_description"></a>Domaine du cookie</strong>
</dt>
<dd>Indique le nom de domaine d'un cookie de suivi de session. Cette valeur contr&ocirc;le si un navigateur envoie ou non un cookie &agrave; des
serveurs particuliers. Par exemple, si vous indiquez un domaine
particulier, les cookies de session sont envoy&eacute;s vers les
h&ocirc;tes de ce domaine. Le domaine par d&eacute;faut est le serveur.</dd>
<dt>
<strong><a name="Cookie_path_description"></a>Chemin du cookie</strong>
</dt>
<dd>Indique qu'un cookie est envoy&eacute; &agrave; l'URL d&eacute;sign&eacute;e dans le
chemin d'acc&egrave;s.
La cha&icirc;ne sp&eacute;cifi&eacute;e doit repr&eacute;senter un chemin existant sur le serveur. "/" indique le r&eacute;pertoire racine.
  Sp&eacute;cifiez une valeur si vous souhaitez restreindre les chemins
auxquels le cookie pourra &ecirc;tre envoy&eacute;.
La restriction des chemins permet d'&eacute;viter que le cookie ne soit envoy&eacute; &agrave; certaines URL sur le serveur. Si vous sp&eacute;cifiez le r&eacute;pertoire racine, le cookie est envoy&eacute; quelle
que soit l'URL du serveur &agrave; laquelle acc&egrave;de le client.</dd>
<dt>
<strong><a name="Cookie_maximum_age"></a>Age maximal des cookies  </strong>
</dt>
<dd>Sp&eacute;cifie la dur&eacute;e de vie du cookie sur le navigateur
client.   Indiquez que le cookie ne dure aussi longtemps que la session
en cours du navigateur ou sp&eacute;cifiez un &acirc;ge maximal. Si vous
choisissez l'&acirc;ge maximal, sp&eacute;cifiez-le en secondes.  Cette valeur
correspond &agrave; la valeur TTL (Time to Live) d&eacute;crite dans la
sp&eacute;cification de cookie.
<p>La valeur par d&eacute;faut est la session de navigateur en cours, ce qui
correspond &agrave; une valeur de -1.</p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
