<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres de l'environnement r&eacute;parti</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uprs_persistence"></a>
<h2>Param&egrave;tres de l'environnement r&eacute;parti</h2>

<p>Cette page permet d'indiquer un type pour la sauvegarde d'une session dans un environnement r&eacute;parti.</p>

<p>Pour afficher cette page de la console d'administration, cliquez
sur <strong>Serveurs</strong> &gt; <strong>Serveurs d'applications</strong> &gt;
<em>nom_serveur</em> &gt; <strong>Conteneur Web</strong> &gt; <strong>Gestion de
session</strong> &gt; <strong>Distributed Environment Settings</strong>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="SessionManager_persistence_description"></a>Sessions distribu&eacute;es</strong>
</dt>
<dd>Indique le type d'environnement distribu&eacute; &agrave; utiliser pour sauvegarder les sessions. 
<p></p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Aucune</td>
<td align="left" valign="top" class="base">Indique que la fonction de gestion de session ignore les
donn&eacute;es de la session lors de l'arr&ecirc;t du serveur.</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Base de donn&eacute;es</td>
<td align="left" valign="top" class="base">Indique que la fonction de gestion de la session enregistre
les informations de session dans la source de donn&eacute;es indiqu&eacute;e par
les param&egrave;tres de connexion &agrave; la source de donn&eacute;es. Cliquez sur <strong>Base de donn&eacute;es</strong> pour modifier ces param&egrave;tres de source de donn&eacute;es.</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">R&eacute;plication de m&eacute;moire &agrave; m&eacute;moire</td>
<td align="left" valign="top" class="base"> Indique que la fonction de gestion de la session enregistre
les informations de session dans une source de donn&eacute;es en m&eacute;moire.
Les informations de session sont copi&eacute;es vers les autres fonctions de gestion de session afin de permettre la reprise sur  incident.
Cliquez sur <strong>R&eacute;plication de m&eacute;moire &agrave; m&eacute;moire</strong> pour indiquer le r&eacute;plicateur &agrave; utiliser et modifier les param&egrave;tres de m&eacute;moire &agrave; m&eacute;moire. <em>(Uniquement pour WebSphere Application Server Network Deployment.)</em></td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
