<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de services personnalis&eacute;s</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rsvr_services"></a>
<h2>Collection de services personnalis&eacute;s</h2>

<p>Cette page permet d'afficher la liste des services disponibles sur le serveur d'applications et de savoir s'ils sont activ&eacute;s. Un service personnalis&eacute; offre la possibilit&eacute; de se connecter &agrave; un serveur d'applications WebSphere
 pour d&eacute;finir un code qui s'ex&eacute;cute au d&eacute;marrage ou &agrave; l'arr&ecirc;t du serveur.</p>

<p>Pour afficher la page de la console d'administration, s&eacute;lectionnez
<strong>Serveurs &gt; Serveurs d'applications
&gt; </strong><em>nom_serveur</em><strong>&gt; Services personnalis&eacute;s</strong>.</p>

<dl>
<dt>
<strong><a name="CustomService_externalConfigURL_description"></a>URL de la configuration externe</strong>
</dt>
<dd>Indique l'URL du fichier de configuration d'un service
personnalis&eacute;.
<p>Si la classe des services personnalis&eacute;s requiert un fichier de
configuration, la valeur fournit un nom de chemin complet &agrave; ce
fichier de configuration. Ce nom de fichier est transmis
&agrave; la classe de service personnalis&eacute;.</p>

</dd>
<dt>
<strong><a name="CustomService_classname_description"></a>Nom de classe</strong>
</dt>
<dd>Indique le nom de classe de l'impl&eacute;mentation du service. Cette classe
 doit impl&eacute;menter l'interface du service personnalis&eacute;.

</dd>
<dt>
<strong><a name="CustomService_displayName_description"></a>Nom affich&eacute;</strong>
</dt>
<dd>Indique le nom du service.

</dd>
<dt>
<strong><a name="Service_enable_description"></a>D&eacute;marrage</strong>
</dt>
<dd>Indique si le serveur tente de d&eacute;marrer et d'initialiser
le service lorsque le processus qui le contient (le serveur) d&eacute;marre. Par d&eacute;faut, le service n'est pas activ&eacute; lorsque le processus qui le
contient d&eacute;marre.

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="urun_rsvr_services_inst.html">Param&egrave;tres de services personnalis&eacute;s</a>
<br>

</div>
</body>
</html>
