<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres du journal de service IBM</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="RASLogs_description"></a>
<h2>Param&egrave;tres du journal de service IBM</h2>

<p>Cette page permet de configurer le journal de service IBM,
&eacute;galement appel&eacute; <em>journal d'activit&eacute;</em>.</p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>R&eacute;solution des
incidents &gt; Journaux et trace</strong> &gt; <em>serveur</em> &gt; <strong>Journaux des services
IBM</strong>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="enable_service_log_description"></a>Activer le journal de service</strong>
</dt>
<dd>Indique la cr&eacute;ation d'un fichier journal par le journal de
service IBM.</dd>
<dt>
<strong><a name="file_name_description"></a>Nom de fichier</strong>
</dt>
<dd>Indique le nom du fichier utilis&eacute; par le journal de service IBM.</dd>
<dt>
<strong><a name="max_file_size_description"></a>Taille maximale du fichier</strong>
</dt>
<dd>Indique la taille maximale, en m&eacute;ga-octets, du fichier journal de service.
La valeur pas d&eacute;faut est 2 Mo.
<p>Lorsque cette taille est atteinte, le fichier journal boucle sur
lui-m&ecirc;me. Le journal de service n'est pas remplac&eacute; par un nouveau
contrairement aux journaux JVM.</p>

</dd>
<dt>
<strong><a name="filter_level_description"></a>Filtrage des messages</strong>
</dt>
<dd>D&eacute;finit le niveau de filtrage des messages &agrave; l'&eacute;tat voulu. Cette option permet d'&eacute;liminer ou de supprimer certaines cat&eacute;gories
de messages. Cette valeur de filtre s'applique &agrave; tous les journaux,
pas uniquement au journal du service.</dd>
<dt>
<strong><a name="enable_correlationid_description"></a>Activer l'ID de corr&eacute;lation</strong>
</dt>
<dd>Indique la g&eacute;n&eacute;ration d'un ID de corr&eacute;lation consign&eacute; avec
chaque message.
<p>L'ID de corr&eacute;lation permet d'&eacute;tablir une corr&eacute;lation entre
l'activit&eacute; et une demande client particuli&egrave;re ou d'&eacute;tablir des
corr&eacute;lations entre les activit&eacute;s sur plusieurs serveurs
d'applications.</p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

</div>
</body>
</html>
