<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>D&eacute;tails du service de d&eacute;bogage</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="debug_description"></a>
<h2>D&eacute;tails du service de d&eacute;bogage</h2>

<p>Cette page vous permet d'afficher et de modifier les param&egrave;tres utilis&eacute;s par le Service de d&eacute;bogage.</p>

<p>Pour afficher cette page de la console administrative, cliquez sur <strong>Serveurs &gt; Serveurs d'applications
</strong> &gt; <em>serveur</em> &gt; <strong>Service de d&eacute;bogage</strong>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="startup_enable"></a>D&eacute;marrage</strong>
</dt>
<dd>D&eacute;termine si le serveur tentera ou non de lancer le service de d&eacute;bogage au moment de son d&eacute;marrage.</dd>
<dt>
<strong><a name="jvm_debug_port"></a>Port de d&eacute;bogage JVM</strong>
</dt>
<dd>Indique le port que la JVM (Java Virtual Machine) &eacute;coutera pour les connexions de d&eacute;bogage.</dd>
<dt>
<strong><a name="jvm_debug_arguments"></a>Arguments du d&eacute;bogage JVM</strong>
</dt>
<dd>Sp&eacute;cifie la cha&icirc;ne d'arguments de d&eacute;bogage utilis&eacute;e pour d&eacute;marrer la JVM en mode d&eacute;bogage.</dd>
<dt>
<strong><a name="debug_class_filters"></a>Filtres des classes pour le d&eacute;bogage</strong>
</dt>
<dd>Sp&eacute;cifie une table de classes &agrave; ne pas prendre en compte lors du d&eacute;bogage. Si vous &ecirc;tes en mode pas &agrave; pas, le programme de d&eacute;bogage ne s'arr&ecirc;tera pas dans les classes correspondant &agrave; une entr&eacute;e de filtre.</dd>
<dt>
<strong><a name="bsf_debug_port"></a>Port de d&eacute;bogage BSF</strong>
</dt>
<dd>Indique le port sur lequel le gestionnaire de d&eacute;bogage BSF est &agrave; l'&eacute;coute.</dd>
<dt>
<strong><a name="bsf_logging_level"></a>Niveau de consignation BSF</strong>
</dt>
<dd>Indique le niveau de consignation fourni par le gestionnaire de d&eacute;bogage BSF.
Les valeurs admises sont comprises entre 0 et 3, 3 &eacute;tant le niveau de consignation le plus &eacute;lev&eacute;.</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
