<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres d'&eacute;tat WebSphere</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rstatus"></a>
<h2>Param&egrave;tres d'&eacute;tat WebSphere</h2>

<p>Utilisez la zone d'&eacute;tat WebSphere de la console d'administration pour afficher les messages
 d'erreurs et d'&eacute;v&eacute;nements d'ex&eacute;cution renvoy&eacute;s par WebSphere Application Server.</p>

<p>La zone Etat WebSphere s'affiche en bas de la console et reste
visible &agrave; mesure que vous naviguez de la page d'accueil (Home)
WebSphere vers les autres pages.
La zone comporte deux cadres :
<strong>Probl&egrave;mes de configuration dans WebSphere</strong> et <strong>Messages
d'ex&eacute;cution WebSphere</strong>.  Cliquez sur <strong>Pr&eacute;c&eacute;dent</strong> ou <strong>Suivant</strong> pour passer d'un
cadre &agrave; l'autre.</p>

<p>Cliquez sur l'ic&ocirc;ne dans la partie sup&eacute;rieure droite de la zone
pour r&eacute;g&eacute;n&eacute;rer les informations affich&eacute;es.  L'intervalle de r&eacute;g&eacute;n&eacute;ration automatique peut &ecirc;tre ajust&eacute; dans les
param&egrave;tres <strong>Pr&eacute;f&eacute;rences</strong>.</p>

<dl>
<dt>
<strong><a name="WebSphereStatus_configurationProblems_description"></a>Probl&egrave;mes de configuration dans WebSphere</strong>
</dt>
<dd>Affiche le nombre de fichiers de l'espace de travail. Ce
panneau affiche &eacute;galement le nombre d'incidents rencontr&eacute;s dans la
configuration d'administration pour l'ID utilisateur.
<p>Cliquez sur le nombre pour afficher des informations d&eacute;taill&eacute;es
relatives aux incidents.</p>

</dd>
<dt>
<strong><a name="WebSphereStatus_runtimeProblems_description"></a>Message d'ex&eacute;cution WebSphere</strong>
</dt>
<dd>Affiche le nombre de messages renvoy&eacute;s par WebSphere Application Server ainsi que le nombre de messages
 d'erreur (ic&ocirc;ne <strong>x</strong>), de messages d'avertissement (ic&ocirc;ne <strong>!</strong> ) et les
 messages d'information (ic&ocirc;ne <strong>i</strong>).
<p>Cliquez sur le nombre de messages pour afficher les d&eacute;tails.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
