<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Op&eacute;rations de la barre des t&acirc;ches de la console
d'administration</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rtaskbar"></a>
<h2>Op&eacute;rations de la barre des t&acirc;ches de la console
d'administration</h2>

<p>La barre de t&acirc;ches de la console d'administration permet
de revenir &agrave; la page d'accueil de la console, de sauvegarder les
modifications apport&eacute;es aux configurations d'administration, de
d&eacute;finir les pr&eacute;f&eacute;rences de la console, de se d&eacute;connecter de la
console et d'acc&eacute;der aux informations relatives au produit.</p>

<p>Pour visualiser la barre des t&acirc;ches, acc&eacute;dez &agrave; la console
d'administration de WebSphere Application Server et consultez la barre horizontale situ&eacute;e
dans la partie sup&eacute;rieure de la console. La barre des t&acirc;ches permet
d'effectuer plusieurs op&eacute;rations.</p>

<dl>
<dt>
<strong><a name="menu_workspace_home"></a>Accueil</strong>
</dt>
<dd>Affiche la page d'accueil de la console d'administration
dans l'espace de travail.
L'espace de travail se trouve dans la
partie droite de la console. La page d'accueil fournit des liens vers
les informations relatives &agrave; l'utilisation de WebSphere Application Server.

</dd>
<dt>
<strong><a name="menu_save_changes"></a>Sauvegarder</strong>
</dt>
<dd>Affiche la page Sauvegarder que vous utilisez pour sauvegarder le travail que vous avez effectu&eacute; dans la
 console d'administration.
<p>Les modifications apport&eacute;es aux configurations d'administration sont sauvegard&eacute;es dans un r&eacute;f&eacute;rentiel
principal compos&eacute; de fichiers de configuration .xml. Pour afficher les modifications qui sont sauvegard&eacute;es, d&eacute;veloppez <strong>Afficher les &eacute;l&eacute;ments avec modifications</strong>. De temps en temps, enregistrez votre travail pour ne pas perdre vos
modifications accidentellement.</p>

</dd>
<dt>
<strong><a name="menu_preferences"></a>Pr&eacute;f&eacute;rences</strong>
</dt>
<dd>Affiche la page Pr&eacute;f&eacute;rences que vous pouvez utiliser si vous voulez que la page de l'espace de
 travail de la console d'administration soit r&eacute;g&eacute;n&eacute;r&eacute;e automatiquement apr&egrave;s modifications, que les messages de
 confirmation s'affichent et que l'environnement par d&eacute;faut soit le noeud de la console d'administration.

</dd>
<dt>
<strong><a name="menu_logout"></a>Se d&eacute;connecter</strong>
</dt>
<dd>Ferme la session de la console d'administration et affiche la page de connexion. Si vous avez modifi&eacute; la configuration d'administration depuis la derni&egrave;re sauvegarde de la
 configuration dans le r&eacute;f&eacute;rentiel ma&icirc;tre, la page Sauvegarder s'affiche avant de retourner
 &agrave; la page de connexion. Cliquez sur <strong>Sauvegarder</strong> pour
sauvegarder les modifications effectu&eacute;es dans le r&eacute;f&eacute;rentiel
principal ou sur <strong>Eliminer</strong> pour fermer la session sans
sauvegarder les modifications ou sur <strong>Se d&eacute;connecter</strong> pour
fermer la  session sans sauvegarder les modifications tout en ayant
la possibilit&eacute; de restaurer ces derni&egrave;res lors de votre prochaine
connexion &agrave; la console.

</dd>
<dt>
<strong><a name="menu_help"></a>Aide</strong>
</dt>
<dd>Ouvre l'aide en ligne de WebSphere Application Server dans un nouveau navigateur Web

</dd>
<dt>
<strong><a name="menu_help"></a>Afficher/masquer les descriptions de zone et de page</strong>
</dt>
<dd>Permet de choisir d'afficher ou non les informations relatives aux zones et aux pages de la console dans les pages. Les ic&ocirc;nes situ&eacute;es dans la partie de droite de la barre des t&acirc;ches
permettent de passer de l'affichage au masquage.

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="ucon_rpref.html">Param&egrave;tres de pr&eacute;f&eacute;rences</a>
<br>

<a href="ucon_rlogin.html">Param&egrave;tres de connexion</a>
<br>

</div>
</body>
</html>
