<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Zones de la console d'administration</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rconsole"></a>
<h2>Zones de la console d'administration</h2>

<p>La console d'administration permet de cr&eacute;er et de g&eacute;rer
des ressources, des applications et des serveurs ou d'afficher les
messages relatifs au produit.</p>

<p>Pour afficher la console d'administration, v&eacute;rifiez que le serveur
d'applications de la console d'administration est actif. Dans un
navigateur Web, entrez l'URL de la console d'administration et une
fois que vous acc&eacute;dez &agrave; une page de connexion, entrez l'ID
utilisateur et si n&eacute;cessaire un mot de passe.</p>

<p>La console comporte les zones principales suivantes, que vous
pouvez redimensionner :</p>

<dl>
<dt>
<strong><a name="menu"></a>Barre des t&acirc;ches</strong>
</dt>
<dd>La barre des t&acirc;ches permet de retourner &agrave; la page
d'accueil de la console, de sauvegarder les modifications apport&eacute;es
aux configurations d'administration, de sp&eacute;cifier des pr&eacute;f&eacute;rences
 pour la console, de se d&eacute;connecter de la console et d'acc&eacute;der aux
informations relatives au produit.

</dd>
<dt>
<strong><a name="tree"></a>Arborescence de navigation</strong>
</dt>
<dd>Cette arborescence situ&eacute;e dans la partie gauche de la
console propose des liens permettant d'acc&eacute;der aux pages de la
console utilis&eacute;es pour cr&eacute;er et g&eacute;rer des composants dans une cellule
d'administration WebSphere Application Server.
<p>Cliquez sur le signe <strong>+</strong> &agrave; c&ocirc;t&eacute; d'un &eacute;l&eacute;ment ou d'un dossier
de l'arborescence pour que la branche correspondante se d&eacute;ploie. Cliquez sur le signe <strong>-</strong> d'une  branche d&eacute;ploy&eacute;e pour la
r&eacute;duire.  Cliquez deux fois sur un &eacute;l&eacute;ment de l'arborescence pour le faire
passer successivement de l'&eacute;tat d&eacute;ploy&eacute; &agrave; l'&eacute;tat r&eacute;duit et inversement.</p>

</dd>
<dt>
<strong><a name="workspace"></a>Espace de travail</strong>
</dt>
<dd>L'espace de travail situ&eacute; dans la partie droite de la
console contient des pages permettant de cr&eacute;er et de g&eacute;rer des objets
de configuration tels que des serveurs et des ressources.
 Cliquez sur les liens dans l'arborescence de navigation pour
afficher les diff&eacute;rents types d'objets configur&eacute;s. Dans l'espace de
travail, cliquez sur les objets configur&eacute;s pour afficher leurs
configurations, leur &eacute;tat d'ex&eacute;cution et les options. Cliquez sur
<strong>Accueil</strong> dans la barre des t&acirc;ches pour afficher la page
d'accueil de l'espace de travail qui contient des liens permettant
d'acc&eacute;der &agrave; des informations sur l'utilisation de WebSphere Application Server.

</dd>
<dt>
<strong><a name="status"></a>Etat WebSphere</strong>
</dt>
<dd>La zone de messages d'&eacute;tat figurant au bas de la console
fournit des informations sur les messages renvoy&eacute;s par WebSphere Application Server,
sur les erreurs de la configuration d'administration, ainsi que
sur les &eacute;v&eacute;nements d'ex&eacute;cution. Cliquez sur <strong>Pr&eacute;c&eacute;dent</strong>
 ou <strong>Suivant</strong> pour passer de l'affichage des incidents de
configuration aux &eacute;v&eacute;nements d'ex&eacute;cution et inversement.
<p>Vous pouvez r&eacute;gler l'intervalle entre les r&eacute;g&eacute;n&eacute;rations
automatiques dans les param&egrave;tres Pr&eacute;f&eacute;rences.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="ucon_rlogin.html">Param&egrave;tres de connexion</a>
<br>

<a href="ucon_rnavtree.html">Op&eacute;rations de l'arborescence de navigation de la console administrative</a>
<br>

<a href="ucon_rpref.html">Param&egrave;tres de pr&eacute;f&eacute;rences</a>
<br>

<a href="ucon_rtaskbar.html">Op&eacute;rations de la barre des t&acirc;ches de la console administrative</a>
<br>

<a href="ucon_rstatus.html">Param&egrave;tres d'&eacute;tat WebSphere</a>
<br>

</div>
</body>
</html>
