<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Op&eacute;rations de l'arborescence de navigation de la console administrative</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rnavtree"></a>
<h2>Op&eacute;rations de l'arborescence de navigation de la console administrative</h2>

<p>L'arborescence de navigation de la console d'administration permet d'acc&eacute;der aux pages de cr&eacute;ation et de gestion des serveurs, des applications, des ressources et d'autres composants.</p>

<p>Pour afficher l'arborescence, acc&eacute;dez &agrave; la console
d'administration de WebSphere Application Server et consultez l'arborescence situ&eacute;e dans
la partie gauche de la console. Cette arborescence fournit des
fonctions de navigation aux t&acirc;ches de configuration et des
informations d'ex&eacute;cution. Les rubriques principales disponibles dans
l'arborescence sont pr&eacute;sent&eacute;es ci-dessous. Pour utiliser
l'arborescence, d&eacute;veloppez la rubrique principale qui vous int&eacute;resse
et s&eacute;lectionnez un &eacute;l&eacute;ment dans la liste d&eacute;velopp&eacute;e pour afficher une
page permettant de r&eacute;aliser la t&acirc;che voulue.</p>

<dl>
<dt>
<strong><a name="nav_webSphere_servers"></a>Serveurs</strong>
</dt>
<dd>Permet de configurer des serveurs d'administration et
d'autres types de serveurs tels que les serveurs JMS.

</dd>
<dt>
<strong><a name="rnavtree"></a>Applications</strong>
</dt>
<dd>Permet d'installer des applications sur des serveurs et de g&eacute;rer les applications
 install&eacute;es.

</dd>
<dt>
<strong><a name="rnavtree-r"></a>Ressources</strong>
</dt>
<dd>Permet de configurer des ressources et d'afficher des
informations sur les ressources existantes dans la cellule
d'administration.

</dd>
<dt>
<strong><a name="rnavtree-sc"></a>S&eacute;curit&eacute;</strong>
</dt>
<dd>Permet d'acc&eacute;der au Centre de s&eacute;curit&eacute; que vous
 utilisez pour s&eacute;curiser les applications et les serveurs et pour
 g&eacute;rer les utilisateurs de la console d'administration.

</dd>
<dt>
<strong><a name="nav_webSphere_environment_configuration"></a>Environnement</strong>
</dt>
<dd>Permet de configurer les h&ocirc;tes, les serveurs Web, les
variables et d'autres composants.

</dd>
<dt>
<strong><a name="rnavtree-pd"></a>R&eacute;solution des incidents</strong>
            &nbsp;
            </dt>
<dd>Permet de contr&ocirc;ler et de tracer les erreurs et incidents
de configuration.

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="ucon_rlogin.html">Param&egrave;tres de connexion</a>
<br>

</div>
</body>
</html>
