# IBM Confidential OCO Source Material
# 5630-A36 (C) COPYRIGHT International Business Machines Corp. 2003
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has
# been determined that the code that uses this file expects only a single
# apostrophe, and should work properly when a single apostrophe is provided.
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.16.1.5,5,03/08/19,10:39:24
#
#CMVCPATHNAME ws/code/webui.wssecurity/src/wssecurity/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE TRUE
#COMPONENTPREFIX SECG
#COMPONENTNAMEFOR SECG WebUI SecurityCenter

nav.wssecurity=Services Web
nav.wssecurity.trust.anchors=Points d'ancrage dignes de confiance
nav.wssecurity.certificate.stores=Magasin de certificats
nav.wssecurity.ldapcertificate.stores=Magasin de certificats LDAP
nav.wssecurity.collcertificate.stores=Magasin de certificats de collection
nav.wssecurity.key.locators=Adresses de cl\u00e9
nav.wssecurity.id.evaluators=Evaluateurs d'ID dignes de confiance
nav.wssecurity.login.mappings=Mappages de connexion

WSSecurity.displayName=Propri\u00e9t\u00e9s
WSSecurity.description=Propri\u00e9t\u00e9s suppl\u00e9mentaires pour la configuration des informations de liaison par d\u00e9faut

WSServerSecurity.displayName=Services Web : Liaisons par d\u00e9faut pour la s\u00e9curit\u00e9 des services Web
WSServerSecurity.description=Sp\u00e9cifie une liste de liaisons par d\u00e9faut pour la s\u00e9curit\u00e9 des services Web. Vous pouvez remplacer ces liaisons par d\u00e9faut dans les fichiers de liaison pour un service Web sp\u00e9cifique.

WSServerBinding.displayName=Services Web : Liaisons de s\u00e9curit\u00e9 du serveur
WSServerBinding.description=Configuration des liaisons c\u00f4t\u00e9 serveur pour la s\u00e9curit\u00e9 des services Web.
WSClientBinding.displayName=Services Web : Liaisons de s\u00e9curit\u00e9 du client
WSClientBinding.description=Configuration des liaisons c\u00f4t\u00e9 client pour la s\u00e9curit\u00e9 des services Web.
WSBinding.service.displayName=Service Web
WSBinding.port.displayName=Port
WSBinding.edit=Edition...

WSSecurity.property.displayName=Propri\u00e9t\u00e9s
WSSecurity.property.description=Propri\u00e9t\u00e9s suppl\u00e9mentaires pour la configuration.
WSSecurity.property.name.displayName=Nom de la propri\u00e9t\u00e9
WSSecurity.property.name.description=Sp\u00e9cifie le nom de la propri\u00e9t\u00e9.
WSSecurity.property.value.displayName=Valeur de la propri\u00e9t\u00e9
WSSecurity.property.value.description=Sp\u00e9cifie la valeur de la propri\u00e9t\u00e9.

WSSecurity.nonceCacheTimeout.displayname=D\u00e9lai d'expiration de la m\u00e9moire cache Nonce
WSSecurity.nonceCacheTimeout.description=Sp\u00e9cifie la valeur du d\u00e9lai d'expiration du nonce mis en m\u00e9moire cache sur le serveur. Nonce est une valeur g\u00e9n\u00e9r\u00e9e de mani\u00e8re al\u00e9atoire.

TrustAnchor.displayName=Points d'ancrage dignes de confiance
TrustAnchor.description=Sp\u00e9cifie une liste de configurations de magasin de cl\u00e9s contenant les certificats racines dignes de confiance. Ces configurations sont utilis\u00e9es pour la validation du chemin d'acc\u00e8s au certificat des jetons de s\u00e9curit\u00e9 entrants, format\u00e9s X.509. Le magasin de cl\u00e9s doit \u00eatre cr\u00e9\u00e9 \u00e0 l'aide de l'outil keytool du kit de d\u00e9veloppement. N'utilisez pas l'utilitaire de gestion des cl\u00e9s car il ne cr\u00e9era pas de magasin de cl\u00e9s du format attendu.
TrustAnchor.smallIcon=TrustAnchor.gif
TrustAnchor.largeIcon=TrustAnchor32X32.gif
TrustAnchor.name.displayName=Nom du point d'ancrage digne de confiance
TrustAnchor.name.description=Sp\u00e9cifie le nom unique utilis\u00e9 pour identifier un point d'ancrage digne de confiance.
TrustAnchor.keystorePwd.displayName=Mot de passe du magasin de cl\u00e9s
TrustAnchor.keystorePwd.description=Sp\u00e9cifie le mot de passe permettant d'acc\u00e9der au fichier de stockage des cl\u00e9s.
TrustAnchor.keystorePath.displayName=Chemin d'acc\u00e8s au magasin de cl\u00e9s
TrustAnchor.keystorePath.description=Sp\u00e9cifie l'emplacement du fichier de stockage des cl\u00e9s.
TrustAnchor.keystoreType.displayName=Type de magasin de cl\u00e9s
TrustAnchor.keystoreType.description=Sp\u00e9cifie le type de fichier de stockage des cl\u00e9s, JKS ou JCEKS.
TrustAnchor.keystoreType.JKS=JKS
TrustAnchor.keystoreType.JCEKS=JCEKS

LDAPCertStore.displayName=Magasin de certificats LDAP
LDAPCertStore.description=Sp\u00e9cifie le serveur LDAP contenant les entr\u00e9es de certificat interm\u00e9diaires non dignes de confiance. Le serveur LDAP est utilis\u00e9 en tant que magasin de certificats pour la validation du chemin d'acc\u00e8s au certificat des jetons de s\u00e9curit\u00e9 entrants, format\u00e9s X.509.
LDAPCertStore.smallIcon=LDAPCertStore.gif
LDAPCertStore.largeIcon=LDAPCertStore32X32.gif
LDAPCertStore.name.displayName=Nom du magasin de certificats
LDAPCertStore.name.description=Sp\u00e9cifie le libell\u00e9 de type cha\u00eene du magasin de certificats.
LDAPCertStore.provider.displayName=Fournisseur de magasin de certificats
LDAPCertStore.provider.description=Sp\u00e9cifie le nom du fournisseur de l'impl\u00e9mentation du magasin de certificats.
LDAPCertStore.ldapServer.displayName=Serveur LDAP
LDAPCertStore.ldapServer.description=Sp\u00e9cifie le nom d'h\u00f4te du serveur LDAP.
LDAPCertStore.ldapPort.displayName=Port LDAP
LDAPCertStore.ldapPort.description=Sp\u00e9cifie le num\u00e9ro de port du serveur LDAP.
LDAPCertStore.ldapProperties.displayName=Propri\u00e9t\u00e9s du serveur LDAP
LDAPCertStore.ldapProperties.description=Sp\u00e9cifie des propri\u00e9t\u00e9s suppl\u00e9mentaires pour le serveur LDAP.

CollectionCertStore.displayName=Magasin de certificats de collection
CollectionCertStore.description=Sp\u00e9cifie une liste de fichiers de certificat interm\u00e9diaires, non dignes de confiance. Ce magasin de certificats de collection est utilis\u00e9 pour la validation du chemin d'acc\u00e8s au certificat des jetons de s\u00e9curit\u00e9 entrants, format\u00e9s X.509.
CollectionCertStore.smallIcon=LDAPCertStore.gif
CollectionCertStore.largeIcon=LDAPCertStore32X32.gif
CollectionCertStore.name.displayName=Nom du magasin de certificats
CollectionCertStore.name.description=Sp\u00e9cifie le nom unique du magasin de certificats.
CollectionCertStore.provider.displayName=Fournisseur de magasin de certificats
CollectionCertStore.provider.description=Sp\u00e9cifie le nom du fournisseur de l'impl\u00e9mentation du magasin de certificats.

X509Certificate.displayName=Certificats X.509
X509Certificate.description=Sp\u00e9cifie une liste de certificats X.509.
X509Certificate.smallIcon=X509Certificate.gif
X509Certificate.largeIcon=X509Certificate32X32.gif
X509Certificate.reference.displayName=Chemin d'acc\u00e8s au certificat X.509
X509Certificate.reference.description=Sp\u00e9cifie le chemin d'acc\u00e8s au fichier de certificat X.509.

KeyLocator.displayName=Adresses de cl\u00e9
KeyLocator.description=Sp\u00e9cifie une liste de configurations d'adresses de cl\u00e9 permettant d'extraire la cl\u00e9 pour la signature et le chiffrement. Une classe d'adresse de cl\u00e9 peut \u00eatre personnalis\u00e9e pour extraire des cl\u00e9s d'autres types de r\u00e9f\u00e9rentiels.  L'impl\u00e9mentation par d\u00e9faut extrait des cl\u00e9s d'un magasin de cl\u00e9s.
KeyLocator.smallIcon=KeyLocator.gif
KeyLocator.largeIcon=KeyLocator32X32.gif
KeyLocator.name.displayName=Nom d'adresse de la cl\u00e9
KeyLocator.name.description=Sp\u00e9cifie le nom unique utilis\u00e9 pour identifier la d\u00e9finition d'adresse de la cl\u00e9.
KeyLocator.className.displayName=Nom de classe d'adresse de la cl\u00e9
KeyLocator.className.description=Sp\u00e9cifie le nom d'une classe d'impl\u00e9mentation d'adresse de cl\u00e9. L'adresse de la cl\u00e9 doit impl\u00e9menter l'interface com.ibm.wsspi.wssecurity.config.KeyLocator.
KeyLocator.keystorePwd.displayName=Mot de passe du magasin de cl\u00e9s
KeyLocator.keystorePwd.description=Sp\u00e9cifie le mot de passe permettant d'acc\u00e9der au fichier de stockage des cl\u00e9s. Facultatif si l'adresse de cl\u00e9 n'utilise pas de magasin de cl\u00e9s.
KeyLocator.keystorePath.displayName=Chemin d'acc\u00e8s au magasin de cl\u00e9s
KeyLocator.keystorePath.description=Sp\u00e9cifie le chemin d'acc\u00e8s au fichier de stockage des cl\u00e9s. Facultatif si l'adresse de cl\u00e9 n'utilise pas de magasin de cl\u00e9s.
KeyLocator.keystoreType.displayName=Type de magasin de cl\u00e9s
KeyLocator.keystoreType.description=Sp\u00e9cifie le type du fichier de stockage des cl\u00e9s. Facultatif si l'adresse de cl\u00e9 n'utilise pas de magasin de cl\u00e9s.
KeyLocator.keystoreType.JKS=JKS
KeyLocator.keystoreType.JCEKS=JCEKS

WSKey.displayName=Cl\u00e9s
WSKey.description=Sp\u00e9cifie une liste d'entr\u00e9es de cl\u00e9s dans le magasin de cl\u00e9s avec des libell\u00e9s de type cha\u00eene. Remarque : Il n'est pas n\u00e9cessaire de dresser la liste de toutes les entr\u00e9es de certificat en tant que cl\u00e9s. En revanche, le nom distinctif (DN) du certificat est utilis\u00e9 comme cl\u00e9 de recherche.
WSKey.smallIcon=Key.gif
WSKey.largeIcon=Key32X32.gif
WSKey.name.displayName=Nom de cl\u00e9
WSKey.name.description=Sp\u00e9cifie le libell\u00e9 de type cha\u00eene de la cl\u00e9. Ce nom est utilis\u00e9 par l'adresse de cl\u00e9 pour rechercher la cl\u00e9.
WSKey.alias.displayName=Alias de cl\u00e9
WSKey.alias.description=Sp\u00e9cifie l'alias de la  cl\u00e9 dans le magasin de cl\u00e9s.
WSKey.keypass.displayName=Mot de passe de cl\u00e9
WSKey.keypass.description=Sp\u00e9cifie le mot de passe de la cl\u00e9.

TrustedIDEvaluator.displayName=Evaluateurs d'ID dignes de confiance
TrustedIDEvaluator.description=Sp\u00e9cifie une liste d'\u00e9valuateurs d'ID dignes de confiance qui d\u00e9terminent si l'autorit\u00e9 v\u00e9rifiant l'identit\u00e9 est digne de confiance.
TrustedIDEvaluator.smallIcon=TrustedIDEvaluator.gif
TrustedIDEvaluator.largeIcon=TrustedIDEvaluator32X32.gif
TrustedIDEvaluator.name.displayName=Nom d'\u00e9valuateur d'ID digne de confiance
TrustedIDEvaluator.name.description=Sp\u00e9cifie le nom unique permettant d'identifier une configuration d'\u00e9valuateur d'ID digne de confiance.
TrustedIDEvaluator.className.displayName=Nom de classe d'\u00e9valuateur d'ID digne de confiance
TrustedIDEvaluator.className.description=Sp\u00e9cifie le nom de la classe d'impl\u00e9mentation d'\u00e9valuateur d'ID digne de confiance. L'\u00e9valuateur d'ID digne de confiance doit impl\u00e9menter la classe com.ibm.wsspi.wssecurity.id.TrustedIDEvaluator.
TrustedIDEvaluator.none=Aucun
TrustedIDEvaluator.existing=D\u00e9finition de l'\u00e9valuateur existant
TrustedIDEvaluator.existing.select=S\u00e9lection du programme d'\u00e9valuation de l'ID s\u00e9curis\u00e9
TrustedIDEvaluator.specified=D\u00e9finition de l'\u00e9valuateur de liaison

LoginMapping.displayName=Mappages de connexion
LoginMapping.description=Sp\u00e9cifie une liste de configurations pour la validation des jetons de s\u00e9curit\u00e9 dans les messages entrants.
LoginMapping.smallIcon=LoginMapping.gif
LoginMapping.largeIcon=LoginMapping32X32.gif
LoginMapping.name.displayName=Nom de mappage de connexion
LoginMapping.name.description=Sp\u00e9cifie le libell\u00e9 de type cha\u00eene du mappage de connexion.
LoginMapping.authMethod.displayName=M\u00e9thode d'authentification
LoginMapping.authMethod.description=Sp\u00e9cifie la m\u00e9thode d'authentification. Vous pouvez utiliser n'importe quelle cha\u00eene, mais elle doit correspondre \u00e0 l'\u00e9l\u00e9ment <AuthMethod> de la configuration au niveau du service. Les quatre mots suivants sont r\u00e9serv\u00e9s et ont une signification sp\u00e9ciale : "BasicAuth" : <UsernameToken> utilise un nom d'utilisateur et un mot de passe, "IDAssertion" : <UsernameToken> utilise uniquement un nom d'utilisateur, "Signature" : utilise le nom distinctif (DN) du signataire et "LTPA" : valide un jeton.
LoginMapping.configName.displayName=Nom de configuration JAAS
LoginMapping.configName.description=Sp\u00e9cifie le nom de la configuration de connexion JAAS (Java Authentication and Authorization Service).
LoginMapping.tokenTypeURI.displayName=URI de type de jeton
LoginMapping.tokenTypeURI.description=Sp\u00e9cifie l'URI de l'espace de nom, indiquant le type de jeton de s\u00e9curit\u00e9 accept\u00e9. Si les jetons de s\u00e9curit\u00e9 binaires sont accept\u00e9s, la valeur doit mentionner l'attribut "valueType" dans l'\u00e9l\u00e9ment <BinarySecurityToken>. Si les jetons XML sont accept\u00e9s, la valeur doit mentionner le nom de l'\u00e9l\u00e9ment de niveau sup\u00e9rieur du jeton XML. Si les mots r\u00e9serv\u00e9s sont sp\u00e9cifi\u00e9s dans la zone "M\u00e9thode d'authentification" ci-dessus, cette zone est ignor\u00e9e.
LoginMapping.tokenTypeName.displayName=Nom local du type de jeton
LoginMapping.tokenTypeName.description=Sp\u00e9cifie le nom local indiquant le type de jeton de s\u00e9curit\u00e9 accept\u00e9. Si les jetons de s\u00e9curit\u00e9 binaires sont accept\u00e9s, la valeur doit mentionner l'attribut "valueType" dans l'\u00e9l\u00e9ment <BinarySecurityToken>. Si les jetons XML sont accept\u00e9s, la valeur doit mentionner le nom de l'\u00e9l\u00e9ment de niveau sup\u00e9rieur du jeton XML. Si les mots r\u00e9serv\u00e9s sont sp\u00e9cifi\u00e9s dans la zone "M\u00e9thode d'authentification" ci-dessus, cette zone est ignor\u00e9e.
LoginMapping.callbackClassName.displayName=Nom de classe de fabrique de gestionnaire de rappels
LoginMapping.callbackClassName.description=Sp\u00e9cifie le nom de la classe d'impl\u00e9mentation de la fabrique de gestionnaire de rappels. Elle doit impl\u00e9menter la classe com.ibm.wsspi.wssecurity.auth.callback.CallbackHandlerFactory.
LoginMapping.callbackProperties.displayName=Propri\u00e9t\u00e9s de la fabrique de gestionnaire de rappels
LoginMapping.callbackProperties.description=Propri\u00e9t\u00e9s suppl\u00e9mentaires pour la fabrique de gestionnaire de rappels.
LoginMapping.makeSoapAvailable.displayName=Rendre le message SOAP disponible
LoginMapping.makeSoapAvailable.description=description
LoginMapping.nonceMaxAge.displayName=Age maximal du nonce
LoginMapping.nonceMaxAge.description=Sp\u00e9cifie le d\u00e9lai apr\u00e8s lequel l'horodatage nonce arrive \u00e0 expiration. Nonce est une valeur g\u00e9n\u00e9r\u00e9e de mani\u00e8re al\u00e9atoire.
LoginMapping.nonceClockSkew.displayName=D\u00e9calage d'horloge nonce
LoginMapping.nonceClockSkew.description=Sp\u00e9cifie la valeur du d\u00e9calage de l'horloge \u00e0 prendre en compte lorsque WebSphere Application Server v\u00e9rifie l'heure d'arriv\u00e9e du message. Nonce est une valeur g\u00e9n\u00e9r\u00e9e de mani\u00e8re al\u00e9atoire.

WSSecurity.validate=Valider la configuration
WSSecurity.updateRuntime=Mettre \u00e0 jour l'ex\u00e9cution
WSSecurity.seconds=secondes

RequestReceiver.displayName=Liaison de r\u00e9cepteur de demande
RequestReceiver.description=Sp\u00e9cifie la configuration de liaison permettant de recevoir des messages de demande pour la s\u00e9curit\u00e9 des services Web.

ResponseSender.displayName=Liaison d'\u00e9metteur de r\u00e9ponse
ResponseSender.description=Sp\u00e9cifie la configuration de liaison permettant d'envoyer des messages de r\u00e9ponse pour la s\u00e9curit\u00e9 des services Web.

RequestSender.displayName=Liaison d'\u00e9metteur de demande
RequestSender.description=Sp\u00e9cifie la configuration de liaison permettant d'envoyer des messages de demande pour la s\u00e9curit\u00e9 des services Web.

ResponseReceiver.displayName=Liaison de r\u00e9cepteur de r\u00e9ponse
ResponseReceiver.description=Sp\u00e9cifie la configuration de liaison permettant de recevoir des messages de r\u00e9ponse pour la s\u00e9curit\u00e9 des services Web.

SigningInfo.displayName=Informations relatives \u00e0 la signature
SigningInfo.description=Sp\u00e9cifie la configuration des param\u00e8tres de signature. Ces param\u00e8tres peuvent \u00eatre \u00e9galement utilis\u00e9s pour la validation de certificats X.509 lorsque la valeur de "M\u00e9thode d'authentification" est "IDAssertion" et que le "Type d'ID" est "Certificat X509" dans la configuration serveur. Dans ce cas, vous ne devez remplir que les zones "Chemin d'acc\u00e8s au certificat".
SigningInfo.smallIcon=SigningInformation.gif
SigningInfo.largeIcon=SigningInformation32X32.gif
SigningInfo.method.displayName=M\u00e9thode de signature
SigningInfo.method.description=Sp\u00e9cifie l'URI d'algorithme de la m\u00e9thode de signature.
SigningInfo.canonMethod.displayName=M\u00e9thode de canonisation
SigningInfo.canonMethod.description=Sp\u00e9cifie l'URI de l'algorithme de la m\u00e9thode de canonisation.
SigningInfo.digestMethod.displayName=M\u00e9thode simplifi\u00e9e
SigningInfo.digestMethod.description=Sp\u00e9cifie l'URI de l'algorithme de la m\u00e9thode simplifi\u00e9e.
SigningInfo.signingKey.displayName=Cl\u00e9 de signature
SigningInfo.signingKey.description=Sp\u00e9cifie les informations de cl\u00e9 utilis\u00e9es pour la signature. Ces zones sont ignor\u00e9es dans la configuration cot\u00e9 r\u00e9cepteur.
SigningInfo.signingKeyName.displayName=Nom de cl\u00e9
SigningInfo.signingKeyName.description=Sp\u00e9cifie le libell\u00e9 de type cha\u00eene de la cl\u00e9. Ce nom est converti en la cl\u00e9 r\u00e9elle par l'adresse de cl\u00e9 sp\u00e9cifi\u00e9e.
SigningInfo.signingKeyRef.displayName=R\u00e9f\u00e9rence d'adresse de la cl\u00e9
SigningInfo.signingKeyRef.description=Sp\u00e9cifie la r\u00e9f\u00e9rence au nom de l'adresse de cl\u00e9.
SigningInfo.certificatePath.displayName=Chemin d'acc\u00e8s au certificat
SigningInfo.certificatePath.description=Sp\u00e9cifie les param\u00e8tres de validation du chemin d'acc\u00e8s au certificat. Lorsque l'option "Faire confiance \u00e0 tous" est activ\u00e9e, la validation est ignor\u00e9e et tous les certificats entrants sont jug\u00e9s dignes de confiance. Ces zones sont ignor\u00e9es dans la configuration c\u00f4t\u00e9 \u00e9metteur.
SigningInfo.none=Aucune
SigningInfo.any=Faire confiance \u00e0 tous
SigningInfo.trustAnchor=Point d'ancrage digne de confiance
SigningInfo.trustAnchor.displayName=Point d'ancrage digne de confiance
SigningInfo.trustAnchor.description=Sp\u00e9cifie la r\u00e9f\u00e9rence au nom du point d'ancrage digne de confiance.
SigningInfo.certificateStore.displayName=Magasin de certificats
SigningInfo.certificateStore.description=Sp\u00e9cifie la r\u00e9f\u00e9rence au nom du magasin de certificats.
SigningInfo.specified=Informations de signature d\u00e9di\u00e9es

EncryptionInfo.displayName=Informations de chiffrement
EncryptionInfo.description=Sp\u00e9cifie la configuration des param\u00e8tres de chiffrement et d\u00e9chiffrement.
EncryptionInfo.smallIcon=EncryptionInfo.gif
EncryptionInfo.largeIcon=EncryptionInfo32X32.gif
EncryptionInfo.name.displayName=Nom d'information de chiffrement
EncryptionInfo.name.description=Sp\u00e9cifie le nom unique de l'information de chiffrement.
EncryptionInfo.keyReference.displayName=R\u00e9f\u00e9rence d'adresse de la cl\u00e9
EncryptionInfo.keyReference.description=Sp\u00e9cifie la r\u00e9f\u00e9rence au nom de l'adresse de la cl\u00e9 \u00e0 utiliser.
EncryptionInfo.keyName.displayName=Nom de cl\u00e9 de chiffrement
EncryptionInfo.keyName.description=Sp\u00e9cifie le nom de la cl\u00e9. Ce nom est converti en la cl\u00e9 r\u00e9elle par l'adresse de cl\u00e9 sp\u00e9cifi\u00e9e.
EncryptionInfo.keyAlgorithm.displayName=Algorithme de chiffrement de cl\u00e9
EncryptionInfo.keyAlgorithm.description=Sp\u00e9cifie l'URI de l'algorithme de la m\u00e9thode de chiffrement de cl\u00e9.
EncryptionInfo.dataAlgorithm.displayName=Algorithme de chiffrement de donn\u00e9es
EncryptionInfo.dataAlgorithm.description=Sp\u00e9cifie l'URI de l'algorithme de la m\u00e9thode de chiffrement des donn\u00e9es.
EncryptionInfo.none=Aucune
EncryptionInfo.specified=Informations de chiffrement d\u00e9di\u00e9es

LoginBinding.displayName=Liaison de connexion
LoginBinding.description=Sp\u00e9cifie la configuration d'envoi des jetons de s\u00e9curit\u00e9 dans les messages.
LoginBinding.smallIcon=LoginBinding.gif
LoginBinding.largeIcon=LoginBinding32X32.gif
LoginBinding.dedicated.description=Utilis\u00e9 par l'\u00e9metteur pour g\u00e9n\u00e9rer des jetons de s\u00e9curit\u00e9 dans le message. Il existe 4 m\u00e9thodes d'authentification pr\u00e9d\u00e9finies : "BasicAuth" : g\u00e9n\u00e8re <UsernameToken> avec un nom d'utilisateur et un mot de passe; "IDAssertion" : g\u00e9n\u00e8re <UsernameToken> qui utilise un nom d'utilisateur uniquement. "Signature" : utilise le nom distinctif (DN) du signataire. "LTPA" : utilise <BinarySecurityToken> du justificatif d'appel ou g\u00e9n\u00e8re le jeton \u00e0 partir des donn\u00e9es Basic Auth. Vous pouvez \u00e9galement d\u00e9finir une m\u00e9thode d'authentification personnalis\u00e9e.
LoginBinding.name.displayName=Nom de liaison de connexion
LoginBinding.name.description=Libell\u00e9 de type cha\u00eene de la liaison de connexion.
LoginBinding.authMethod.displayName=M\u00e9thode d'authentification
LoginBinding.authMethod.description=Sp\u00e9cifie la m\u00e9thode d'authentification. Vous pouvez utiliser n'importe quelle cha\u00eene, mais elle doit correspondre \u00e0 l'\u00e9l\u00e9ment <AuthMethod> de la configuration au niveau du service. Les quatre mots suivants sont r\u00e9serv\u00e9s et ont une signification sp\u00e9ciale ; "BasicAuth" : <UsernameToken> utilise un nom d'utilisateur et un mot de passe, "IDAssertion" : <UsernameToken> utilise uniquement un nom d'utilisateur, "Signature" : utilise le nom distinctif (DN) du signataire et "LTPA" : valide un jeton.
LoginBinding.authMethod.basicAuth=Authentification de base
LoginBinding.authMethod.idAssertion=V\u00e9rification d'ID
LoginBinding.authMethod.signature=Signature
LoginBinding.callbackHandler.displayName=Gestionnaire de rappels
LoginBinding.callbackHandler.description=Sp\u00e9cifie le nom de la classe d'impl\u00e9mentation du gestionnaire de rappels. Elle doit impl\u00e9menter javax.security.auth.callback.CallbackHandler et avoir un constructeur dont la signature est (String defaultId, char[] defaultPass, java.util.Map properties).
LoginBinding.tokenTypeURI.displayName=URI de type de jeton
LoginBinding.tokenTypeURI.description=Sp\u00e9cifie l'URI de l'espace de nom, indiquant le type de jeton de s\u00e9curit\u00e9 accept\u00e9. Si les jetons de s\u00e9curit\u00e9 binaires sont accept\u00e9s, la valeur doit mentionner l'attribut "valueType" dans l'\u00e9l\u00e9ment <BinarySecurityToken>. Si les jetons XML sont accept\u00e9s, la valeur doit mentionner le nom de l'\u00e9l\u00e9ment de niveau sup\u00e9rieur du jeton XML. Si les mots r\u00e9serv\u00e9s sont sp\u00e9cifi\u00e9s dans la zone "M\u00e9thode d'authentification" ci-dessus, cette zone est ignor\u00e9e.
LoginBinding.tokenTypeName.displayName=Nom local du type de jeton
LoginBinding.tokenTypeName.description=Sp\u00e9cifie le nom local indiquant le type de jeton de s\u00e9curit\u00e9 accept\u00e9. Si les jetons de s\u00e9curit\u00e9 binaires sont accept\u00e9s, la valeur doit mentionner l'attribut "valueType" dans l'\u00e9l\u00e9ment <BinarySecurityToken>. Si les jetons XML sont accept\u00e9s, la valeur doit mentionner le nom de l'\u00e9l\u00e9ment de niveau sup\u00e9rieur du jeton XML. Si les mots r\u00e9serv\u00e9s sont sp\u00e9cifi\u00e9s dans la zone "M\u00e9thode d'authentification" ci-dessus, cette zone est ignor\u00e9e.
LoginBinding.basicAuthID.displayName=ID utilisateur d'authentification de base
LoginBinding.basicAuthID.description=Sp\u00e9cifie l'ID utilisateur par d\u00e9faut qui est transmis au constructeur du gestionnaire de rappels sp\u00e9cifi\u00e9 pr\u00e9c\u00e9demment.
LoginBinding.basicAuthPwd.displayName=Mot de passe d'authentification de base
LoginBinding.basicAuthPwd.description=Sp\u00e9cifie le mot de passe par d\u00e9faut qui est transmis au constructeur du gestionnaire de rappels sp\u00e9cifi\u00e9 pr\u00e9c\u00e9demment.
LoginBinding.none=Aucune
LoginBinding.specified=Liaison de connexion d\u00e9di\u00e9e

WSSecurity.viewServerDD.displayName=Affichage de l'extension du descripteur de d\u00e9ploiement du serveur des services Web
WSSecurity.viewServerDD.description=Affiche l'extension du descripteur de d\u00e9ploiement du serveur des services Web
WSSecurity.viewClientDD.displayName=Affichage de l'extension du descripteur de d\u00e9ploiement du client des services Web
WSSecurity.viewClientDD.description=Affiche l'extension du descripteur de d\u00e9ploiement du client des services Web
WSSecurity.ddExt.displayName=Extension du descripteur de d\u00e9ploiement

WSSecurityUtil.errorCreateResource=Une exception s'est produite lors de la cr\u00e9ation d'un fichier ws-security.xml file et d'un domaine de s\u00e9curit\u00e9 wssecurity dans le contexte {0}
wssecurity.both.tokenValueType=Si vous utilisez le type de valeur de jeton, vous devez sp\u00e9cifier l'URI du type de jeton et le nom local du type de jeton.
wssecurity.loginBinding.rqdFields=Une m\u00e9thode d'authentification et un gestionnaire de rappels sont requis.
wssecurity.loginBinding.authRqdFields=Si vous utilisez BasicAuth, vous devez indiquer un ID utilisateur et un mot de passe.
wssecurity.trustedIDEvaluator.rqdFields=Le nom d'\u00e9valuateur d'ID digne de confiance et le nom de classe d'\u00e9valuateur d'ID digne de confiance sont requis.
wssecurity.trustedIDEvaluator.rqdExisting=La d\u00e9finition de l'\u00e9valuateur existant est requise.
wssecurity.encryptionInfo.rqdFields=Le nom d'information de chiffrement, la r\u00e9f\u00e9rence d'adresse de la cl\u00e9 et l'algorithme de chiffrement de cl\u00e9 sont requis.
wssecurity.signingInfo.rqdFields=Une m\u00e9thode de signature est requise.
wssecurity.signingInfo.keyOrPath=Vous devez indiquer les informations relatives \u00e0 la cl\u00e9 de signature ou au chemin d'acc\u00e8s au certificat, mais pas les deux.
wssecurity.signingInfo.trustAny=Si "Point d'ancrage digne de confiance" est s\u00e9lectionn\u00e9, vous devez sp\u00e9cifier le point d'ancrage digne de confiance et le magasin de certificats.
wssecurity.signingInfo.signingKey=Si un nom de cl\u00e9 est sp\u00e9cifi\u00e9, vous devez indiquer la r\u00e9f\u00e9rence d'adresse de la cl\u00e9.
wssecurity.both.keyLocator=Si vous utilisez une adresse de cl\u00e9, vous devez indiquer le nom de la cl\u00e9 et la r\u00e9f\u00e9rence d'adresse de la cl\u00e9.
wssecurity.collectionCertStore.rqdX509=Un magasin de certificats de collection doit inclure au moins un certificat X.509.
wssecurity.warn.appmgmt=La s\u00e9curit\u00e9 des services Web peut \u00eatre activ\u00e9e dans votre application. Si tel est le cas, passez aux panneaux de gestion d'applications d'entreprise (pour ce faire, cliquez sur Applications > Applications d'entreprise) afin de configurer les informations de liaison pour la s\u00e9curit\u00e9 des services Web. Les informations de liaison pour la s\u00e9curit\u00e9 des services Web ne sont pas collect\u00e9es pendant le d\u00e9ploiement d'application. Si les informations de liaison ne sont pas configur\u00e9es correctement, votre application risque de ne pas d\u00e9marrer correctement ou de ne pas \u00eatre utilisable.
wssecurity.duplicate.trustAnchor=Un point d'ancrage digne de confiance portant ce nom existe d\u00e9j\u00e0. Le nom du point d'ancrage digne de confiance doit \u00eatre unique.
wssecurity.duplicate.collectionCertStore=Un magasin de certificats de collection portant ce nom existe d\u00e9j\u00e0. Le nom du magasin de certificats de collection doit \u00eatre unique.
wssecurity.duplicate.keyLocator=Une adresse de cl\u00e9 portant ce nom existe d\u00e9j\u00e0. Le nom de l'adresse de cl\u00e9 doit \u00eatre unique.
wssecurity.duplicate.trustedIDEvaluator=Un \u00e9valuateur d'ID digne de confiance portant ce nom existe d\u00e9j\u00e0. Le nom de l'\u00e9valuateur d'ID digne de confiance doit \u00eatre unique.
wssecurity.duplicate.loginMapping=Un mappage de connexion avec cette m\u00e9thode d'authentification existe d\u00e9j\u00e0. Le mappage de connexion avec m\u00e9thode d'authentification doit \u00eatre unique.
wssecurity.duplicate.encryptionInfo=Une information de chiffrement pourtant ce nom existe d\u00e9j\u00e0. Le nom de l'information de chiffrement doit \u00eatre unique.
wssecurity.validate.binding.failed=La validation des informations de liaison a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.server.failed=La validation des informations de liaison au serveur a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.client.failed=La validation des informations de liaison au client a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.responseSender=La validation des informations de l'\u00e9metteur de r\u00e9ponse a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.responseReceiver=La validation des informations du r\u00e9cepteur de r\u00e9ponse a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.requestSender=La validation des informations de l'\u00e9metteur de demande a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.validate.requestReceiver=La validation des informations du r\u00e9cepteur de demande a \u00e9chou\u00e9. Examinez les informations de liaison pour trouver les incoh\u00e9rences dans les descripteurs de d\u00e9ploiement de la s\u00e9curit\u00e9 des services Web.
wssecurity.updateRuntime.failed=L'ex\u00e9cution n'est pas parvenue \u00e0 mettre \u00e0 jour les informations de configuration de liaison \u00e0 partir du r\u00e9f\u00e9rentiel. V\u00e9rifiez les param\u00e8tres de configuration du fait qu'une configuration non valide peut entra\u00eener l'\u00e9chec de la mise \u00e0 jour. Essayez de red\u00e9marrer le serveur pour que les modifications prennent effet.
wssecurity.nonce.not.supported=Nonce n'est pas pris en charge pour les m\u00e9thodes d'authentification autres que <i>BasicAuth</i>.
wssecurity.all.required=Toutes les zones sont requises.

http.basicauth.title.displayName=Authentification de base HTTP
http.basicauth.title.description=Authentification de base pour le protocole de transfert HTTP.
http.basicauthid.displayName=ID d'authentification de base
http.basicauthid.description=Sp\u00e9cifie l'ID utilisateur pour l'authentification de base HTTP pour ce port. L'authentification de base HTTP SSL peut \u00eatre configur\u00e9e en activant aussi Configuration HTTP SSL.
http.basicauthpwd.displayName=Mot de passe d'authentification de base
http.basicauthpwd.description=Sp\u00e9cifie le mot de passe de l'authentification de base HTTP pour ce port.
http.sslconfig.title.displayName=Configuration HTTP SSL
http.sslconfig.title.description=Alias de la Configuration SSL pour le protocole de transfert HTTP.
http.sslenabled.displayName=HTTP SSL Activ\u00e9
http.sslenabled.description=Indique si les communications de sockets s\u00e9curis\u00e9s sont activ\u00e9es pour le protocole de transfert HTTP sur ce port. Si l'option est activ\u00e9e, le param\u00e9trage de Configuration HTTP SSL est utilis\u00e9.
http.sslconfig.displayName=Configuration HTTP SSL
http.sslconfig.description=Alias de la Configuration SSL \u00e0 utiliser avec le protocole de transfert HTTP de ce port.  Utilis\u00e9 si HTTP SSL est activ\u00e9.

# The following error messages are accessed through Tr.error().
# Note that the SECGxxxx numbers are used to correlate the user visible messages (e.g. Tr.warning, Tr.error,
# Tr.audit) with an Explanation & User Response message that is documented in a Message Reference guide.
# Do not modify the existing SECGxxxx numbers.  See http://hany.austin.ibm.com/messages/index.html
# for info on how to add new messages.
# Every message you add to this section should also include an Explanation & a User Response.
# -------------------------------------------------------------------------------------------------
wssecurity.file.load.exception=SECG1000E: Une exception est survenue lors du chargement de la ressource {0} : {1}.
wssecurity.file.load.exception.explanation=Aucun fichier ws-security.xml n'a \u00e9t\u00e9 trouv\u00e9 dans l'ensemble des ressources.
wssecurity.file.load.exception.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------
wssecurity.utils.nowssec=SECG1001W: Le fichier ws-security.xml n'\u00e9tait pas disponible dans le contexte {0}.
wssecurity.utils.nowssec.explanation=Aucun fichier ws-security.xml n'a \u00e9t\u00e9 trouv\u00e9 dans le contexte des ressources.
wssecurity.utils.nowssec.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------

# End of Tr.error() message section
# -------------------------------------------------------------------------------------------------
