# IBM Confidential OCO Source Material
# 5630-A36 (C) COPYRIGHT International Business Machines Corp. 2003
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has
# been determined that the code that uses this file expects only a single
# apostrophe, and should work properly when a single apostrophe is provided.
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.16.1.5,5,03/08/19,10:39:24
#
#CMVCPATHNAME ws/code/webui.wssecurity/src/wssecurity/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE TRUE
#COMPONENTPREFIX SECG
#COMPONENTNAMEFOR SECG WebUI SecurityCenter

nav.wssecurity=Servicios Web
nav.wssecurity.trust.anchors=Anclas de confianza
nav.wssecurity.certificate.stores=Almac\u00e9n de certificados
nav.wssecurity.ldapcertificate.stores=Almac\u00e9n de certificados LDAP
nav.wssecurity.collcertificate.stores=Almac\u00e9n de certificados de colecciones
nav.wssecurity.key.locators=Localizadores de claves
nav.wssecurity.id.evaluators=Evaluadores de ID de confianza
nav.wssecurity.login.mappings=Correlaciones de inicio de sesi\u00f3n

WSSecurity.displayName=Propiedades
WSSecurity.description=Propiedades adicionales para la configuraci\u00f3n de la informaci\u00f3n de enlaces por omisi\u00f3n

WSServerSecurity.displayName=Servicios Web: Enlaces por omisi\u00f3n para Web Services Security
WSServerSecurity.description=Especifica una lista de los enlaces por omisi\u00f3n para Web Services Security. Puede alterar temporalmente estos enlaces por omisi\u00f3n en los archivos de enlaces de un servicio Web espec\u00edfico.

WSServerBinding.displayName=Servicios Web: Enlaces de seguridad del servidor
WSServerBinding.description=Configuraci\u00f3n de los enlaces del extremo del servidor para Web Services Security.
WSClientBinding.displayName=Servicios Web: Enlaces de seguridad del cliente
WSClientBinding.description=Configuraci\u00f3n de los enlaces del extremo del cliente para Web Services Security.
WSBinding.service.displayName=Servicio Web
WSBinding.port.displayName=Puerto
WSBinding.edit=Editar...

WSSecurity.property.displayName=Propiedades
WSSecurity.property.description=Propiedades adicionales de la configuraci\u00f3n.
WSSecurity.property.name.displayName=Nombre de propiedad
WSSecurity.property.name.description=Especifica el nombre de la propiedad.
WSSecurity.property.value.displayName=Valor de propiedad
WSSecurity.property.value.description=Especifica el valor de la propiedad.

WSSecurity.nonceCacheTimeout.displayname=Tiempo de espera de antememoria de Nonce
WSSecurity.nonceCacheTimeout.description=Especifica el valor del tiempo de espera para la antememoria de Nonce en el servidor. Nonce es un valor generado aleatoriamente.

TrustAnchor.displayName=Anclas de confianza
TrustAnchor.description=Especifica una lista de las configuraciones del almac\u00e9n de claves que contiene los certificados de confianza ra\u00edz. Estas configuraciones se utilizan para la validaci\u00f3n de v\u00edas de acceso de certificados de los s\u00edmbolos de seguridad entrantes con formato X.509. El almac\u00e9n de claves debe crearse mediante la herramienta de claves del Development Kit. No utilice el programa de utilidad de gesti\u00f3n de claves porque no crear\u00e1 un almac\u00e9n de claves con el formato esperado.
TrustAnchor.smallIcon=TrustAnchor.gif
TrustAnchor.largeIcon=TrustAnchor32X32.gif
TrustAnchor.name.displayName=Nombre del ancla de confianza
TrustAnchor.name.description=Especifica un nombre exclusivo utilizado para identificar un ancla de confianza.
TrustAnchor.keystorePwd.displayName=Contrase\u00f1a del almac\u00e9n de claves
TrustAnchor.keystorePwd.description=Especifica la contrase\u00f1a para el archivo del almac\u00e9n de claves.
TrustAnchor.keystorePath.displayName=V\u00eda de acceso del almac\u00e9n de claves
TrustAnchor.keystorePath.description=Especifica la ubicaci\u00f3n del archivo del almac\u00e9n de claves.
TrustAnchor.keystoreType.displayName=Tipo de almac\u00e9n de claves
TrustAnchor.keystoreType.description=Especifica el tipo de archivo del almac\u00e9n de claves, que puede ser JKS o JCEKS.
TrustAnchor.keystoreType.JKS=JKS
TrustAnchor.keystoreType.JCEKS=JCEKS

LDAPCertStore.displayName=Almac\u00e9n de certificados LDAP
LDAPCertStore.description=Especifica el servidor LDAP que contiene las entradas de certificados intermedios de no confianza. Este servidor LDAP se utiliza como almac\u00e9n de certificados para la validaci\u00f3n de v\u00edas de acceso de certificados de los s\u00edmbolos de seguridad entrantes con formato X.509.
LDAPCertStore.smallIcon=LDAPCertStore.gif
LDAPCertStore.largeIcon=LDAPCertStore32X32.gif
LDAPCertStore.name.displayName=Nombre del almac\u00e9n de certificados
LDAPCertStore.name.description=Especifica la etiqueta de la serie del almac\u00e9n de certificados.
LDAPCertStore.provider.displayName=Proveedor del almac\u00e9n de certificados
LDAPCertStore.provider.description=Especifica el nombre del proveedor de la implementaci\u00f3n del almac\u00e9n de certificados.
LDAPCertStore.ldapServer.displayName=Servidor LDAP
LDAPCertStore.ldapServer.description=Especifica el nombre de sistema principal del servidor LDAP.
LDAPCertStore.ldapPort.displayName=Puerto de LDAP
LDAPCertStore.ldapPort.description=Especifica el n\u00famero de puerto del servidor LDAP.
LDAPCertStore.ldapProperties.displayName=Propiedades del servidor LDAP
LDAPCertStore.ldapProperties.description=Especifica propiedades adicionales del servidor LDAP.

CollectionCertStore.displayName=Almac\u00e9n de certificados de colecciones
CollectionCertStore.description=Especifica una lista de archivos de certificados intermedios de no confianza. Este almac\u00e9n de certificados de colecciones se utiliza para la validaci\u00f3n de v\u00edas de acceso de certificados de los s\u00edmbolos de seguridad entrantes con formato X.509.
CollectionCertStore.smallIcon=LDAPCertStore.gif
CollectionCertStore.largeIcon=LDAPCertStore32X32.gif
CollectionCertStore.name.displayName=Nombre del almac\u00e9n de certificados
CollectionCertStore.name.description=Especifica el nombre exclusivo del almac\u00e9n de certificados.
CollectionCertStore.provider.displayName=Proveedor del almac\u00e9n de certificados
CollectionCertStore.provider.description=Especifica el nombre del proveedor de la implementaci\u00f3n del almac\u00e9n de certificados.

X509Certificate.displayName=Certificados X.509
X509Certificate.description=Especifica una lista de certificados X.509.
X509Certificate.smallIcon=X509Certificate.gif
X509Certificate.largeIcon=X509Certificate32X32.gif
X509Certificate.reference.displayName=V\u00eda de acceso de certificados X.509
X509Certificate.reference.description=Especifica la v\u00eda de acceso del archivo de certificados X.509.

KeyLocator.displayName=Localizadores de claves
KeyLocator.description=Especifica una lista de configuraciones de localizadores de claves que recuperan la clave para signatura y cifrado. La clase del localizador de claves puede personalizarse para recuperar claves de otros tipos de dep\u00f3sitos.  La implementaci\u00f3n por omisi\u00f3n recupera claves de un almac\u00e9n de claves.
KeyLocator.smallIcon=KeyLocator.gif
KeyLocator.largeIcon=KeyLocator32X32.gif
KeyLocator.name.displayName=Nombre del localizador de claves
KeyLocator.name.description=Especifica un nombre exclusivo utilizado para identificar la definici\u00f3n del localizador de claves.
KeyLocator.className.displayName=Nombre de clase del localizador de claves
KeyLocator.className.description=Especifica el nombre de la clase de implementaci\u00f3n del localizador de claves. El localizador de claves debe implementar la interfaz com.ibm.wsspi.wssecurity.config.KeyLocator.
KeyLocator.keystorePwd.displayName=Contrase\u00f1a del almac\u00e9n de claves
KeyLocator.keystorePwd.description=Especifica la contrase\u00f1a para el archivo del almac\u00e9n de claves. Es opcional si el localizador de claves no utiliza un almac\u00e9n de claves.
KeyLocator.keystorePath.displayName=V\u00eda de acceso del almac\u00e9n de claves
KeyLocator.keystorePath.description=Especifica la v\u00eda de acceso del archivo del almac\u00e9n de claves. Es opcional si el localizador de claves no utiliza un almac\u00e9n de claves.
KeyLocator.keystoreType.displayName=Tipo de almac\u00e9n de claves
KeyLocator.keystoreType.description=Especifica el tipo de archivo del almac\u00e9n de claves. Es opcional si el localizador de claves no utiliza un almac\u00e9n de claves.
KeyLocator.keystoreType.JKS=JKS
KeyLocator.keystoreType.JCEKS=JCEKS

WSKey.displayName=Claves
WSKey.description=Especifica una lista de las entradas de claves del almac\u00e9n de claves con etiquetas de serie. Nota: No tiene que listar todas las entradas de certificados como claves; en su lugar, se utiliza el nombre distinguido (DN) del certificado como clave de b\u00fasqueda.
WSKey.smallIcon=Key.gif
WSKey.largeIcon=Key32X32.gif
WSKey.name.displayName=Nombre de clave
WSKey.name.description=Especifica la etiqueta de serie de la clave. El localizador de claves utiliza este nombre para buscar la clave.
WSKey.alias.displayName=Alias de clave
WSKey.alias.description=Especifica el alias de la clave en el almac\u00e9n de claves.
WSKey.keypass.displayName=Contrase\u00f1a de la clave
WSKey.keypass.description=Especifica la contrase\u00f1a de la clave.

TrustedIDEvaluator.displayName=Evaluadores de ID de confianza
TrustedIDEvaluator.description=Especifica una lista de evaluadores de ID de confianza que determina si la autoridad de confirmaci\u00f3n de identidad (ID) es de confianza.
TrustedIDEvaluator.smallIcon=TrustedIDEvaluator.gif
TrustedIDEvaluator.largeIcon=TrustedIDEvaluator32X32.gif
TrustedIDEvaluator.name.displayName=Nombre del evaluador de ID de confianza
TrustedIDEvaluator.name.description=Especifica un nombre exclusivo para identificar la configuraci\u00f3n del evaluador de ID de confianza.
TrustedIDEvaluator.className.displayName=Nombre de clase del evaluador de ID de confianza
TrustedIDEvaluator.className.description=Especifica el nombre de la clase de implementaci\u00f3n del evaluador de ID de confianza. El evaluador de ID de confianza debe implementar la clase com.ibm.wsspi.wssecurity.id.TrustedIDEvaluator.
TrustedIDEvaluator.none=Ninguno
TrustedIDEvaluator.existing=Definici\u00f3n del evaluador existente
TrustedIDEvaluator.existing.select=Seleccionar el evaluador de ID de confianza
TrustedIDEvaluator.specified=Definici\u00f3n del evaluador de enlace

LoginMapping.displayName=Correlaciones de inicio de sesi\u00f3n
LoginMapping.description=Especifica una lista de configuraciones para validar los s\u00edmbolos de seguridad dentro de los mensajes entrantes.
LoginMapping.smallIcon=LoginMapping.gif
LoginMapping.largeIcon=LoginMapping32X32.gif
LoginMapping.name.displayName=Nombre de la correlaci\u00f3n de inicio de sesi\u00f3n
LoginMapping.name.description=Especifica la etiqueta de serie de la correlaci\u00f3n de inicio de sesi\u00f3n.
LoginMapping.authMethod.displayName=M\u00e9todo de autenticaci\u00f3n
LoginMapping.authMethod.description=Especifica el m\u00e9todo de autenticaci\u00f3n. Puede utilizar cualquier serie, pero la serie debe coincidir con el elemento <AuthMethod> de la configuraci\u00f3n a nivel de servicio. Las cuatro palabras siguientes est\u00e1n reservadas y tienen un significado especial: "BasicAuth": <UsernameToken> utiliza un nombre de usuario y una contrase\u00f1a; "IDAssertion": <UsernameToken> utiliza s\u00f3lo un nombre de usuario; "Signature": utiliza el nombre distinguido (DN) del firmante; y "LTPA": valida un s\u00edmbolo.
LoginMapping.configName.displayName=Nombre de la configuraci\u00f3n de JAAS
LoginMapping.configName.description=Especifica el nombre de la configuraci\u00f3n de inicio de sesi\u00f3n de JAAS (Java Authentication and Authorization Service).
LoginMapping.tokenTypeURI.displayName=URI del tipo de s\u00edmbolo
LoginMapping.tokenTypeURI.description=Especifica el URI del espacio de nombres, que indica el tipo del s\u00edmbolo de seguridad aceptado. Si se aceptan s\u00edmbolos de seguridad binarios, el valor debe indicar el atributo "valueType" en el elemento <BinarySecurityToken>. Si se aceptan s\u00edmbolos XML, el valor debe indicar el nombre del elemento de nivel superior del s\u00edmbolo XML. Si se especifican las palabras reservadas en el campo "M\u00e9todo de autenticaci\u00f3n" anterior, este campo se ignora.
LoginMapping.tokenTypeName.displayName=Nombre local del tipo de s\u00edmbolo
LoginMapping.tokenTypeName.description=Especifica el nombre local que indica el tipo del s\u00edmbolo de seguridad aceptado. Si se aceptan s\u00edmbolos de seguridad binarios, el valor debe indicar el atributo "valueType" en el elemento <BinarySecurityToken>. Si se aceptan s\u00edmbolos XML, el valor debe indicar el nombre del elemento de nivel superior del s\u00edmbolo XML. Si se especifican las palabras reservadas en el campo "M\u00e9todo de autenticaci\u00f3n" anterior, este campo se ignora.
LoginMapping.callbackClassName.displayName=Nombre de clase de la f\u00e1brica del manejador de retorno de llamada
LoginMapping.callbackClassName.description=Especifica el nombre de la clase de implementaci\u00f3n de la f\u00e1brica del manejador de retorno de llamada. Debe implementar la clase com.ibm.wsspi.wssecurity.auth.callback.CallbackHandlerFactory.
LoginMapping.callbackProperties.displayName=Propiedades de la f\u00e1brica del manejador de retorno de llamada
LoginMapping.callbackProperties.description=Propiedades adicionales de la f\u00e1brica del manejador de retorno de llamada.
LoginMapping.makeSoapAvailable.displayName=Hacer que el mensaje SOAP est\u00e9 disponible
LoginMapping.makeSoapAvailable.description=descripci\u00f3n
LoginMapping.nonceMaxAge.displayName=Antig\u00fcedad m\u00e1xima de Nonce
LoginMapping.nonceMaxAge.description=Especifica la cantidad de tiempo antes de que caduque la indicaci\u00f3n de la hora de Nonce. Nonce es un valor generado aleatoriamente.
LoginMapping.nonceClockSkew.displayName=Desfase horario de Nonce
LoginMapping.nonceClockSkew.description=Especifica el desfase horario a tener en cuenta cuando WebSphere Application Server comprueba lo reciente que es el mensaje. Nonce es un valor generado aleatoriamente.

WSSecurity.validate=Validar la configuraci\u00f3n
WSSecurity.updateRuntime=Actualizar el tiempo de ejecuci\u00f3n
WSSecurity.seconds=segundos

RequestReceiver.displayName=Enlace del receptor de peticiones
RequestReceiver.description=Especifica la configuraci\u00f3n de enlace para recibir mensajes de peticiones de Web Services Security.

ResponseSender.displayName=Enlace del remitente de respuestas
ResponseSender.description=Especifica la configuraci\u00f3n de enlace para enviar mensajes de respuestas de Web Services Security.

RequestSender.displayName=Enlace del remitente de peticiones
RequestSender.description=Especifica la configuraci\u00f3n de enlace para enviar mensajes de peticiones de Web Services Security.

ResponseReceiver.displayName=Enlace del receptor de respuestas
ResponseReceiver.description=Especifica la configuraci\u00f3n de enlace para recibir mensajes de respuestas de Web Services Security.

SigningInfo.displayName=Informaci\u00f3n de firmas
SigningInfo.description=Especifica la configuraci\u00f3n de los par\u00e1metros de firmas. Estos par\u00e1metros tambi\u00e9n se pueden utilizar para la validaci\u00f3n de certificados X.509 cuando "M\u00e9todo de autenticaci\u00f3n" es "IDAssertion" y "Tipo de ID" es "X509Certificate" en la configuraci\u00f3n a nivel de servidor. En esos casos, s\u00f3lo debe rellenar los campos "V\u00eda de acceso de certificados".
SigningInfo.smallIcon=SigningInformation.gif
SigningInfo.largeIcon=SigningInformation32X32.gif
SigningInfo.method.displayName=M\u00e9todo de signatura
SigningInfo.method.description=Especifica el URI del algoritmo del m\u00e9todo de signatura.
SigningInfo.canonMethod.displayName=M\u00e9todo de canonicalizaci\u00f3n
SigningInfo.canonMethod.description=Especifica el URI del algoritmo del m\u00e9todo de canonicalizaci\u00f3n.
SigningInfo.digestMethod.displayName=M\u00e9todo de conversi\u00f3n
SigningInfo.digestMethod.description=Especifica el URI del algoritmo del m\u00e9todo de conversi\u00f3n.
SigningInfo.signingKey.displayName=Clave de firma
SigningInfo.signingKey.description=Especifica la informaci\u00f3n de la clave utilizada para firmar. Estos campos se ignoran en la configuraci\u00f3n del extremo del receptor.
SigningInfo.signingKeyName.displayName=Nombre de clave
SigningInfo.signingKeyName.description=Especifica la etiqueta de serie de la clave. El localizador de claves especificado determina la clave real mediante este nombre.
SigningInfo.signingKeyRef.displayName=Referencia del localizador de claves
SigningInfo.signingKeyRef.description=Especifica la referencia con el nombre del localizador de claves.
SigningInfo.certificatePath.displayName=V\u00eda de acceso del certificado
SigningInfo.certificatePath.description=Especifica los valores para la validaci\u00f3n de la v\u00eda de acceso del certificado. Cuando est\u00e1 activado "Confiar en cualquiera", se pasa por alto esta validaci\u00f3n y se conf\u00eda en todos los certificados entrantes. Estos campos se ignoran en la configuraci\u00f3n del extremo del remitente.
SigningInfo.none=Ninguno
SigningInfo.any=Confiar en cualquiera
SigningInfo.trustAnchor=Ancla de confianza
SigningInfo.trustAnchor.displayName=Ancla de confianza
SigningInfo.trustAnchor.description=Especifica la referencia con el nombre del ancla de confianza.
SigningInfo.certificateStore.displayName=Almac\u00e9n de certificados
SigningInfo.certificateStore.description=Especifica la referencia con el nombre del almac\u00e9n de certificados.
SigningInfo.specified=Informaci\u00f3n de firmas dedicada

EncryptionInfo.displayName=Informaci\u00f3n de cifrado
EncryptionInfo.description=Especifica la configuraci\u00f3n de los par\u00e1metros de cifrado y descifrado.
EncryptionInfo.smallIcon=EncryptionInfo.gif
EncryptionInfo.largeIcon=EncryptionInfo32X32.gif
EncryptionInfo.name.displayName=Nombre de la informaci\u00f3n de cifrado
EncryptionInfo.name.description=Especifica el nombre exclusivo de la informaci\u00f3n de cifrado.
EncryptionInfo.keyReference.displayName=Referencia del localizador de claves
EncryptionInfo.keyReference.description=Especifica la referencia con el nombre del localizador de claves que se va a utilizar.
EncryptionInfo.keyName.displayName=Nombre de la clave de cifrado
EncryptionInfo.keyName.description=Especifica el nombre de la clave. El localizador de claves especificado determina la clave real mediante este nombre.
EncryptionInfo.keyAlgorithm.displayName=Algoritmo del cifrado de claves
EncryptionInfo.keyAlgorithm.description=Especifica el URI del algoritmo del m\u00e9todo de cifrado de claves.
EncryptionInfo.dataAlgorithm.displayName=Algoritmo del cifrado de datos
EncryptionInfo.dataAlgorithm.description=Especifica el URI del algoritmo del m\u00e9todo de cifrado de datos.
EncryptionInfo.none=Ninguno
EncryptionInfo.specified=Informaci\u00f3n de cifrado dedicada

LoginBinding.displayName=Enlace del inicio de sesi\u00f3n
LoginBinding.description=Especifica la configuraci\u00f3n para enviar los s\u00edmbolos de seguridad dentro de los mensajes.
LoginBinding.smallIcon=LoginBinding.gif
LoginBinding.largeIcon=LoginBinding32X32.gif
LoginBinding.dedicated.description=Utilizado por el remitente para generar s\u00edmbolos de seguridad generados en el mensaje. Existen 4 m\u00e9todos de autenticaci\u00f3n predefinidos: "BasicAuth": genera <UsernameToken> con un nombre de usuario y una contrase\u00f1a; "IDAssertion": genera <UsernameToken> s\u00f3lo con un nombre de usuario. "Signature": utiliza el nombre distinguido (DN) del firmante. "LTPA": utiliza <BinarySecurityToken> de la invocaci\u00f3n de credenciales o genera el s\u00edmbolo de los datos de Autenticaci\u00f3n b\u00e1sica. Tambi\u00e9n puede definir un m\u00e9todo de autenticaci\u00f3n personalizado.
LoginBinding.name.displayName=Nombre del enlace del inicio de sesi\u00f3n
LoginBinding.name.description=Etiqueta de serie del enlace del inicio de sesi\u00f3n.
LoginBinding.authMethod.displayName=M\u00e9todo de autenticaci\u00f3n
LoginBinding.authMethod.description=Especifica el m\u00e9todo de autenticaci\u00f3n. Puede utilizar cualquier serie, pero la serie debe coincidir con el elemento <AuthMethod> de la configuraci\u00f3n a nivel de servicio. Las cuatro palabras siguientes est\u00e1n reservadas y tienen un significado especial; "BasicAuth": <UsernameToken> utiliza un nombre de usuario y una contrase\u00f1a; "IDAssertion": <UsernameToken> utiliza s\u00f3lo un nombre de usuario; "Signature": utiliza el nombre distinguido (DN) del firmante; y "LTPA": valida un s\u00edmbolo.
LoginBinding.authMethod.basicAuth=Autenticaci\u00f3n b\u00e1sica
LoginBinding.authMethod.idAssertion=Confirmaci\u00f3n de identidad
LoginBinding.authMethod.signature=Signatura
LoginBinding.callbackHandler.displayName=Manejador de retorno de llamada
LoginBinding.callbackHandler.description=Especifica el nombre de la clase de implementaci\u00f3n del manejador de retorno de llamada. Debe implementar javax.security.auth.callback.CallbackHandler y debe tener un constructor cuya signatura sea (String defaultId, char[] defaultPass, java.util.Map properties).
LoginBinding.tokenTypeURI.displayName=URI del tipo de s\u00edmbolo
LoginBinding.tokenTypeURI.description=Especifica el URI del espacio de nombres que indica el tipo del s\u00edmbolo de seguridad aceptado. Si se aceptan s\u00edmbolos de seguridad binarios, el valor debe indicar el atributo "valueType" en el elemento <BinarySecurityToken>. Si se aceptan s\u00edmbolos XML, el valor debe indicar el nombre del elemento de nivel superior del s\u00edmbolo XML. Si se especifican las palabras reservadas en el campo "M\u00e9todo de autenticaci\u00f3n" anterior, este campo se ignora.
LoginBinding.tokenTypeName.displayName=Nombre local del tipo de s\u00edmbolo
LoginBinding.tokenTypeName.description=Especifica el nombre local que indica el tipo del s\u00edmbolo de seguridad aceptado. Si se aceptan s\u00edmbolos de seguridad binarios, el valor debe indicar el atributo "valueType" en el elemento <BinarySecurityToken>. Si se aceptan s\u00edmbolos XML, el valor debe indicar el nombre del elemento de nivel superior del s\u00edmbolo XML. Si se especifican las palabras reservadas en el campo "M\u00e9todo de autenticaci\u00f3n" anterior, este campo se ignora.
LoginBinding.basicAuthID.displayName=ID de usuario de autenticaci\u00f3n b\u00e1sica
LoginBinding.basicAuthID.description=Especifica el ID de usuario por omisi\u00f3n, que se pasa al constructor del manejador de retorno de llamada especificado previamente.
LoginBinding.basicAuthPwd.displayName=Contrase\u00f1a de autenticaci\u00f3n b\u00e1sica
LoginBinding.basicAuthPwd.description=Especifica la contrase\u00f1a por omisi\u00f3n, que se pasa al constructor del manejador de retorno de llamada especificado previamente.
LoginBinding.none=Ninguno
LoginBinding.specified=Enlace del inicio de sesi\u00f3n dedicado

WSSecurity.viewServerDD.displayName=Ver la extensi\u00f3n del descriptor de despliegue del servidor de servicios Web
WSSecurity.viewServerDD.description=Ver la extensi\u00f3n del descriptor de despliegue del servidor de servicios Web
WSSecurity.viewClientDD.displayName=Ver la extensi\u00f3n del descriptor de despliegue del cliente de servicios Web
WSSecurity.viewClientDD.description=Ver la extensi\u00f3n del descriptor de despliegue del cliente de servicios Web
WSSecurity.ddExt.displayName=Extensi\u00f3n del descriptor de despliegue

WSSecurityUtil.errorCreateResource=Se ha producido una excepci\u00f3n al crear un nuevo archivo ws-security.xml y una extensi\u00f3n wssecurity en el contexto {0}
wssecurity.both.tokenValueType=Si utiliza TokenValueType, debe especificar el URI del tipo de s\u00edmbolo y el Nombre local del tipo de s\u00edmbolo.
wssecurity.loginBinding.rqdFields=Se requiere un m\u00e9todo de autenticaci\u00f3n y un manejador de retorno de llamada.
wssecurity.loginBinding.authRqdFields=Si utiliza BasicAuth, debe especificar un ID de usuario y una contrase\u00f1a.
wssecurity.trustedIDEvaluator.rqdFields=Se requiere el Nombre del evaluador de ID de confianza y el Nombre de clase del evaluador de ID de confianza.
wssecurity.trustedIDEvaluator.rqdExisting=Se requiere la Definici\u00f3n del evaluador existente.
wssecurity.encryptionInfo.rqdFields=Se requiere el Nombre de la informaci\u00f3n de cifrado, la Referencia del localizador de claves y el Algoritmo del cifrado de datos.
wssecurity.signingInfo.rqdFields=Se requiere un M\u00e9todo de signatura.
wssecurity.signingInfo.keyOrPath=Debe especificar la informaci\u00f3n de la Clave de firma o la informaci\u00f3n de la V\u00eda de acceso del certificado, pero no ambas.
wssecurity.signingInfo.trustAny=Si selecciona "Ancla de confianza", debe especificar el Ancla de confianza y el Almac\u00e9n de certificados.
wssecurity.signingInfo.signingKey=Si especifica un Nombre de clave, debe especificar una Referencia del localizador de claves.
wssecurity.both.keyLocator=Si utiliza un localizador de claves, debe especificar el Nombre de clave y la Referencia del localizador de claves.
wssecurity.collectionCertStore.rqdX509=Un Almac\u00e9n de certificados de colecciones debe incluir al menos un certificado X.509.
wssecurity.warn.appmgmt=La aplicaci\u00f3n debe tener habilitada Web Services Security. Si est\u00e1 habilitada Web Services Security, vaya a los paneles de gesti\u00f3n de aplicaciones de Enterprise (que se encuentran pulsando Aplicaciones > Aplicaciones de empresa) para configurar la informaci\u00f3n de enlace de Web Services Security. La informaci\u00f3n de enlace de Web Services Security no se recopila durante el despliegue de aplicaciones. Si no est\u00e1 configurada correctamente la informaci\u00f3n de enlace, es posible que la aplicaci\u00f3n no se inicie correctamente o no pueda utilizarse.
wssecurity.duplicate.trustAnchor=Ya existe un Ancla de confianza con este nombre. El nombre del Ancla de confianza debe ser exclusivo.
wssecurity.duplicate.collectionCertStore=Ya existe un Almac\u00e9n de certificados de colecciones con este nombre. El nombre del Almac\u00e9n de certificados de colecciones debe ser exclusivo.
wssecurity.duplicate.keyLocator=Ya existe un Localizador de claves con este nombre. El nombre del Localizador de claves debe ser exclusivo.
wssecurity.duplicate.trustedIDEvaluator=Ya existe un Evaluador de ID de confianza con este nombre. El nombre del Evaluador de ID de confianza debe ser exclusivo.
wssecurity.duplicate.loginMapping=Ya existe una Correlaci\u00f3n de inicio de sesi\u00f3n con este m\u00e9todo de autenticaci\u00f3n. El m\u00e9todo de autenticaci\u00f3n de la Correlaci\u00f3n de inicio de sesi\u00f3n debe ser exclusivo.
wssecurity.duplicate.encryptionInfo=Ya existe una Informaci\u00f3n de cifrado con este nombre. El nombre de la Informaci\u00f3n de cifrado debe ser exclusivo.
wssecurity.validate.binding.failed=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n de enlace. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.server.failed=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n de enlace del servidor. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.client.failed=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n de enlace del cliente. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.responseSender=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n del Remitente de respuestas. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.responseReceiver=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n del Receptor de respuestas. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.requestSender=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n del Remitente de peticiones. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.validate.requestReceiver=Se ha producido un error de validaci\u00f3n de la informaci\u00f3n del Receptor de peticiones. Debe examinar la informaci\u00f3n de enlace en busca de inconsistencias en los descriptores de despliegue de Web Services Security.
wssecurity.updateRuntime.failed=El tiempo de ejecuci\u00f3n no ha podido actualizar la informaci\u00f3n de configuraci\u00f3n de enlace desde el dep\u00f3sito. Verifique los valores de configuraci\u00f3n ya que una configuraci\u00f3n no v\u00e1lida puede hacer que no se realice la actualizaci\u00f3n. Pruebe a reiniciar el servidor para que los cambios entren en vigor.
wssecurity.nonce.not.supported=Nonce s\u00f3lo est\u00e1 soportado para el m\u00e9todo de autenticaci\u00f3n <i>BasicAuth</i>.
wssecurity.all.required=Se necesitan todos los campos.

http.basicauth.title.displayName=Autenticaci\u00f3n b\u00e1sica HTTP Basic
http.basicauth.title.description=La autenticaci\u00f3n b\u00e1sica para el transporte HTTP.
http.basicauthid.displayName=ID de autenticaci\u00f3n b\u00e1sica
http.basicauthid.description=Especifica el ID de usuario para la autenticaci\u00f3n b\u00e1sica para este puerto. La autenticaci\u00f3n b\u00e1sica HTTP SSL tambi\u00e9n se configurar al habilitar la configuraci\u00f3n HTTP SSL.
http.basicauthpwd.displayName=Contrase\u00f1a de autenticaci\u00f3n b\u00e1sica
http.basicauthpwd.description=Especifica la contrasel\u00f1a para la autenticaci\u00f3n b\u00e1sica para este puerto.
http.sslconfig.title.displayName=Configuraci\u00f3n HTTP SSL
http.sslconfig.title.description=El alias de la configuraci\u00f3n SSL para el transporte HTTP.
http.sslenabled.displayName=HTTP SSL habilitado
http.sslenabled.description=Indica si las comunicaciones de socket seguro est\u00e1n habilitadas para el transporte HTTP para este puerto. Cuando esta opci\u00f3n est\u00e1 habilitado, se utiliza la codificaci\u00f3n nativa.
http.sslconfig.displayName=Configuraci\u00f3n HTTP SSL
http.sslconfig.description=El alias de la configuraci\u00f3n SSL que se utilizar\u00e1 con el transporte HTTP para este puerto.  Se utiliza si HTTP SSL est\u00e1 habilitado.

# The following error messages are accessed through Tr.error().
# Note that the SECGxxxx numbers are used to correlate the user visible messages (e.g. Tr.warning, Tr.error,
# Tr.audit) with an Explanation & User Response message that is documented in a Message Reference guide.
# Do not modify the existing SECGxxxx numbers.  See http://hany.austin.ibm.com/messages/index.html
# for info on how to add new messages.
# Every message you add to this section should also include an Explanation & a User Response.
# -------------------------------------------------------------------------------------------------
wssecurity.file.load.exception=SECG1000E: Se ha producido una excepci\u00f3n al cargar el recurso {0}: {1}.
wssecurity.file.load.exception.explanation=No se ha encontrado ning\u00fan archivo ws-security.xml en el conjunto de recursos.
wssecurity.file.load.exception.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------
wssecurity.utils.nowssec=SECG1001W: El archivo ws-security.xml no estaba disponible en el contexto {0}.
wssecurity.utils.nowssec.explanation=No se ha encontrado ning\u00fan archivo ws-security.xml en el contexto de recursos.
wssecurity.utils.nowssec.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------

# End of Tr.error() message section
# -------------------------------------------------------------------------------------------------
