# IBM Confidential OCO Source Material
# 5630-A36 (C) COPYRIGHT International Business Machines Corp. 2003
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has
# been determined that the code that uses this file expects only a single
# apostrophe, and should work properly when a single apostrophe is provided.
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.16.1.5,5,03/08/19,10:39:24
#
#CMVCPATHNAME ws/code/webui.wssecurity/src/wssecurity/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE TRUE
#COMPONENTPREFIX SECG
#COMPONENTNAMEFOR SECG WebUI SecurityCenter

nav.wssecurity=Web \u30b5\u30fc\u30d3\u30b9
nav.wssecurity.trust.anchors=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc
nav.wssecurity.certificate.stores=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
nav.wssecurity.ldapcertificate.stores=LDAP \u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
nav.wssecurity.collcertificate.stores=\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
nav.wssecurity.key.locators=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc
nav.wssecurity.id.evaluators=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc
nav.wssecurity.login.mappings=\u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0

WSSecurity.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
WSSecurity.description=\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306e\u69cb\u6210\u306e\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc

WSServerSecurity.displayName=Web \u30b5\u30fc\u30d3\u30b9: Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
WSServerSecurity.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u7279\u5b9a\u306e Web \u30b5\u30fc\u30d3\u30b9\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306b\u3042\u308b\u3053\u308c\u3089\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306f\u30aa\u30fc\u30d0\u30fc\u30e9\u30a4\u30c9\u3067\u304d\u307e\u3059\u3002

WSServerBinding.displayName=Web \u30b5\u30fc\u30d3\u30b9: \u30b5\u30fc\u30d0\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
WSServerBinding.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30b5\u30fc\u30d0\u30fc\u30fb\u30b5\u30a4\u30c9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210
WSClientBinding.displayName=Web \u30b5\u30fc\u30d3\u30b9: \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
WSClientBinding.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30b5\u30a4\u30c9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210
WSBinding.service.displayName=Web \
\u30b5\u30fc\u30d3\u30b9
WSBinding.port.displayName=\u30dd\u30fc\u30c8
WSBinding.edit=\u7de8\u96c6...

WSSecurity.property.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
WSSecurity.property.description=\u69cb\u6210\u306e\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
WSSecurity.property.name.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d
WSSecurity.property.name.description=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
WSSecurity.property.value.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024
WSSecurity.property.value.description=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

WSSecurity.nonceCacheTimeout.displayname=nonce \u30ad\u30e3\u30c3\u30b7\u30e5\u30fb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8
WSSecurity.nonceCacheTimeout.description=\u30b5\u30fc\u30d0\u30fc\u4e0a\u306e\u30ad\u30e3\u30c3\u30b7\u30e5\u306b\u5165\u308c\u3089\u308c\u3066\u3044\u308b nonce \u306e\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 Nonce \u306f\u3001\u30e9\u30f3\u30c0\u30e0\u306b\u751f\u6210\u3055\u308c\u305f\u5024\u3067\u3059\u3002

TrustAnchor.displayName=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc
TrustAnchor.description=\u30eb\u30fc\u30c8\u30fb\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9\u8a3c\u660e\u66f8\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u9375\u30b9\u30c8\u30a2\u69cb\u6210\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u3089\u306e\u69cb\u6210\u306f\u3001\u7740\u4fe1\u3057\u305f X.509 \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u8a3c\u660e\u66f8\u30d1\u30b9\u59a5\u5f53\u6027\u691c\u67fb\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \u958b\u767a\u30ad\u30c3\u30c8\u9375\u30c4\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001\u9375\u30b9\u30c8\u30a2\u3092\u4f5c\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u9375\u7ba1\u7406\u30e6\u30fc\u30c6\u30a3\u30ea\u30c6\u30a3\u30fc\u306f\u671f\u5f85\u3055\u308c\u308b\u5f62\u5f0f\u3067\u9375\u30b9\u30c8\u30a2\u3092\u4f5c\u6210\u3057\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30e6\u30fc\u30c6\u30a3\u30ea\u30c6\u30a3\u30fc\u306f\u4f7f\u7528\u3057\u306a\u3044\u3067\u304f\u3060\u3055\u3044\u3002
TrustAnchor.smallIcon=TrustAnchor.gif
TrustAnchor.largeIcon=TrustAnchor32X32.gif
TrustAnchor.name.displayName=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u540d
TrustAnchor.name.description=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u3092\u8b58\u5225\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u56fa\u6709\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustAnchor.keystorePwd.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9
TrustAnchor.keystorePwd.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustAnchor.keystorePath.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30d1\u30b9
TrustAnchor.keystorePath.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustAnchor.keystoreType.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30bf\u30a4\u30d7
TrustAnchor.keystoreType.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30bf\u30a4\u30d7\u3092 JKS \u307e\u305f\u306f JCEKS \u306b\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustAnchor.keystoreType.JKS=JKS
TrustAnchor.keystoreType.JCEKS=JCEKS

LDAPCertStore.displayName=LDAP \u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
LDAPCertStore.description=\u975e\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9\u4e2d\u9593\u8a3c\u660e\u66f8\u9805\u76ee\u304c\u542b\u307e\u308c\u3066\u3044\u308b LDAP \u30b5\u30fc\u30d0\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e LDAP \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u7740\u4fe1\u3057\u305f X.509 \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u8a3c\u660e\u66f8\u30d1\u30b9\u59a5\u5f53\u6027\u691c\u67fb\u306e\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u3068\u3057\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
LDAPCertStore.smallIcon=LDAPCertStore.gif
LDAPCertStore.largeIcon=LDAPCertStore32X32.gif
LDAPCertStore.name.displayName=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u540d
LDAPCertStore.name.description=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LDAPCertStore.provider.displayName=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
LDAPCertStore.provider.description=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u30fb\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LDAPCertStore.ldapServer.displayName=LDAP \u30b5\u30fc\u30d0\u30fc
LDAPCertStore.ldapServer.description=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LDAPCertStore.ldapPort.displayName=LDAP \u30dd\u30fc\u30c8
LDAPCertStore.ldapPort.description=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u30db\u30b9\u30c8\u756a\u53f7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LDAPCertStore.ldapProperties.displayName=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
LDAPCertStore.ldapProperties.description=LDAP \u30b5\u30fc\u30d0\u30fc\u306e\u8ffd\u52a0\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

CollectionCertStore.displayName=\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
CollectionCertStore.description=\u975e\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9\u4e2d\u9593\u8a3c\u660e\u66f8\u30d5\u30a1\u30a4\u30eb\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306f\u3001\u7740\u4fe1\u3057\u305f X.509 \u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u8a3c\u660e\u66f8\u30d1\u30b9\u59a5\u5f53\u6027\u691c\u67fb\u306b\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
CollectionCertStore.smallIcon=LDAPCertStore.gif
CollectionCertStore.largeIcon=LDAPCertStore32X32.gif
CollectionCertStore.name.displayName=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u540d
CollectionCertStore.name.description=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306e\u56fa\u6709\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
CollectionCertStore.provider.displayName=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc
CollectionCertStore.provider.description=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u30fb\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

X509Certificate.displayName=X.509 \u8a3c\u660e\u66f8
X509Certificate.description=X.509 \u8a3c\u660e\u66f8\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
X509Certificate.smallIcon=X509Certificate.gif
X509Certificate.largeIcon=X509Certificate32X32.gif
X509Certificate.reference.displayName=X.509 \u8a3c\u660e\u66f8\u30d1\u30b9
X509Certificate.reference.description=X.509 \u8a3c\u660e\u66f8\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

KeyLocator.displayName=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc
KeyLocator.description=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc\u304a\u3088\u3073\u6697\u53f7\u5316\u306e\u9375\u3092\u691c\u7d22\u3059\u308b\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u69cb\u6210\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u30fb\u30af\u30e9\u30b9\u306f\u3001\u4ed6\u306e\u30bf\u30a4\u30d7\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u304b\u3089\u9375\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3067\u304d\u307e\u3059\u3002  \u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u3001\u9375\u30b9\u30c8\u30a2\u304b\u3089\u9375\u304c\u691c\u7d22\u3055\u308c\u307e\u3059\u3002
KeyLocator.smallIcon=KeyLocator.gif
KeyLocator.largeIcon=KeyLocator32X32.gif
KeyLocator.name.displayName=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u540d
KeyLocator.name.description=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u5b9a\u7fa9\u3092\u8b58\u5225\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u56fa\u6709\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
KeyLocator.className.displayName=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u30fb\u30af\u30e9\u30b9\u540d
KeyLocator.className.description=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u30fb\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306f\u3001com.ibm.wsspi.wssecurity.config.KeyLocator \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
KeyLocator.keystorePwd.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9
KeyLocator.keystorePwd.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u304c\u9375\u30b9\u30c8\u30a2\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u3002
KeyLocator.keystorePath.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30d1\u30b9
KeyLocator.keystorePath.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u304c\u9375\u30b9\u30c8\u30a2\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u3002
KeyLocator.keystoreType.displayName=\u9375\u30b9\u30c8\u30a2\u30fb\u30bf\u30a4\u30d7
KeyLocator.keystoreType.description=\u9375\u30b9\u30c8\u30a2\u30fb\u30d5\u30a1\u30a4\u30eb\u306e\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u304c\u9375\u30b9\u30c8\u30a2\u3092\u4f7f\u7528\u3057\u306a\u3044\u5834\u5408\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u3067\u3059\u3002
KeyLocator.keystoreType.JKS=JKS
KeyLocator.keystoreType.JCEKS=JCEKS

WSKey.displayName=\u30ad\u30fc
WSKey.description=\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u304c\u4ed8\u3051\u3089\u308c\u305f\u9375\u30b9\u30c8\u30a2\u5185\u306e\u9375\u9805\u76ee\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u6ce8: \u3059\u3079\u3066\u306e\u8a3c\u660e\u66f8\u9805\u76ee\u3092\u30ad\u30fc\u3068\u3057\u3066\u30ea\u30b9\u30c8\u3059\u308b\u5fc5\u8981\u306f\u3042\u308a\u307e\u305b\u3093\u3002\u691c\u7d22\u30ad\u30fc\u3068\u3057\u3066\u3001\u8a3c\u660e\u66f8\u306e\u8b58\u5225\u540d (DN) \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
WSKey.smallIcon=Key.gif
WSKey.largeIcon=Key32X32.gif
WSKey.name.displayName=\u9375\u540d
WSKey.name.description=\u9375\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u540d\u524d\u306f\u3001\u9375\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
WSKey.alias.displayName=\u9375\u5225\u540d
WSKey.alias.description=\u9375\u30b9\u30c8\u30a2\u5185\u306e\u9375\u306e\u5225\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
WSKey.keypass.displayName=\u9375\u30d1\u30b9\u30ef\u30fc\u30c9
WSKey.keypass.description=\u9375\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

TrustedIDEvaluator.displayName=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc
TrustedIDEvaluator.description=ID \u8868\u660e\u6a29\u9650\u304c\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9\u3067\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u5225\u3059\u308b\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustedIDEvaluator.smallIcon=TrustedIDEvaluator.gif
TrustedIDEvaluator.largeIcon=TrustedIDEvaluator32X32.gif
TrustedIDEvaluator.name.displayName=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u540d
TrustedIDEvaluator.name.description=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u69cb\u6210\u3092\u8b58\u5225\u3059\u308b\u56fa\u6709\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
TrustedIDEvaluator.className.displayName=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u30fb\u30af\u30e9\u30b9\u540d
TrustedIDEvaluator.className.description=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u306f\u3001com.ibm.wsspi.wssecurity.id.TrustedIDEvaluator \u30af\u30e9\u30b9\u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
TrustedIDEvaluator.none=\u306a\u3057
TrustedIDEvaluator.existing=\u65e2\u5b58\u306e\u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u5b9a\u7fa9
TrustedIDEvaluator.existing.select=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u3092\u9078\u629e\u3057\u307e\u3059\u3002
TrustedIDEvaluator.specified=\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u5b9a\u7fa9

LoginMapping.displayName=\u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0
LoginMapping.description=\u7740\u4fe1\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u59a5\u5f53\u6027\u691c\u67fb\u3092\u884c\u3046\u305f\u3081\u306e\u69cb\u6210\u306e\u30ea\u30b9\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginMapping.smallIcon=LoginMapping.gif
LoginMapping.largeIcon=LoginMapping32X32.gif
LoginMapping.name.displayName=\u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u540d
LoginMapping.name.description=\u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginMapping.authMethod.displayName=\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9
LoginMapping.authMethod.description=\u8a8d\u8a3c\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u4efb\u610f\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u304c\u3001\u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u30b5\u30fc\u30d3\u30b9\u30fb\u30ec\u30d9\u30eb\u69cb\u6210\u5185\u306e <AuthMethod> \u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u6b21\u306e 4 \u3064\u306e\u30ef\u30fc\u30c9\u306f\u4e88\u7d04\u6e08\u307f\u3067\u3001\u7279\u5225\u306e\u610f\u5473\u3092\u6301\u3061\u307e\u3059\u3002"BasicAuth": <UsernameToken> \u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"IDAssertion": <UsernameToken> \u30e6\u30fc\u30b6\u30fc\u540d\u306e\u307f\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"Signature": \u7f72\u540d\u8005\u306e\u8b58\u5225\u540d (DN) \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"LTPA": \u30c8\u30fc\u30af\u30f3\u3092\u691c\u67fb\u3057\u307e\u3059\u3002
LoginMapping.configName.displayName=JAAS \u69cb\u6210\u540d
LoginMapping.configName.description=Java \u8a8d\u8a3c\u304a\u3088\u3073\u8a31\u53ef\u30b5\u30fc\u30d3\u30b9 (JAAS) \u306e\u30ed\u30b0\u30a4\u30f3\u69cb\u6210\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginMapping.tokenTypeURI.displayName=\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7 URI
LoginMapping.tokenTypeURI.description=\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u30bf\u30a4\u30d7\u3092\u793a\u3059\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c <BinarySecurityToken> \u30a8\u30ec\u30e1\u30f3\u30c8\u5185\u306e "valueType" \u5c5e\u6027\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 XML \u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c XML \u30c8\u30fc\u30af\u30f3\u306e\u30c8\u30c3\u30d7\u30ec\u30d9\u30eb\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u540d\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u4e0a\u306e\u300c\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u4e88\u7d04\u8a9e\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
LoginMapping.tokenTypeName.displayName=\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7\u306e\u30ed\u30fc\u30ab\u30eb\u540d
LoginMapping.tokenTypeName.description=\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u30bf\u30a4\u30d7\u3092\u793a\u3059\u30ed\u30fc\u30ab\u30eb\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c <BinarySecurityToken> \u30a8\u30ec\u30e1\u30f3\u30c8\u5185\u306e "valueType" \u5c5e\u6027\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 XML \u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c XML \u30c8\u30fc\u30af\u30f3\u306e\u30c8\u30c3\u30d7\u30ec\u30d9\u30eb\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u540d\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u4e0a\u306e\u300c\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u4e88\u7d04\u8a9e\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
LoginMapping.callbackClassName.displayName=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u30fb\u30af\u30e9\u30b9\u540d
LoginMapping.callbackClassName.description=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f com.ibm.wsspi.wssecurity.auth.callback.CallbackHandlerFactory \u30af\u30e9\u30b9\u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
LoginMapping.callbackProperties.displayName=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
LoginMapping.callbackProperties.description=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u30fb\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u306e\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
LoginMapping.makeSoapAvailable.displayName=SOAP \u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
LoginMapping.makeSoapAvailable.description=\u8aac\u660e
LoginMapping.nonceMaxAge.displayName=nonce \u6700\u5927\u7d4c\u904e\u6642\u9593
LoginMapping.nonceMaxAge.description=nonce \u30bf\u30a4\u30e0\u30fb\u30b9\u30bf\u30f3\u30d7\u304c\u6e80\u4e86\u3059\u308b\u307e\u3067\u306e\u6642\u9593\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 Nonce \u306f\u3001\u30e9\u30f3\u30c0\u30e0\u306b\u751f\u6210\u3055\u308c\u305f\u5024\u3067\u3059\u3002
LoginMapping.nonceClockSkew.displayName=nonce \u30af\u30ed\u30c3\u30af\u30fb\u30b9\u30ad\u30e5\u30fc
LoginMapping.nonceClockSkew.description=WebSphere Application Server \u304c\u30e1\u30c3\u30bb\u30fc\u30b8\u306e\u65b0\u3057\u3055\u3092\u30c1\u30a7\u30c3\u30af\u3059\u308b\u3068\u304d\u306b\u8003\u616e\u3059\u308b\u30af\u30ed\u30c3\u30af\u30fb\u30b9\u30ad\u30e5\u30fc\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 Nonce \u306f\u3001\u30e9\u30f3\u30c0\u30e0\u306b\u751f\u6210\u3055\u308c\u305f\u5024\u3067\u3059\u3002

WSSecurity.validate=\u69cb\u6210\u306e\u59a5\u5f53\u6027\u691c\u67fb
WSSecurity.updateRuntime=\u30e9\u30f3\u30bf\u30a4\u30e0\u306e\u66f4\u65b0
WSSecurity.seconds=\u79d2\u9593

RequestReceiver.displayName=\u8981\u6c42\u53d7\u4fe1\u5074\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
RequestReceiver.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u8981\u6c42\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

ResponseSender.displayName=\u5fdc\u7b54\u9001\u4fe1\u5074\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
ResponseSender.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u5fdc\u7b54\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

RequestSender.displayName=\u8981\u6c42\u9001\u4fe1\u5074\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
RequestSender.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u8981\u6c42\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u9001\u4fe1\u3059\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

ResponseReceiver.displayName=\u5fdc\u7b54\u53d7\u4fe1\u5074\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
ResponseReceiver.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u5fdc\u7b54\u30e1\u30c3\u30bb\u30fc\u30b8\u3092\u53d7\u3051\u53d6\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

SigningInfo.displayName=\u7f72\u540d\u60c5\u5831
SigningInfo.description=\u7f72\u540d\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u307e\u305f\u3001\u3053\u308c\u3089\u306e\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306f\u3001\u300c\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u300d\u304c "IDAssertion" \u3067\u3001\u300cID \u30bf\u30a4\u30d7\u300d\u304c\u30b5\u30fc\u30d0\u30fc\u30fb\u30ec\u30d9\u30eb\u69cb\u6210\u5185\u306e "X509Certificate" \u3067\u3042\u308b\u3068\u304d\u306b\u3001X.509 \u8a3c\u660e\u66f8\u306e\u59a5\u5f53\u6027\u691c\u67fb\u306b\u4f7f\u7528\u3067\u304d\u307e\u3059\u3002 \u3053\u306e\u3088\u3046\u306a\u5834\u5408\u306f\u3001\u300c\u8a3c\u660e\u66f8\u30d1\u30b9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u306e\u307f\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
SigningInfo.smallIcon=SigningInformation.gif
SigningInfo.largeIcon=SigningInformation32X32.gif
SigningInfo.method.displayName=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc\u30fb\u30e1\u30bd\u30c3\u30c9
SigningInfo.method.description=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc\u30fb\u30e1\u30bd\u30c3\u30c9\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.canonMethod.displayName=\u6b63\u898f\u5316\u30e1\u30bd\u30c3\u30c9
SigningInfo.canonMethod.description=\u6b63\u898f\u5316\u30e1\u30bd\u30c3\u30c9\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.digestMethod.displayName=\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u30fb\u30e1\u30bd\u30c3\u30c9
SigningInfo.digestMethod.description=\u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u30fb\u30e1\u30bd\u30c3\u30c9\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.signingKey.displayName=\u7f72\u540d\u9375
SigningInfo.signingKey.description=\u7f72\u540d\u306b\u4f7f\u7528\u3055\u308c\u308b\u9375\u60c5\u5831\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u3089\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3001\u53d7\u4fe1\u5074\u69cb\u6210\u3067\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
SigningInfo.signingKeyName.displayName=\u9375\u540d
SigningInfo.signingKeyName.description=\u9375\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u540d\u524d\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306b\u3088\u3063\u3066\u5b9f\u969b\u306e\u9375\u306b\u89e3\u6c7a\u3055\u308c\u307e\u3059\u3002
SigningInfo.signingKeyRef.displayName=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u53c2\u7167
SigningInfo.signingKeyRef.description=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306e\u540d\u524d\u306e\u53c2\u7167\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.certificatePath.displayName=\u8a3c\u660e\u66f8\u30d1\u30b9
SigningInfo.certificatePath.description=\u8a3c\u660e\u66f8\u30d1\u30b9\u59a5\u5f53\u6027\u691c\u67fb\u306e\u8a2d\u5b9a\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u300c\u3059\u3079\u3066\u3092\u4fe1\u983c\u300d\u304c\u30aa\u30f3\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u3053\u306e\u59a5\u5f53\u6027\u691c\u67fb\u304c\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u3001\u3059\u3079\u3066\u306e\u7740\u4fe1\u8a3c\u660e\u66f8\u304c\u4fe1\u983c\u3055\u308c\u307e\u3059\u3002 \u3053\u308c\u3089\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3001\u9001\u4fe1\u5074\u69cb\u6210\u3067\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
SigningInfo.none=\u306a\u3057
SigningInfo.any=\u3059\u3079\u3066\u3092\u4fe1\u983c
SigningInfo.trustAnchor=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc
SigningInfo.trustAnchor.displayName=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc
SigningInfo.trustAnchor.description=\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u306e\u540d\u524d\u306e\u53c2\u7167\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.certificateStore.displayName=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2
SigningInfo.certificateStore.description=\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306e\u540d\u524d\u306e\u53c2\u7167\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
SigningInfo.specified=\u5c02\u7528\u7f72\u540d\u60c5\u5831

EncryptionInfo.displayName=\u6697\u53f7\u5316\u60c5\u5831
EncryptionInfo.description=\u6697\u53f7\u5316\u304a\u3088\u3073\u6697\u53f7\u5316\u89e3\u9664\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u306e\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EncryptionInfo.smallIcon=EncryptionInfo.gif
EncryptionInfo.largeIcon=EncryptionInfo32X32.gif
EncryptionInfo.name.displayName=\u6697\u53f7\u5316\u60c5\u5831\u540d
EncryptionInfo.name.description=\u6697\u53f7\u5316\u60c5\u5831\u306e\u56fa\u6709\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EncryptionInfo.keyReference.displayName=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u53c2\u7167
EncryptionInfo.keyReference.description=\u4f7f\u7528\u3059\u308b\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306e\u540d\u524d\u306e\u53c2\u7167\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EncryptionInfo.keyName.displayName=\u6697\u53f7\u9375\u540d
EncryptionInfo.keyName.description=\u9375\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u540d\u524d\u306f\u3001\u6307\u5b9a\u3055\u308c\u305f\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306b\u3088\u3063\u3066\u5b9f\u969b\u306e\u9375\u306b\u89e3\u6c7a\u3055\u308c\u307e\u3059\u3002
EncryptionInfo.keyAlgorithm.displayName=\u9375\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
EncryptionInfo.keyAlgorithm.description=\u9375\u6697\u53f7\u5316\u30e1\u30bd\u30c3\u30c9\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EncryptionInfo.dataAlgorithm.displayName=\u30c7\u30fc\u30bf\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0
EncryptionInfo.dataAlgorithm.description=\u30c7\u30fc\u30bf\u6697\u53f7\u5316\u30e1\u30bd\u30c3\u30c9\u306e\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EncryptionInfo.none=\u306a\u3057
EncryptionInfo.specified=\u5c02\u7528\u6697\u53f7\u5316\u60c5\u5831

LoginBinding.displayName=\u30ed\u30b0\u30a4\u30f3\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
LoginBinding.description=\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u9001\u4fe1\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginBinding.smallIcon=LoginBinding.gif
LoginBinding.largeIcon=LoginBinding32X32.gif
LoginBinding.dedicated.description=\u3053\u308c\u306f\u3001\u30e1\u30c3\u30bb\u30fc\u30b8\u5185\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u3092\u751f\u6210\u3059\u308b\u305f\u3081\u306b\u9001\u4fe1\u5074\u304c\u4f7f\u7528\u3057\u307e\u3059\u3002 \u6b21\u306e 4 \u3064\u306e\u4e8b\u524d\u5b9a\u7fa9\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u304c\u3042\u308a\u307e\u3059\u3002"BasicAuth": \u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u3092\u4f7f\u7528\u3057\u3066 <UsernameToken> \u3092\u751f\u6210\u3057\u307e\u3059\u3002"IDAssertion": \u30e6\u30fc\u30b6\u540d\u306e\u307f\u3092\u4f7f\u7528\u3057\u3066 <UsernameToken> \u3092\u751f\u6210\u3057\u307e\u3059\u3002 "Signature": \u7f72\u540d\u8005\u306e\u8b58\u5225\u540d (DN) \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002 "LTPA": \u547c\u3073\u51fa\u3057\u4fe1\u4efb\u72b6\u304b\u3089 <BinarySecurityToken> \u3092\u4f7f\u7528\u3059\u308b\u304b\u3001\u307e\u305f\u306f BasicAuth \u30c7\u30fc\u30bf\u304b\u3089\u30c8\u30fc\u30af\u30f3\u3092\u751f\u6210\u3057\u307e\u3059\u3002 \u307e\u305f\u3001\u30ab\u30b9\u30bf\u30e0\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u3092\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u3082\u3067\u304d\u307e\u3059\u3002
LoginBinding.name.displayName=\u30ed\u30b0\u30a4\u30f3\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u540d
LoginBinding.name.description=\u30ed\u30b0\u30a4\u30f3\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u30fb\u30e9\u30d9\u30eb\u3002
LoginBinding.authMethod.displayName=\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9
LoginBinding.authMethod.description=\u8a8d\u8a3c\u306e\u30e1\u30bd\u30c3\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u4efb\u610f\u306e\u30b9\u30c8\u30ea\u30f3\u30b0\u3092\u4f7f\u7528\u3067\u304d\u307e\u3059\u304c\u3001\u30b9\u30c8\u30ea\u30f3\u30b0\u306f\u30b5\u30fc\u30d3\u30b9\u30fb\u30ec\u30d9\u30eb\u69cb\u6210\u5185\u306e <AuthMethod> \u30a8\u30ec\u30e1\u30f3\u30c8\u3068\u4e00\u81f4\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u6b21\u306e 4 \u3064\u306e\u30ef\u30fc\u30c9\u306f\u4e88\u7d04\u6e08\u307f\u3067\u3001\u7279\u5225\u306e\u610f\u5473\u3092\u6301\u3061\u307e\u3059\u3002"BasicAuth": <UsernameToken> \u30e6\u30fc\u30b6\u30fc\u540d\u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u306e\u4e21\u65b9\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"IDAssertion": <UsernameToken> \u30e6\u30fc\u30b6\u30fc\u540d\u306e\u307f\u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"Signature": \u7f72\u540d\u8005\u306e\u8b58\u5225\u540d (DN) \u3092\u4f7f\u7528\u3057\u307e\u3059\u3002"LTPA": \u30c8\u30fc\u30af\u30f3\u3092\u691c\u8a3c\u3057\u307e\u3059\u3002
LoginBinding.authMethod.basicAuth=\u57fa\u672c\u8a8d\u8a3c
LoginBinding.authMethod.idAssertion=ID \u8868\u660e
LoginBinding.authMethod.signature=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc
LoginBinding.callbackHandler.displayName=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc
LoginBinding.callbackHandler.description=\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u306e\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u308c\u306f\u3001javax.security.auth.callback.CallbackHandler \u3092\u30a4\u30f3\u30d7\u30ea\u30e1\u30f3\u30c8\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u3001\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc\u304c (String defaultId, char[] defaultPass, java.util.Map properties) \u3067\u3042\u308b\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
LoginBinding.tokenTypeURI.displayName=\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7 URI
LoginBinding.tokenTypeURI.description=\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u30bf\u30a4\u30d7\u3092\u793a\u3059\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9 URI \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c <BinarySecurityToken> \u30a8\u30ec\u30e1\u30f3\u30c8\u5185\u306e "valueType" \u5c5e\u6027\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 XML \u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c XML \u30c8\u30fc\u30af\u30f3\u306e\u30c8\u30c3\u30d7\u30ec\u30d9\u30eb\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u540d\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u4e0a\u306e\u300c\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u4e88\u7d04\u8a9e\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
LoginBinding.tokenTypeName.displayName=\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7\u306e\u30ed\u30fc\u30ab\u30eb\u540d
LoginBinding.tokenTypeName.description=\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u306e\u30bf\u30a4\u30d7\u3092\u793a\u3059\u30ed\u30fc\u30ab\u30eb\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c <BinarySecurityToken> \u30a8\u30ec\u30e1\u30f3\u30c8\u5185\u306e "valueType" \u5c5e\u6027\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 XML \u30c8\u30fc\u30af\u30f3\u304c\u53d7\u3051\u5165\u308c\u3089\u308c\u308b\u5834\u5408\u306f\u3001\u5024\u304c XML \u30c8\u30fc\u30af\u30f3\u306e\u30c8\u30c3\u30d7\u30ec\u30d9\u30eb\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u540d\u3092\u793a\u3059\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u4e0a\u306e\u300c\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u4e88\u7d04\u8a9e\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u7121\u8996\u3055\u308c\u307e\u3059\u3002
LoginBinding.basicAuthID.displayName=\u57fa\u672c\u8a8d\u8a3c\u30e6\u30fc\u30b6\u30fc ID
LoginBinding.basicAuthID.description=\u4ee5\u524d\u306b\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u306e\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u306b\u6e21\u3055\u308c\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30e6\u30fc\u30b6\u30fc ID \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginBinding.basicAuthPwd.displayName=\u57fa\u672c\u8a8d\u8a3c\u30d1\u30b9\u30ef\u30fc\u30c9
LoginBinding.basicAuthPwd.description=\u4ee5\u524d\u306b\u6307\u5b9a\u3055\u308c\u305f\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u306e\u30b3\u30f3\u30b9\u30c8\u30e9\u30af\u30bf\u30fc\u306b\u6e21\u3055\u308c\u308b\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
LoginBinding.none=\u306a\u3057
LoginBinding.specified=\u5c02\u7528\u30ed\u30b0\u30a4\u30f3\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0

WSSecurity.viewServerDD.displayName=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u306e\u8868\u793a
WSSecurity.viewServerDD.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u3092\u8868\u793a\u3057\u307e\u3059
WSSecurity.viewClientDD.displayName=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u306e\u8868\u793a
WSSecurity.viewClientDD.description=Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u3092\u8868\u793a\u3057\u307e\u3059
WSSecurity.ddExt.displayName=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50

WSSecurityUtil.errorCreateResource=\u65b0\u898f ws-security.xml \u30d5\u30a1\u30a4\u30eb\u3068\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 {0} \u306e wssecurity \u30a8\u30af\u30b9\u30c6\u30f3\u30c8\u3092\u4f5c\u6210\u3059\u308b\u969b\u306b\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f
wssecurity.both.tokenValueType=\u30c8\u30fc\u30af\u30f3\u5024\u30bf\u30a4\u30d7\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7 URI \u304a\u3088\u3073\u30c8\u30fc\u30af\u30f3\u30fb\u30bf\u30a4\u30d7\u30fb\u30ed\u30fc\u30ab\u30eb\u540d\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.loginBinding.rqdFields=\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u3068\u30b3\u30fc\u30eb\u30d0\u30c3\u30af\u30fb\u30cf\u30f3\u30c9\u30e9\u30fc\u304c\u5fc5\u8981\u3067\u3059\u3002
wssecurity.loginBinding.authRqdFields=BasicAuth \u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u30e6\u30fc\u30b6\u30fc ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.trustedIDEvaluator.rqdFields=\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u540d\u3068\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u30fb\u30af\u30e9\u30b9\u540d\u304c\u5fc5\u8981\u3067\u3059\u3002
wssecurity.trustedIDEvaluator.rqdExisting=\u65e2\u5b58\u306e\u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u5b9a\u7fa9\u304c\u5fc5\u8981\u3067\u3059\u3002
wssecurity.encryptionInfo.rqdFields=\u6697\u53f7\u5316\u60c5\u5831\u540d\u3001\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u53c2\u7167\u3001\u304a\u3088\u3073\u30c7\u30fc\u30bf\u6697\u53f7\u5316\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u304c\u5fc5\u8981\u3067\u3059\u3002
wssecurity.signingInfo.rqdFields=\u30b7\u30b0\u30cb\u30c1\u30e3\u30fc\u30fb\u30e1\u30bd\u30c3\u30c9\u304c\u5fc5\u8981\u3067\u3059\u3002
wssecurity.signingInfo.keyOrPath=\u7f72\u540d\u9375\u60c5\u5831\u3068\u8a3c\u660e\u66f8\u30d1\u30b9\u60c5\u5831\u306e\u3069\u3061\u3089\u304b\u4e00\u65b9 (\u4e21\u65b9\u3067\u306f\u306a\u3044) \u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.signingInfo.trustAny=\u300c\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u300d\u3092\u9078\u629e\u3057\u305f\u5834\u5408\u306f\u3001\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u3068\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.signingInfo.signingKey=\u9375\u540d\u3092\u6307\u5b9a\u3057\u305f\u5834\u5408\u306f\u3001\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u53c2\u7167\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.both.keyLocator=\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u3092\u4f7f\u7528\u3059\u308b\u5834\u5408\u306f\u3001\u9375\u540d\u3068\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u53c2\u7167\u3092\u6307\u5b9a\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.collectionCertStore.rqdX509=\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e X.509 \u8a3c\u660e\u66f8\u304c\u542b\u307e\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.warn.appmgmt=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067\u306f\u3001Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u7ba1\u7406\u30d1\u30cd\u30eb (\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 > \u30a8\u30f3\u30bf\u30fc\u30d7\u30e9\u30a4\u30ba\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u898b\u3064\u304b\u308b) \u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u3001Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u69cb\u6210\u3057\u307e\u3059\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u4e2d\u306b\u3001Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306f\u53ce\u96c6\u3055\u308c\u307e\u305b\u3093\u3002 \u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u304c\u6b63\u3057\u304f\u69cb\u6210\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u6b63\u3057\u304f\u958b\u59cb\u3055\u308c\u306a\u304b\u3063\u305f\u308a\u3001\u4f7f\u7528\u4e0d\u53ef\u306b\u306a\u3063\u305f\u308a\u3059\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.duplicate.trustAnchor=\u3053\u306e\u540d\u524d\u306e\u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u30c8\u30e9\u30b9\u30c8\u30fb\u30a2\u30f3\u30ab\u30fc\u540d\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.duplicate.collectionCertStore=\u3053\u306e\u540d\u524d\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u8a3c\u660e\u66f8\u30b9\u30c8\u30a2\u540d\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.duplicate.keyLocator=\u3053\u306e\u540d\u524d\u306e\u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u9375\u30ed\u30b1\u30fc\u30bf\u30fc\u540d\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.duplicate.trustedIDEvaluator=\u3053\u306e\u540d\u524d\u306e\u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u30c8\u30e9\u30b9\u30c6\u30c3\u30c9 ID \u30a8\u30d0\u30ea\u30e5\u30a8\u30fc\u30bf\u30fc\u540d\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.duplicate.loginMapping=\u3053\u306e\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u3092\u6301\u3064\u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u30ed\u30b0\u30a4\u30f3\u30fb\u30de\u30c3\u30d4\u30f3\u30b0\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.duplicate.encryptionInfo=\u3053\u306e\u540d\u524d\u306e\u6697\u53f7\u5316\u60c5\u5831\u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002 \u6697\u53f7\u5316\u60c5\u5831\u540d\u306f\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
wssecurity.validate.binding.failed=\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.server.failed=\u30b5\u30fc\u30d0\u30fc\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.client.failed=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.responseSender=\u5fdc\u7b54\u9001\u4fe1\u5074\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.responseReceiver=\u5fdc\u7b54\u53d7\u4fe1\u5074\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.requestSender=\u691c\u8a3c\u9001\u4fe1\u5074\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.validate.requestReceiver=\u8981\u6c42\u53d7\u4fe1\u5074\u60c5\u5831\u306e\u691c\u8a3c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 Web \u30b5\u30fc\u30d3\u30b9\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u8a18\u8ff0\u5b50\u5185\u306e\u77db\u76fe\u306b\u3064\u3044\u3066\u3001\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u60c5\u5831\u3092\u8abf\u3079\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
wssecurity.updateRuntime.failed=\u30e9\u30f3\u30bf\u30a4\u30e0\u306f\u3001\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u304b\u3089\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u69cb\u6210\u60c5\u5831\u3092\u66f4\u65b0\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u69cb\u6210\u304c\u7121\u52b9\u306e\u5834\u5408\u306f\u66f4\u65b0\u306b\u5931\u6557\u3059\u308b\u305f\u3081\u3001\u69cb\u6210\u8a2d\u5b9a\u3092\u691c\u8a3c\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u5909\u66f4\u3092\u6709\u52b9\u306b\u3059\u308b\u305f\u3081\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u518d\u59cb\u52d5\u3092\u8a66\u884c\u3057\u3066\u304f\u3060\u3055\u3044\u3002
wssecurity.nonce.not.supported=nonce \u306f\u3001<i>BasicAuth</i> \u4ee5\u5916\u306e\u8a8d\u8a3c\u30e1\u30bd\u30c3\u30c9\u3067\u306f\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u307e\u305b\u3093\u3002
wssecurity.all.required=\u30d5\u30a3\u30fc\u30eb\u30c9\u306f\u3059\u3079\u3066\u5fc5\u9808\u3067\u3059\u3002

http.basicauth.title.displayName=HTTP \u57fa\u672c\u8a8d\u8a3c
http.basicauth.title.description=HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e\u305f\u3081\u306e\u57fa\u672c\u8a8d\u8a3c\u3002
http.basicauthid.displayName=\u57fa\u672c\u8a8d\u8a3c ID
http.basicauthid.description=\u3053\u306e\u30dd\u30fc\u30c8\u306e HTTP \u57fa\u672c\u8a8d\u8a3c\u7528\u306e\u30e6\u30fc\u30b6\u30fc ID\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 HTTP SSL \u57fa\u672c\u8a8d\u8a3c\u306f HTTP SSL \u69cb\u6210\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u3053\u3068\u306b\u3088\u3063\u3066\u3082\u69cb\u6210\u3067\u304d\u307e\u3059\u3002
http.basicauthpwd.displayName=\u57fa\u672c\u8a8d\u8a3c\u30d1\u30b9\u30ef\u30fc\u30c9
http.basicauthpwd.description=\u3053\u306e\u30dd\u30fc\u30c8\u306e HTTP \u57fa\u672c\u8a8d\u8a3c\u7528\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
http.sslconfig.title.displayName=HTTP SSL \u69cb\u6210
http.sslconfig.title.description=HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u7528 SSL \u69cb\u6210\u306e\u5225\u540d\u3002
http.sslenabled.displayName=HTTP SSL \u4f7f\u7528\u53ef\u80fd
http.sslenabled.description=\u30bb\u30ad\u30e5\u30a2\u30fb\u30bd\u30b1\u30c3\u30c8\u901a\u4fe1\u304c\u3053\u306e\u30dd\u30fc\u30c8\u306e HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306b\u5bfe\u3057\u3066\u4f7f\u7528\u53ef\u80fd\u304b\u3069\u3046\u304b\u3002 \u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u5834\u5408\u3001HTTP SSL \u69cb\u6210\u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
http.sslconfig.displayName=HTTP SSL \u69cb\u6210
http.sslconfig.description=\u3053\u306e\u30dd\u30fc\u30c8\u306e HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3067\u4f7f\u7528\u3059\u308b SSL \u69cb\u6210\u306e\u5225\u540d\u3002  \u3053\u308c\u306f\u3001HTTP SSL \u304c\u4f7f\u7528\u53ef\u80fd\u306a\u5834\u5408\u306b\u3001\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002

# The following error messages are accessed through Tr.error().
# Note that the SECGxxxx numbers are used to correlate the user visible messages (e.g. Tr.warning, Tr.error,
# Tr.audit) with an Explanation & User Response message that is documented in a Message Reference guide.
# Do not modify the existing SECGxxxx numbers.  See http://hany.austin.ibm.com/messages/index.html
# for info on how to add new messages.
# Every message you add to this section should also include an Explanation & a User Response.
# -------------------------------------------------------------------------------------------------
wssecurity.file.load.exception=SECG1000E: \u30ea\u30bd\u30fc\u30b9 {0} \u306e\u30ed\u30fc\u30c9\u3067\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f: {1}\u3002
wssecurity.file.load.exception.explanation=\u30ea\u30bd\u30fc\u30b9\u30fb\u30bb\u30c3\u30c8\u3067 ws-security.xml \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wssecurity.file.load.exception.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------
wssecurity.utils.nowssec=SECG1001W: ws-security.xml \u30d5\u30a1\u30a4\u30eb\u304c\u3001\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8 {0} \u3067\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wssecurity.utils.nowssec.explanation=\u30ea\u30bd\u30fc\u30b9\u30fb\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3067 ws-security.xml \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
wssecurity.utils.nowssec.useraction=CMSG0002
# -------------------------------------------------------------------------------------------------

# End of Tr.error() message section
# -------------------------------------------------------------------------------------------------
