<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>&#49472; &#47112;&#48296;&#50640; &#47582;&#44172; Nonce &#44396;&#49457;</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="twbs_confnoncecell"></a>
<h2>
<img alt="[&#47540;&#47532;&#49828; 5.1 &#51060;&#49345;]" src="v51.gif" border="0">&#49472; &#47112;&#48296;&#50640; &#47582;&#44172; Nonce &#44396;&#49457;</h2>


<div>&#51060; &#53440;&#49828;&#53356;&#45716;
WebSphere Application Server &#44288;&#47532; &#53080;&#49556;&#51012; &#49324;&#50857;&#54616;&#50668; &#49472; &#47112;&#48296;&#50640; &#47582;&#44172; Nonce&#47484; &#44396;&#49457;&#54616;&#45716; &#48169;&#48277;&#50640; &#45824;&#54620; &#51648;&#49884;&#49324;&#54637;&#51012; &#51228;&#44277;&#54633;&#45768;&#45796;. &#51025;&#50857;&#54532;&#47196;&#44536;&#47016; &#47112;&#48296;, &#49436;&#48260; &#47112;&#48296; &#48143; &#49472; &#47112;&#48296;&#50640;&#49436; Nonce&#47484; &#44396;&#49457;&#54624; &#49688; &#51080;&#49845;&#45768;&#45796;. 
&#44536;&#47084;&#45208; &#50864;&#49440;&#49692;&#50948;&#47484; &#44256;&#47140;&#54644;&#50556; &#54633;&#45768;&#45796;. &#45796;&#51020; &#47785;&#47197;&#50640; &#50864;&#49440;&#49692;&#50948;&#44032; &#45208;&#50752; &#51080;&#49845;&#45768;&#45796;. <ol>

<li>&#51025;&#50857;&#54532;&#47196;&#44536;&#47016; &#47112;&#48296;</li>

<li>&#49436;&#48260; &#47112;&#48296;</li>

<li>&#49472; &#47112;&#48296;</li>

</ol>&#51025;&#50857;&#54532;&#47196;&#44536;&#47016; &#47112;&#48296; &#48143; &#49436;&#48260; &#47112;&#48296;&#50640;&#49436; Nonce&#47484; &#44396;&#49457;&#54624; &#44221;&#50864;, &#51025;&#50857;&#54532;&#47196;&#44536;&#47016; &#47112;&#48296;&#50640; &#51648;&#51221;&#46108; &#44050;&#51060; &#49436;&#48260; &#47112;&#48296;&#50640; &#51648;&#51221;&#46108; &#44050;&#48372;&#45796; &#50864;&#49440;&#49692;&#50948;&#44032; &#45458;&#49845;&#45768;&#45796;. 
&#47560;&#52268;&#44032;&#51648;&#47196; &#51025;&#50857;&#54532;&#47196;&#44536;&#47016; &#47112;&#48296;&#50640; &#51648;&#51221;&#46108; &#44050;&#51060; &#49436;&#48260; &#47112;&#48296; &#48143; &#49472; &#47112;&#48296;&#50640; &#51648;&#51221;&#46108; &#44050;&#48372;&#45796; &#50864;&#49440;&#49692;&#50948;&#44032; &#45458;&#49845;&#45768;&#45796;. WebSphere Application Server Network Deployment &#54872;&#44221;&#50640;&#49436; Nonce&#47484; &#54952;&#50984;&#51201;&#51004;&#47196; &#49324;&#50857;&#54616;&#47140;&#47732;
<strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong>, <strong>Nonce &#52572;&#45824; &#50976;&#54952; &#44592;&#44036;</strong> &#48143; <strong>Nonce Clock Skew</strong> &#54596;&#46300;&#47484; &#51077;&#47141;&#54644;&#50556; &#54633;&#45768;&#45796;. 
&#44536;&#47084;&#45208; &#49436;&#48260; &#47112;&#48296;&#51032; &#44221;&#50864; &#51060; &#54596;&#46300;&#45716; &#49440;&#53469;&#51201;&#51077;&#45768;&#45796;. 
&#49472; &#47112;&#48296;&#50640;&#49436; Nonce&#47484; &#44396;&#49457;&#54616;&#47140;&#47732; &#45796;&#51020; &#45800;&#44228;&#47484; &#50756;&#47308;&#54616;&#49901;&#49884;&#50724;. </div>

<div>
<p class="sectiontitle">&#51060; &#53440;&#49828;&#53356;&#47484; &#50948;&#54620; &#45800;&#44228;</p>
<ol>

<li>&#54252;&#53944; &#48264;&#54840;&#47484; &#48320;&#44221;&#54616;&#51648; &#50506;&#51008; &#44221;&#50864;&#50640;&#45716; &#50937; &#48652;&#46972;&#50864;&#51200;&#50640; http://localhost:9090/admin&#51012; &#51077;&#47141;&#54616;&#50668; &#44288;&#47532; &#53080;&#49556;&#50640; &#50672;&#44208;&#54616;&#49901;&#49884;&#50724;. </li>

<li>
<strong>&#49436;&#48260; &gt; Application Servers &gt; </strong><strong>server1</strong>&#51012; &#53364;&#47533;&#54616;&#49901;&#49884;&#50724;. 
</li>

<li>&#52628;&#44032; &#46321;&#47197; &#51221;&#48372;&#50640;&#49436; <strong>&#50937; &#49436;&#48708;&#49828;: &#50937; &#49436;&#48708;&#49828; &#48372;&#50504;&#51012; &#50948;&#54620; &#44592;&#48376; &#48148;&#51064;&#46377;</strong>&#51012; &#53364;&#47533;&#54616;&#49901;&#49884;&#50724;. </li>

<li>
<strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#54596;&#46300;&#50640; &#44050;(&#52488;)&#51012; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;. 
<div>
<strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#44050;&#51008; Nouce&#47484; &#49325;&#51228;&#54616;&#44592; &#51204;&#50640; &#52880;&#49884;&#50640; &#45224;&#50500; &#51080;&#45716; &#44592;&#44036;&#51012; &#54364;&#49884;&#54633;&#45768;&#45796;. 
300&#52488; &#51060;&#49345;&#51012; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47084;&#45208;, &#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732;, &#44592;&#48376;&#44050;&#51008; 600&#52488;&#51077;&#45768;&#45796;. &#51060; &#54596;&#46300;&#45716; &#49436;&#48260; &#47112;&#48296;&#50640;&#49436;&#45716; &#49440;&#53469;&#51201;&#51060;&#45208; &#49472; &#47112;&#48296;&#50640;&#49436;&#45716; &#54596;&#49688;&#51077;&#45768;&#45796;. </div>
</li>

<li>
<strong>Nonce &#52572;&#45824; &#50976;&#54952; &#44592;&#44036;</strong> &#54596;&#46300;&#50640; &#44050;(&#52488;)&#51012; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;. 
<div>
<strong>Nonce &#52572;&#45824; &#50976;&#54952; &#44592;&#44036;</strong> &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#44050;&#51008; Nonce&#44032; &#50976;&#54952;&#54620; &#44592;&#44036;&#51012; &#54364;&#49884;&#54633;&#45768;&#45796;. 
300&#52488; &#51060;&#49345;&#51012; &#51648;&#51221;&#54644;&#50556; &#54616;&#45208; &#44050;&#51060; &#51060;&#51204; &#45800;&#44228;&#51032; <strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#54596;&#46300;&#50640; &#51648;&#51221;&#46108; &#49884;&#44036;(&#52488;)&#51012; &#52488;&#44284;&#54644;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;. &#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732; &#44592;&#48376;&#44050;&#51008; 600&#52488;&#51077;&#45768;&#45796;. 
WebSphere Application Server
Network Deployment &#54872;&#44221;, z/OS&#50857; WebSphere Application Server &#54872;&#44221;&#50640;&#49436;
<strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#54596;&#46300;&#50640; &#49436;&#48260; &#47112;&#48296;&#51032; &#44050;&#51012; &#51648;&#51221;&#54624; &#44221;&#50864;, &#44050;&#51008; <strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#54596;&#46300;&#50640; &#51648;&#51221;&#54620; &#44050;&#51012; &#52488;&#44284;&#54624; &#49688; &#50630;&#49845;&#45768;&#45796;. 
&#51060; &#54596;&#46300;&#45716; &#49436;&#48260; &#47112;&#48296;&#50640;&#49436;&#45716; &#49440;&#53469;&#51201;&#51060;&#45208; &#49472; &#47112;&#48296;&#50640;&#49436;&#45716; &#54596;&#49688;&#51077;&#45768;&#45796;. </div>
</li>

<li>
<strong>Nonce Clock Skew</strong> &#54596;&#46300;&#50640; &#45824;&#54644; &#44050;(&#52488;)&#51012; &#51648;&#51221;&#54616;&#49901;&#49884;&#50724;. 
<div>
<strong>Nonce Clock Skew</strong> &#54596;&#46300;&#50640; &#51648;&#51221;&#54620; &#44050;&#51008; &#47700;&#49884;&#51648;&#47484; &#48155;&#45716; &#49324;&#46988;&#51060; &#44050;&#51060; &#49352;&#47196;&#50868; &#44050;&#51064;&#51648;&#47484; &#44160;&#53664;&#54624; &#49884;&#44036;(&#52488;)&#51012; &#51648;&#51221;&#54633;&#45768;&#45796;. 
&#51060; &#44050;&#51012; &#49444;&#51221;&#54624; &#46412;&#45716; &#45796;&#51020; &#51221;&#48372;&#47484; &#44256;&#47140;&#54616;&#49901;&#49884;&#50724;. <ul>

<li>&#49884;&#44036;&#51060; &#48708;&#46041;&#44592;&#54868;&#46104;&#50612; &#51080;&#51012; &#44221;&#50864; &#47700;&#49884;&#51648; &#51204;&#49569;&#51088; &#48143; &#48155;&#45716; &#49324;&#46988; &#49324;&#51060;&#51032; &#49884;&#44036;&#52264;. </li>

<li>&#47700;&#49884;&#51648;&#47484; &#50516;&#54840;&#54868;&#54616;&#50668; &#51204;&#49569;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#49884;&#44036;.</li>

<li>&#45348;&#53944;&#50892;&#53356; &#54844;&#51105;&#51012; &#53685;&#44284;&#54616;&#45716; &#45936; &#54596;&#50836;&#54620; &#49884;&#44036;. </li>

</ul>&#52572;&#49548;&#54620; &#51060; &#54596;&#46300;&#50640; 0&#52488;&#47484; &#51648;&#51221;&#54644;&#50556; &#54633;&#45768;&#45796;. &#44536;&#47084;&#45208; &#52572;&#45824;&#44050;&#51060; <strong>Nonce
&#52572;&#45824; &#50976;&#54952; &#44592;&#44036;</strong> &#54596;&#46300;&#50640; &#54364;&#49884;&#46108; &#49884;&#44036;(&#52488;)&#51012; &#52488;&#44284;&#54644;&#49436;&#45716; &#50504;&#46121;&#45768;&#45796;. 
&#44050;&#51012; &#51648;&#51221;&#54616;&#51648; &#50506;&#51004;&#47732;, &#44592;&#48376;&#44050;&#51008; 0&#52488;&#51077;&#45768;&#45796;. 
&#51060; &#54596;&#46300;&#45716; &#49436;&#48260; &#47112;&#48296;&#50640;&#49436;&#45716; &#49440;&#53469;&#51201;&#51060;&#47728; &#49472; &#47112;&#48296;&#50640;&#49436;&#45716; &#54596;&#49688;&#51077;&#45768;&#45796;. </div>

</li>

<li>&#49436;&#48260;&#47484; &#45796;&#49884; &#49884;&#51089;&#54616;&#49901;&#49884;&#50724;. <div>

<strong>Nonce &#52880;&#49884; &#51228;&#54620;&#49884;&#44036;</strong> &#44050;&#51012; &#48320;&#44221;&#54620; &#54980; &#49436;&#48260;&#47484; &#45796;&#49884; &#49884;&#51089;&#54616;&#51648; &#50506;&#51004;&#47732; &#49436;&#48260;&#44032; &#48320;&#44221;&#49324;&#54637;&#51012; &#51064;&#49885;&#54616;&#51648; &#47803;&#54633;&#45768;&#45796;. </div>
</li>

</ol>
</div>

</body>
</html>
