<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Servicios Web: colecci&oacute;n de enlaces de seguridad del cliente</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_wsclientbind"></a>
<h2>
<img alt="[Fix Pack 5.0.2 y posterior]" src="v502.gif" border="0">Servicios Web: colecci&oacute;n de enlaces de seguridad del cliente</h2>

<p>Utilice esta p&aacute;gina para ver una lista de configuraciones de enlaces del extremo del cliente para Web Services Security. Estos
enlaces se utilizan cuando un servicio Web es cliente de otro servicio
Web.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, realice los pasos siguientes:<ol>

<li>Pulse <strong>Aplicaciones de empresa &gt; </strong><em>nombre_aplicaci&oacute;n</em>.</li>

<li>En Elementos relacionados, pulse
<strong>M&oacute;dulo Web &gt; </strong><em>nombre_archivo_URI</em><strong>&gt; Servicios Web: Enlaces de
seguridad del cliente</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_port"></a>Puerto</strong>
</dt>
<dd>Especifica el puerto que se utiliza para enviar y recibir mensajes desde un servidor.</dd>
<dt>
<strong><a name="sec_websvc"></a>Servicio Web</strong>
</dt>
<dd>Especifica el nombre del servicio Web.</dd>
<dt>
<strong><a name="sec_req"></a>Enlaces del remitente de peticiones</strong>
</dt>
<dd>Especifica la configuraci&oacute;n de enlaces que se utiliza para enviar mensajes de petici&oacute;n al receptor de peticiones.
<p>Pulse <strong>Editar</strong> para configurar la informaci&oacute;n de firma, la informaci&oacute;n de cifrado y los enlaces de inicio de sesi&oacute;n para el remitente de peticiones y para ver una lista de los localizadores de claves del almac&eacute;n de claves.</p>

<p>La informaci&oacute;n de enlaces del remitente de peticiones especificada para el cliente debe coincidir con la informaci&oacute;n de enlaces del receptor de peticiones especificada para el servidor.</p>

</dd>
<dt>
<strong><a name="sec_resp"></a>Enlace del receptor de respuestas</strong>
</dt>
<dd>Especifica la configuraci&oacute;n de enlaces que se utiliza para recibir mensajes de respuesta del remitente de respuestas.
<p>Pulse <strong>Editar</strong> para configurar la informaci&oacute;n de firmas y de cifrado y para ver una lista de anclas de confianza, certificados intermedios ubicados en el almac&eacute;n de certificados de colecciones y objetos de localizador de claves para el receptor de respuestas.</p>

<p>La informaci&oacute;n de enlaces del receptor de respuestas especificada para el cliente debe coincidir con la informaci&oacute;n de enlaces del remitente de respuestas especificada para el servidor.</p>

</dd>
<dt>
<strong><a name="sec_httpbasicauth"></a>Autenticaci&oacute;n b&aacute;sica HTTP </strong>
</dt>
<dd>Especifique el ID de usuario y la contrase&ntilde;a que se deben utilizar para este puerto con la autenticaci&oacute;n b&aacute;sica a nivel de trasporte HTTP. Puede habilitar la seguridad de autenticaci&oacute;n a
nivel de transporte independientemente de la seguridad a nivel de mensaje.
<p>Pulse <strong>Edita</strong> para configurar el ID de autenticaci&oacute;n b&aacute;sica y la contrase&ntilde;a para la autenticaci&oacute;n a nivel de transporte.</p>

</dd>
<dt>
<strong><a name="sec_httpsslconfig"></a>Configuraci&oacute;n HTTP SSL</strong>
</dt>
<dd>Habilita y configura la seguridad SSL a nivel de transporte para este puerto. Puede habilitar la seguridad SSL a
nivel de transporte independientemente de la seguridad a nivel de mensaje.
<p>Pulse <strong>Editar</strong> para especificar los valores para la
configuraci&oacute;n HTTP SSL a nivel de transporte para este puerto.</p>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="uwbs_reqsend.html">Colecci&oacute;n de enlaces del remitente de peticiones</a>
<br>

<a href="uwbs_resprecvr.html">Colecci&oacute;n de enlaces del receptor de respuestas</a>
<br>

<a href="uwbs_signinfo.html">Grupo de informaci&oacute;n de firmas</a>
<br>

<a href="uwbs_encrypt.html">Recogida de informaci&oacute;n de cifrado</a>
<br>

<a href="uwbs_keyl.html">Grupo de localizadores de claves</a>
<br>

<a href="uwbs_loginbnd.html">Valores de configuraci&oacute;n de enlaces de inicio de sesi&oacute;n</a>
<br>

</div>
</body>
</html>
