<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Grupo de almacenes de certificados de colecciones</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_colcertst"></a>
<h2>
<img alt="[Fix Pack 5.0.2 y posterior]" src="v502.gif" border="0">Grupo de almacenes de certificados de colecciones</h2>

<p>Utilice esta p&aacute;gina para ver una lista de almacenes de certificados que contienen los archivos de certificados de intermediarios que no son de confianza y est&aacute;n a la espera de ser validados. Es posible que la validaci&oacute;n consista en comprobar si el certificado
figura en una lista de revocaci&oacute;n de certificados, (la lista CRL), si el
certificado no ha caducado y si lo ha emitido un firmante de confianza.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, realice los pasos siguientes:<ol>

<li>Pulse <strong>Servidores &gt; Servidores de aplicaciones </strong><em>nombre_servidor</em>.
</li>

<li>En <strong>Elementos relacionados</strong>, pulse <strong>Servicios Web: Enlaces por omisi&oacute;n
para Web Services Security &gt; Almac&eacute;n de certificados de colecciones</strong>.</li>

<li>Pulse <strong>Nuevo</strong> para especificar un nombre de almac&eacute;n y el
proveedor de un nuevo almac&eacute;n de certificados de colecciones.</li>

<li>Pulse <strong>Suprimir</strong> para suprimir un almac&eacute;n de certificados de colecciones.</li>

</ol>
</p>

<p>Mediante este panel, realice los pasos siguientes:<ol>

<li>Especifique un nombre del almac&eacute;n de certificados y un proveedor del almac&eacute;n de certificados.</li>

<li>Para guardar los cambios, pulse <strong>Guardar</strong> en la parte superior de la consola administrativa. Cuando pulse <strong>Guardar</strong>, volver&aacute; al panel de inicio de la consola administrativa. </li>

<li>Vuelva al panel de colecciones Almac&eacute;n de certificados de colecciones y pulse <strong>Actualizar el tiempo de ejecuci&oacute;n</strong> para actualizar el tiempo de ejecuci&oacute;n de Web Services Security con la informaci&oacute;n de enlace por omisi&oacute;n, que se
encuentra en el archivo <samp>ws_security.xml</samp>. </li>

</ol>
</p>

<p>
<b>Nota: </b>Al
pulsar <strong>Actualizar el tiempo de ejecuci&oacute;n</strong>, los cambios de tiempo
de configuraci&oacute;n realizados en los dem&aacute;s servicios Web se actualizan
durante el tiempo de ejecuci&oacute;n de Web Services Security.</p>

<dl>
<dt>
<strong><a name="sec_colcertname"></a>Nombre del almac&eacute;n de certificados</strong>
</dt>
<dd>Especifica el nombre del almac&eacute;n de certificados.</dd>
<dt>
<strong><a name="sec_colcertprv"></a>Proveedor del almac&eacute;n de certificados </strong>
</dt>
<dd>Especifica el proveedor del almac&eacute;n de certificados.</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="uwbs_colcertstn.html">Valores de configuraci&oacute;n del almac&eacute;n de certificados de colecciones</a>
<br>

<a href="uwbs_x509cert.html">Grupo de certificados X.509</a>
<br>

<a href="uwbs_x509certn.html">Valores de configuraci&oacute;n de certificados X.509</a>
<br>

</div>
</body>
</html>
