<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Colecci&oacute;n de enlaces del remitente de respuestas</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_respsend"></a>
<h2>
<img alt="[Fix Pack 5.0.2 y posterior]" src="v502.gif" border="0">Colecci&oacute;n de enlaces del remitente de respuestas</h2>

<p>Utilice esta p&aacute;gina para especificar la configuraci&oacute;n de enlaces
para mensajes del remitente de respuestas para Web Services Security.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, realice los pasos siguientes:<ol>

<li>Pulse <strong>Aplicaciones &gt; Aplicaciones de empresa &gt;
</strong><em>nombre_aplicaci&oacute;n</em>.</li>

<li>En Elementos relacionados, pulse <strong>M&oacute;dulos Web</strong> &gt; <em>nombre_archivo_URI</em>&gt; <strong>Servicios Web: Enlaces de seguridad del servidor</strong>.</li>

<li>En Enlace del remitente de respuestas,
pulse <strong>Editar</strong>.</li>

</ol>
</p>

<dl>
<dt>
<strong><a name="sec_signing"></a>Informaci&oacute;n de firmas</strong>
</dt>
<dd>Especifica la configuraci&oacute;n para los par&aacute;metros de firma. 
<p>Tambi&eacute;n puede utilizar estos par&aacute;metros para la validaci&oacute;n de
certificados X.509 cuando el M&eacute;todo de autenticaci&oacute;n es IDAssertion
y el Tipo de ID es X509Certificate en la configuraci&oacute;n a nivel de
servidor. En estos casos, debe rellenar &uacute;nicamente los campos de <strong>V&iacute;a de acceso de certificados</strong>.</p>

</dd>
<dt>
<strong><a name="sec_encrypt"></a>Informaci&oacute;n de cifrado</strong>
</dt>
<dd>Especifica la configuraci&oacute;n para los par&aacute;metros de cifrado y descifrado. </dd>
<dt>
<strong><a name="sec_keyldesc"></a>Localizadores de claves</strong>
</dt>
<dd>Especifica una lista de objetos de localizador de claves que recuperan las claves para la signatura digital y el cifrado desde un archivo de almac&eacute;n de claves o un dep&oacute;sito. El localizador de claves correlaciona un nombre o nombre l&oacute;gico con un alias o correlaciona una identidad autenticada con una clave. Este nombre l&oacute;gico se utiliza para localizar una clave en una implementaci&oacute;n de localizador de claves.</dd>
</dl>
</body>
</html>
