<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Boutons de la console d'administration</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_buttons"></a>
<h2>Boutons de la console d'administration</h2>

<p>Les choix de boutons suivants sont disponibles sur diff&eacute;rentes pages de
la console d'administration selon les options du produit que vous avez activ&eacute;es.</p>

<ul>

<li>
<strong>Abandonner. </strong>Abandonne une transaction qui n'est pas
encore &agrave; l'&eacute;tat pr&eacute;vu. Toutes les op&eacute;rations achev&eacute;es par la transaction seront annul&eacute;es.</li>

<li>
<strong>Ajouter. </strong>Ajoute l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; ou saisi &agrave; une liste
ou ouvre une bo&icirc;te de dialogue permettant d'ajouter un &eacute;l&eacute;ment &agrave; une
liste.</li>


<li>
<strong>Valider. </strong>Enregistre les modifications que vous apportez &agrave;
une page sans la quitter.</li>

<li>
<strong>Pr&eacute;c&eacute;dent. </strong>Affiche la page ou l'&eacute;l&eacute;ment pr&eacute;c&eacute;dent d'une s&eacute;quence.  La console d'administration ne prend pas en charge les boutons
Pr&eacute;c&eacute;dent et Suivant du navigateur. Ces boutons peuvent g&eacute;n&eacute;rer des probl&egrave;mes par intermittence. Utilisez &agrave; la place les boutons Pr&eacute;c&eacute;dent ou Annuler dans les
panneaux de la console d'administration.</li>

<li>
<strong>Parcourir. </strong>Ouvre une bo&icirc;te de dialogue permettant de
rechercher un fichier de votre syst&egrave;me.</li>

<li>
<strong>Annuler. </strong>Quitte la page ou la bo&icirc;te de dialogue en cours,
en supprimant les modifications non sauvegard&eacute;es.
 La console d'administration ne prend pas en charge les boutons
Pr&eacute;c&eacute;dent et Suivant du navigateur. Ces boutons peuvent g&eacute;n&eacute;rer des probl&egrave;mes par intermittence. Utilisez &agrave; la place le bouton Annuler dans les
panneaux de la console d'administration.</li>

<li>
<strong>Modifier. </strong>Dans le contexte de s&eacute;curit&eacute;, permet de
rechercher dans le registre d'utilisateurs un ID utilisateur sous lequel
une ex&eacute;cution va s'ex&eacute;cuter. 
Dans le
contexte des propri&eacute;t&eacute;s de conteneur, permet de modifier la source de
donn&eacute;es utilis&eacute;e par le conteneur.</li>

<li>
<strong>Effacer. </strong>Efface vos modifications et restaure les
derni&egrave;res valeurs sauvegard&eacute;es.</li>

<li>
<strong>D&eacute;s&eacute;lectionner. </strong>Annule la s&eacute;lection de cellules
dans les tableaux de l'onglet.</li>

<li>
<strong>Fermer. </strong>Ferme la bo&icirc;te de dialogue.</li>

<li>
<strong>Valider. </strong>Lib&egrave;re tous les verrous d&eacute;tenus par une
transaction pr&eacute;par&eacute;e et force la validation de la transaction.</li>

<li>
<strong>Copier. </strong>Cr&eacute;e des copies des serveurs d'applications
s&eacute;lectionn&eacute;s.</li>

<li>
<strong>Cr&eacute;er. </strong>Enregistre les modifications que vous avez
apport&eacute;es aux onglets d'une bo&icirc;te de dialogue et quitte cette derni&egrave;re.</li>

<li>
<strong>Supprimer. </strong>Supprime l'instance s&eacute;lectionn&eacute;e.</li>

<li>
<strong>D&eacute;tails. </strong>Affiche les d&eacute;tails relatifs &agrave; une transaction.</li>

<li>
<strong>Termin&eacute;. </strong>Enregistre les modifications que vous avez
apport&eacute;es aux onglets d'une bo&icirc;te de dialogue et quitte cette derni&egrave;re.</li>

<li>
<strong>Bas. </strong>Se d&eacute;place dans une liste en allant vers le bas
de cette derni&egrave;re.</li>

<li>
<strong>Vidage. </strong>Active le vidage d'un serveur d'applications trac&eacute;.</li>

<li>
<strong>Editer. </strong>Permet d'&eacute;diter l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; dans
une liste ou ouvre une bo&icirc;te de dialogue dans laquelle l'&eacute;l&eacute;ment peut
&ecirc;tre &eacute;dit&eacute;.</li>

<li>
<strong>Exporter. </strong>Acc&egrave;de &agrave; une page permettant l'exportation de
fichiers EAR pour une application d'entreprise.</li>

<li>
<strong>Exporter les fichiers DDL. </strong>Acc&egrave;de &agrave; une page permettant
l'exportation de fichiers DDL pour une application d'entreprise.</li>

<li>
<strong>Exporter les cl&eacute;s. </strong>Exporte les cl&eacute;s LTPA dans
d'autres domaines.</li>

<li>
<strong>Filtrage. </strong>Ouvre une bo&icirc;te de dialogue permettant de
d&eacute;finir les ressources &agrave; afficher dans les tableaux de l'onglet.</li>

<li>
<strong>Terminer. </strong>Provoque la fin d'une transaction, que sa
sortie ait &eacute;t&eacute; rapport&eacute;e &agrave; toutes les applications participantes ou non.</li>

<li>
<strong>Premier. </strong>Affiche le premier enregistrement d'une
s&eacute;rie d'enregistrement.</li>


<li>
<strong>G&eacute;n&eacute;ration de cl&eacute;s. </strong>G&eacute;n&egrave;re de nouvelles cl&eacute;s LTPA. Lorsque
la s&eacute;curit&eacute; est activ&eacute;e pour la premi&egrave;re fois avec LTPA comme
m&eacute;canisme d'authentification, les cl&eacute;s LTPA sont automatiquement
g&eacute;n&eacute;r&eacute;es avec le mot de passe saisi dans le panneau. Si de nouvelles
cl&eacute;s doivent &ecirc;tre g&eacute;n&eacute;r&eacute;es, utilisez ce bouton apr&egrave;s la sauvegarde du
serveur avec la s&eacute;curit&eacute; activ&eacute;e.  Lorsque vous cliquez sur ce bouton,
les cl&eacute;s sont g&eacute;n&eacute;r&eacute;es et elles sont propag&eacute;es &agrave; tous les serveurs
actifs (cellule, noeud et serveurs d'applications). Les nouvelles cl&eacute;s peuvent &ecirc;tre utilis&eacute;es pour chiffrer et d&eacute;chiffrer
 les jetons LTPA. Cliquez sur <strong>Sauvegarder</strong> dans la barre des t&acirc;ches de la console
pour enregistrer les nouvelles cl&eacute;s et le mot de passe dans le
r&eacute;f&eacute;rentiel.</li>

<li>
<strong>Arr&ecirc;t imm&eacute;diat. </strong> Arr&ecirc;te le serveur mais ignore le processus de mise au repos normal
de celui-ci qui permet aux demandes en cours d'&ecirc;tre ex&eacute;cut&eacute;es avant la fermeture de l'ensemble
du processus serveur. Ce mode de fermeture est plus rapide que l'arr&ecirc;t normal du
serveur, mais certains clients d'application peuvent recevoir des exceptions.</li>

<li>
<strong>Importer les cl&eacute;s. </strong>Importe de nouvelles cl&eacute;s LTPA d'autres
domaines. Pour prendre en charge l'ouverture de session unique (SSO)
dans WebSphere sur plusieurs domaines (cellules) WebSphere, des cl&eacute;s
LTPA et un mot de passe doivent &ecirc;tre partag&eacute;s entre les domaines. Apr&egrave;s l'exportation des cl&eacute;s de l'une des cellules dans un fichier,
cliquez sur ce bouton pour importer les cl&eacute;s dans tous les serveurs
actifs (cellule, noeud et serveurs d'application). Les nouvelles cl&eacute;s
peuvent &ecirc;tre utilis&eacute;es pour chiffrer et d&eacute;chiffrer le jeton LTPA. Cliquez sur <strong>Sauvegarder</strong> dans la barre des t&acirc;ches de la console
pour enregistrer les nouvelles cl&eacute;s et le mot de passe dans le
r&eacute;f&eacute;rentiel.</li>

<li>
<strong>Installer. </strong>Affiche la page Pr&eacute;paration &agrave; l'installation de l'application, qui permet de d&eacute;ployer une application ou un composant EJB ou Web sur un serveur d'applications.</li>

<li>
<strong>Install RAR.</strong>Le bouton Installation d'un fichier RAR permet
d'ouvrir une
bo&icirc;te de dialogue utilis&eacute;e pour installer un connecteur JCA et
cr&eacute;er l'adaptateur de ressources associ&eacute;.</li>

<li>
<strong>Gestion des transactions. </strong>Affiche une liste de
transactions actives s'ex&eacute;cutant sur un serveur. Vous pouvez mettre
fin de mani&egrave;re forc&eacute;e &agrave; toute transaction dont le traitement s'est
arr&ecirc;t&eacute; en raison de l'indisponibilit&eacute; d'une ressource transactionnelle.</li>

<li>
<strong>Modifier. </strong>Ouvre une bo&icirc;te de dialogue permettant de
modifier une sp&eacute;cification.</li>

<li>
<strong>D&eacute;placer. </strong>D&eacute;place les serveurs d'applications
s&eacute;lectionn&eacute;s &agrave; un autre emplacement de la cellule d'administration. A l'invite du syst&egrave;me, indiquez l'emplacement cible.</li>

<li>
<strong>Nouveau. </strong>Affiche une page permettant de d&eacute;finir une
nouvelle instance. Par exemple, en cliquant sur <strong>Nouveau</strong> dans
la page des serveurs d'applications, une page s'affiche, sur laquelle
 vous pouvez configurer un nouveau serveur d'applications.</li>

<li>
<strong>Suivant. </strong>Affiche la page, le cadre ou l'&eacute;l&eacute;ment suivant
d'une s&eacute;quence.</li>

<li>
<strong>OK. </strong>Enregistre vos modifications et quitte la page.</li>

<li>
<strong>Ping. </strong>Tente d'entrer en contact avec les serveurs
d'applications s&eacute;lectionn&eacute;s.</li>

<li>
<strong>Pr&eacute;c&eacute;dent. </strong>Affiche la page, le cadre ou l'&eacute;l&eacute;ment
pr&eacute;c&eacute;dent d'une s&eacute;quence.</li>

<li>
<strong>Quitter. </strong>Quitte une bo&icirc;te de dialogue en supprimant toutes
les modifications non sauvegard&eacute;es.</li>

<li>
<strong>R&eacute;g&eacute;n&eacute;rer. </strong>R&eacute;g&eacute;n&egrave;re la vue des donn&eacute;es pour les
instances figurant actuellement dans cet onglet.</li>


<li>
<strong>Retirer. </strong>Supprime l'&eacute;l&eacute;ment s&eacute;lectionn&eacute;.</li>


<li>
<strong>Restaurer. </strong>Efface vos modifications de l'onglet et
restaure les valeurs le plus r&eacute;cemment enregistr&eacute;es.</li>

<li>
<strong>Red&eacute;marrer. </strong>Arr&ecirc;te les objets s&eacute;lectionn&eacute;s et les d&eacute;marre &agrave; nouveau.</li>


<li>
<strong>Extraire un nouvel &eacute;l&eacute;ment. </strong>Extrait un nouvel
enregistrement.</li>

<li>
<strong>Sauvegarder. </strong>Sauvegarde les modifications apport&eacute;es &agrave; la
configuration locale dans la configuration ma&icirc;tresse.</li>

<li>
<strong>S&eacute;lectionner. </strong>Pour l'analyse des ressources, permet de
s&eacute;lectionner une port&eacute;e dans laquelle contr&ocirc;ler les ressources.</li>

<li>
<strong>D&eacute;finir. </strong>Sauvegarde les modifications apport&eacute;es aux
param&egrave;tres dans une bo&icirc;te de dialogue.</li>

<li>
<strong>Param&egrave;tres. </strong>Ouvre une bo&icirc;te de dialogue pour
l'&eacute;dition des param&egrave;tres de ressources relatifs au servlet.</li>

<li>
<strong>Param&egrave;tres actuellement configur&eacute;s. </strong>Ouvre une bo&icirc;te de
dialogue affichant les param&egrave;tres en cours d'utilisation.</li>

<li>
<strong>D&eacute;marrer. </strong>Dans le contexte des serveurs d'applications,
d&eacute;marre les serveurs d'application s&eacute;lectionn&eacute;s. Dans le contexte de
collecte de donn&eacute;es, d&eacute;marre la collecte des donn&eacute;es pour les tables
de cet onglet.</li>

<li>
<strong>Arr&ecirc;ter. </strong>Dans le contexte des composants serveur, tels que
des serveurs d'applications, arr&ecirc;te les composants serveur
s&eacute;lectionn&eacute;s. Dans le contexte d'une collecte de donn&eacute;es, arr&ecirc;te la
collecte des donn&eacute;es pour les tables de cet onglet. </li>




<li>
<strong>D&eacute;sinstaller. </strong>Supprime une application d&eacute;ploy&eacute;e du r&eacute;f&eacute;rentiel de configuration de WebSphere Application Server. Supprime &eacute;galement les fichiers binaires d'application du syst&egrave;me de
fichiers.</li>

<li>
<strong>Mettre &agrave; jour. </strong>Remplace une application d&eacute;ploy&eacute;e sur un serveur par une application mise &agrave; jour. Lors du processus de mise &agrave; jour, il se peut que vous deviez effectuer des op&eacute;rations sur les pages de
pr&eacute;paration &agrave; l'installation de l'application et de mise &agrave; jour de l'application.</li>

<li>
<strong>Mettre &agrave; jour la liste de ressources. </strong>Met &agrave; jour
les donn&eacute;es d'une table.
 D&eacute;couvre et ajoute les nouvelles instances &agrave; la table.</li>




<li>
<strong>Afficher. </strong>Affiche une bo&icirc;te de dialogue relative &agrave; un fichier.</li>

</ul>

</body>
</html>
