<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de transports HTTP</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rhttptransport"></a>
<h2>Collection de transports HTTP</h2>

<p>Cette page permet d'afficher ou de g&eacute;rer les transports HTTP. Les transports g&eacute;n&egrave;rent
 des files d'attente de demandes entre les plug-ins WebSphere pour les serveurs Web et les conteneurs Web
 dans lesquels r&eacute;sident les modules Web des applications. Lorsque vous appelez une application &agrave; partir
 d'un navigateur Web, la demande est transmise au serveur Web, puis via le transport au conteneur Web.</p>

<p>Pour afficher la page de la console d'administration, s&eacute;lectionnez
<strong>Serveurs &gt; Serveurs d'applications
 &gt; </strong><em>nom_serveur</em><strong> &gt; Conteneur
Web &gt; Transports HTTP</strong>.</p>

<dl>
<dt>
<strong><a name="Transport_host_description"></a>H&ocirc;te</strong>
</dt>
<dd>Indique l'adresse IP de l'h&ocirc;te auquel se connecter
pour le transport. Si le serveur d'applications r&eacute;side sur une machine locale, le nom
d'h&ocirc;te peut &ecirc;tre <samp>localhost</samp>.

</dd>
<dt>
<strong><a name="Transport_port_description"></a>Port</strong>
</dt>
<dd>Indique le port auquel se connecter pour le transport. Le
num&eacute;ro du port peut correspondre &agrave; n'importe quel port en cours
d'utilisation sur le syst&egrave;me. Il doit &ecirc;tre unique pour chaque instance de serveur d'applications sur une machine donn&eacute;e.

</dd>
<dt>
<strong><a name="Transport_sslEnabled_description"></a>SSL activ&eacute;</strong>
</dt>
<dd>Indique s'il est n&eacute;cessaire de prot&eacute;ger les connexions
entre le plug-in WebSphere et le serveur d'applications &agrave; l'aide du
protocole SSL (Secure Sockets Layer). Par d&eacute;faut, le protocole SSL
n'est pas utilis&eacute;.

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="urun_rhttptransport_prop.html">Param&egrave;tres de transport HTTP</a>
<br>

</div>
</body>
</html>
