<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de serveurs</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rsvr"></a>
<h2>Collection de serveurs</h2>

<p>Cette page permet d'afficher des informations sur les serveurs d'applications et les serveurs JMS et de les g&eacute;rer.</p>

<p>
<strong>Serveurs d'applications</strong>
</p>

<p>La page Serveurs d'applications dresse la liste des serveurs d'applications de la cellule
et des noeuds sur lesquels sont install&eacute;s ces serveurs d'applications.</p>

<p>Le produit Network Deployment permet &eacute;galement d'afficher le
statut des serveurs d'applications. Le statut indique si un serveur est en cours d'ex&eacute;cution, arr&ecirc;t&eacute; ou si un incident s'est produit.</p>

<p>Pour afficher cette page de la console d'administration, cliquez
sur <strong>Serveurs &gt; Serveurs d'applications</strong>.</p>

<p>
<strong>Serveurs JMS</strong>
</p>

<p>Chaque serveur JMS fournit les fonctions de fournisseur JMS pour un noeud
de votre domaine administratif.
Chaque noeud de votre domaine administratif peut comporter un serveur JMS au maximum et n'importe quel serveur
d'applications du domaine peut acc&eacute;der aux ressources JMS trait&eacute;es par n'importe quel serveur JMS install&eacute; sur n'importe
quel noeud du domaine.</p>

<p>Pour afficher cette page de la console d'administration, cliquez
sur <strong>Serveurs &gt; Serveurs JMS</strong>.</p>

<dl>
<dt>
<strong><a name="Server_name_description"></a>Nom</strong>
</dt>
<dd>Indique le nom logique du serveur. Les noms de serveur
doivent &ecirc;tre uniques dans un noeud.</dd>
<dt>
<strong><a name="rappsvr-rt3"></a>Noeud</strong>
</dt>
<dd>Indique le nom du noeud du serveur d'applications.</dd>
<dt>
<strong><a name="rappsvr-rt4"></a>Etat</strong>
            &nbsp;
            </dt>
<dd>Indique si le serveur d'applications est d&eacute;marr&eacute; ou arr&ecirc;t&eacute;.
(Network Deployment uniquement)
<p>Si le statut est <em>Indisponible</em>, l'agent de noeud ne s'ex&eacute;cute pas sur ce noeud et
vous devez red&eacute;marrer l'agent de noeud pour pouvoir d&eacute;marrer le serveur.</p>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="urun_rappsvr.html">Param&egrave;tres de serveur d'applications</a>
<br>

<a href="umj_projs.html">Param&egrave;tres de serveur JMS interne WebSphere</a>
<br>

<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

</div>
</body>
</html>
