<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Probl&egrave;mes de configuration</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="configproblems_description"></a>
<h2>Probl&egrave;mes de configuration</h2>

<p>Cette page permet d'identifier et d'afficher les incidents qui existent dans la configuration courante.</p>

<p>Pour afficher la page de la console d'administration, cliquez sur <strong>R&eacute;solution des
incidents &gt; Probl&egrave;mes de configuration</strong> dans l'arborescence de navigation de la
console.</p>

<p>Cliquez sur un incident de configuration dans le tableau pour afficher sa description.</p>

<dl>
<dt>
<strong><a name="configproblems_validation_description"></a>Validation du document de configuration</strong>
</dt>
<dd>Ces zones permettent de sp&eacute;cifier le niveau de validation &agrave; effectuer sur les documents de configuration.</dd>
<dt>
<strong><a name="configproblems_validation_crossDescription"></a>Validation interdocuments</strong>
</dt>
<dd>Permet d'activer la validation interdocuments de configuration.
<p>L'activation de la validation interdocuments permet la comparaison
des documents de configuration pour trouver les param&egrave;tres en conflit.</p>

</dd>
<dt>
<strong><a name="resid_maybe"></a>Probl&egrave;mes de configuration</strong>
</dt>
<dd>

<p>Affiche les messages d'erreur li&eacute;s &agrave; l'incident de configuration en cours. Cliquez sur
un message pour afficher des informations d&eacute;taill&eacute;es sur l'incident.</p>

</dd>
<dt>
<strong><a name="resid_maybe"></a>Port&eacute;e</strong>
</dt>
<dd>

<p>Trie la liste des incidents de configuration en fonction des fichiers de configuration o&ugrave; les messages d'erreur s'affichent. Cliquez sur un message pour afficher des informations d&eacute;taill&eacute;es sur l'incident.</p>

<p>
<strong>Zones d'explication des incidents de configuration :</strong>
</p>

<p>Les zones d'information suivantes s'affichent lorsque vous cliquez sur un message d'incident de configuration :</p>

</dd>
<dt>
<strong><a name="configproblems_message_textDesc"></a>Message</strong>
</dt>
<dd>Affiche le message renvoy&eacute; par le valideur.</dd>
<dt>
<strong><a name="configproblems_message_explanation"></a>Explication</strong>
</dt>
<dd>Rapide explication de l'incident.</dd>
<dt>
<strong><a name="configproblems_message_recommendation"></a>Action de l'utilisateur</strong>
</dt>
<dd>Indique l'action recommand&eacute;e pour corriger l'incident.</dd>
<dt>
<strong><a name="configproblems_message_targetDesc"></a>Objet cible</strong>
</dt>
<dd>Identifie l'objet de configuration &agrave; l'endroit o&ugrave; l'erreur de validation s'est produite.</dd>
<dt>
<strong><a name="configproblems_message_severityDesc"></a>Gravit&eacute;</strong>
</dt>
<dd>Indique la gravit&eacute; de l'erreur de configuration,  1
indiquant une erreur grave. Plus le descripteur de gravit&eacute; poss&egrave;de une
valeur &eacute;lev&eacute;e, plus la gravit&eacute; est faible.</dd>
<dt>
<strong><a name="configproblems_message_localURIDesc"></a>URI local</strong>
</dt>
<dd>Indique l'URI local du fichier de configuration dans
lequel l'erreur s'est produite.</dd>
<dt>
<strong><a name="configproblems_message_fullURIDesc"></a>URI complet</strong>
</dt>
<dd>Indique l'URI complet du fichier de configuration dans
lequel l'erreur s'est produite.</dd>
<dt>
<strong><a name="configproblems_message_validatorClassDesc"></a>Nom de classe du valideur</strong>
</dt>
<dd>Nom de classe du valideur signalant l'incident.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
