<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Funktionen der Administrationskonsolseiten  </title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_pageusage"></a>
<h2>Funktionen der Administrationskonsolseiten  </h2>

<p>Dieser Abschnitt enth&auml;lt Informationen zu den Grundelementen einer
Administrationskonsolseite, wie z. B. den verschiedenen Registern. </p>

<p>Die Administrationskonsolseiten sind nach wenigen grundlegenden Mustern angeordnet. Wenn
Sie sich mit dem Layout und der Funktionsweise der Seiten vertraut machen, f&auml;llt es Ihnen leichter, sie zu
verwenden. </p>

<p>
<strong>Gruppenseiten</strong>
</p>

<p>Auf Gruppenseiten k&ouml;nnen Sie eine Gruppe vorhandener Administrationsobjekte verwalten. Eine Gruppenseite
enth&auml;lt normalerweise eines oder mehrere der folgenden Elemente: </p>

<dl>

<dt>
<strong>Bereich, Filter und Vorgaben </strong>
</dt>
<dd>Diese Begriffe werden in den Abschnitten
<a href="rcon_scope.html">Geltungsbereichseinstellungen f&uuml;r die Administrationskonsole</a>, <a href="rcon_filter.html">Filtereinstellungen f&uuml;r die Administrationskonsole</a>
und <a href="rcon_preferences.html">Vorgaben f&uuml;r die Administrationskonsole</a> erl&auml;utert.</dd>

<dt>
<strong>Tabelle vorhandener Objekte </strong>
</dt>
<dd>In der Tabelle werden vorhandene
Administrationsobjekte des auf der
Gruppenseite angegebenen Typs angezeigt. In den Spalten der Tabelle werden die Werte der
Schl&uuml;sseleinstellungen f&uuml;r diese Objekte zusammengefasst. Wenn noch keine Objekte vorhanden sind, wird eine
leere Tabelle angezeigt. Sie k&ouml;nnen ein neues Objekt anhand der verf&uuml;gbaren Schaltfl&auml;chen erstellen.  </dd>

<dt>
<strong>Schaltfl&auml;chen f&uuml;r das Ausf&uuml;hren von Aktionen </strong>
</dt>
<dd>Die verf&uuml;gbaren Schaltfl&auml;chen werden im Abschnitt
<a href="rcon_buttons.html">Kn&ouml;pfe in der Adminstrationskonsole</a> beschrieben.In den meisten F&auml;llen m&uuml;ssen Sie ein
oder mehrere Objekte in der Tabelle ausw&auml;hlen und dann auf eine Schaltfl&auml;che klicken. Die Aktion wird auf die
ausgew&auml;hlten Objekte angewendet. </dd>

<dt>
<strong>Umschaltkn&ouml;pfe f&uuml;r Sortierung</strong>
</dt>
<dd>Die nachfolgend aufgef&uuml;hrten Spalten&uuml;berschriften in der
Tabelle sind Symbole f&uuml;r aufsteigende Sortierung (^) und absteigende Sortierung (v). Standardm&auml;&szlig;ig werden
Elemente, wie z. B. Namen, absteigend (alphabetisch) sortiert. Wenn Sie eine andere Sortierreihenfolge
aktivieren m&ouml;chten, m&uuml;ssen Sie auf die Symbole f&uuml;r die Spalte klicken, deren Eintr&auml;ge Sie sortieren m&ouml;chten.
</dd>

</dl>

<p>
<strong>Detailseiten</strong>
</p>

<p>Auf Detailseiten k&ouml;nnen Sie spezifische Administrationsobjekte, wie z. B. einen Anwendungsserver,
konfigurieren. Eine Detailseite enth&auml;lt normalerweise eines oder mehrere der folgenden Elemente: </p>

<dl>

<dt>
<strong>Register "Konfiguration" </strong>
</dt>
<dd>Unter diesem Register k&ouml;nnen Sie die Konfiguration eines
Administrationsobjekts &auml;ndern. </dd>

<dt>
<strong>Register "Laufzeit"</strong>
</dt>
<dd>Unter diesem Register wird die Konfiguration angezeigt, die gegenw&auml;rtig f&uuml;r
das Administrationsobjekt verwendet wird. In den meisten F&auml;llen ist diese Konfiguration schreibgesch&uuml;tzt. </dd>

<dt>
<strong>Schaltfl&auml;chen f&uuml;r das Ausf&uuml;hren von Aktionen </strong>
</dt>
<dd>Die verf&uuml;gbaren Schaltfl&auml;chen werden im Abschnitt
<a href="rcon_buttons.html">Kn&ouml;pfe in der Adminstrationskonsole</a> beschrieben.</dd>

</dl>

<p>
<strong>Assistentseiten</strong>
</p>

<p>Mit Assistentseiten k&ouml;nnen Sie einen aus mehreren Schritten zusammengesetzten Konfigurationsprozess
ausf&uuml;hren. Beachten Sie, dass Assistenten bestimmte Schritte anzeigen bzw. verdecken, je nach Kenndaten
des spezifischen Objekts, das Sie konfigurieren m&ouml;chten. </p>

</body>
</html>
