<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Kn&ouml;pfe in der Adminstrationskonsole</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_buttons"></a>
<h2>Kn&ouml;pfe in der Adminstrationskonsole</h2>

<p>Die folgenden Schaltfl&auml;chenoptionen sind je nach aktivierter Produktfunktion auf verschiedenen
Seiten der Administrationskonsole verf&uuml;gbar. </p>

<ul>

<li>
<strong>Abbrechen. </strong>Bricht eine Transaktion ab, die sich noch nicht im Status
"Vorbereitet" befindet.
Alle von der Transaktion ausgef&uuml;hrten Operationen werden r&uuml;ckg&auml;ngig gemacht.</li>

<li>
<strong>Hinzuf&uuml;gen. </strong>F&uuml;gt das ausgew&auml;hlte oder eingegebene Element einer Liste hinzu
oder ruft ein Dialogfenster auf, in dem ein Element einer Liste hinzugef&uuml;gt werden kann. </li>


<li>
<strong>Anwenden. </strong>Speichert die &Auml;nderungen auf einer Seite, ohne die Seite zu verlassen. </li>

<li>
<strong>Zur&uuml;ck. </strong>Zeigt die vorherige Seite oder das
vorherige Element in einer Folge an. Beachten Sie, dass die
Administrationskonsole die Schaltfl&auml;chen "Vor" und "Zur&uuml;ck" eines Browsers nicht
unterst&uuml;tzt. Die Verwendung dieser Schaltfl&auml;chen kann zu st&auml;ndigen Fehlern f&uuml;hren. Verwenden Sie
stattdessen die Schaltfl&auml;chen "Zur&uuml;ck" bzw. "Abbrechen" in den Anzeigen der
Administrationskonsole. </li>

<li>
<strong>Durchsuchen. </strong>&Ouml;ffnet einen Dialog, mit dem Sie eine Datei im System suchen k&ouml;nnen. </li>

<li>
<strong>Abbrechen. </strong>Verl&auml;sst die aktuelle Seite oder das aktuelle Dialogfenster
und macht nicht gespeicherte &Auml;nderungen r&uuml;ckg&auml;ngig. Beachten Sie, dass die
Administrationskonsole die Schaltfl&auml;chen "Vor" und "Zur&uuml;ck" eines Browsers nicht
unterst&uuml;tzt. Die Verwendung dieser Schaltfl&auml;chen kann zu st&auml;ndigen Fehlern f&uuml;hren. 
Verwenden Sie stattdessen die Schaltfl&auml;che "Vor" und "Zur&uuml;ck" in den
Anzeigen der Administrationskonsole. </li>

<li>
<strong>&Auml;ndern. </strong>Erm&ouml;glicht Ihnen im Kontext der Sicherheit, die
Benutzer-Registry nach einer Benutzer-ID zu durchsuchen, unter der eine Anwendung ausgef&uuml;hrt werden kann.
Erm&ouml;glicht Ihnen im Kontext der Containermerkmale, die vom Container verwendete Datenquelle zu &auml;ndern. </li>

<li>
<strong>Inhalt l&ouml;schen. </strong>L&ouml;scht die &Auml;nderungen und
stellt die zuletzt gespeicherten Werte wieder her.
</li>

<li>
<strong>Auswahl l&ouml;schen. </strong>L&ouml;scht alle in den Tabellen auf dieser Registerseite
ausgew&auml;hlten Zellen.
</li>

<li>
<strong>Schlie&szlig;en. </strong>Verl&auml;sst den Dialog.  </li>

<li>
<strong>Festschreiben. </strong>Hebt alle Sperren, die durch eine vorbereitete Transaktion
aktiviert wurden, auf und erzwingt das Festschreiben der Transaktion.
</li>

<li>
<strong>Kopieren. </strong>Erstellt Kopien der ausgew&auml;hlten Anwendungsserver.</li>

<li>
<strong>Erstellen. </strong>Speichert die &Auml;nderungen auf allen
Registerseiten eines Dialogfensters und verl&auml;sst das Dialogfenster.
</li>

<li>
<strong>L&ouml;schen. </strong>L&ouml;scht die ausgew&auml;hlte Instanz.  </li>

<li>
<strong>Details. </strong>Zeigt die Einzelheiten einer Transaktion an. </li>

<li>
<strong>Fertig. </strong>Speichert die &Auml;nderungen auf allen
Registerseiten eines Dialogfensters und verl&auml;sst das Dialogfenster.
</li>

<li>
<strong>Nach unten. </strong>Bl&auml;ttert in einer Liste nach unten. </li>

<li>
<strong>Speicherauszug. </strong>Aktiviert einen Speicherauszug eines
Anwendungsservers, f&uuml;r den ein Tracing durchgef&uuml;hrt wurde. </li>

<li>
<strong>Bearbeiten. </strong>Erm&ouml;glicht Ihnen, das ausgew&auml;hlte Element in einer Liste zu
bearbeiten, oder ruft ein Dialogfenster zum Bearbeiten des Elements auf.
</li>

<li>
<strong>Exportieren. </strong>Ruft eine Seite zum Exportieren von EAR-Dateien f&uuml;r eine
Enterprise-Anwendung auf. </li>

<li>
<strong>DDL exportieren. </strong>Ruft eine Seite zum Exportieren von DDL-Dateien f&uuml;r eine
Enterprise-Anwendung auf. </li>

<li>
<strong>Schl&uuml;ssel exportieren. </strong>Exportiert LTPA-Schl&uuml;ssel in andere Dom&auml;nen. </li>

<li>
<strong>Filter. </strong>Ruft ein Dialogfenster auf, in dem Sie die Ressourcen, die in den
Tabellen auf dieser Registerseite angezeigt werden sollen, angeben k&ouml;nnen.
</li>

<li>
<strong>Fertig stellen. </strong>Erzwingt das Beenden einer Transaktion, unabh&auml;ngig davon, ob das
Ergebnis an alle teilnehmenden Anwendungen weitergegeben wurde.
</li>

<li>
<strong>Erster. </strong>Zeigt den ersten Datensatz in einer Serie von Datens&auml;tzen an.
</li>


<li>
<strong>Schl&uuml;ssel generieren. </strong>Generiert neue LTPA-Schl&uuml;ssel. Wenn die Sicherheitskomponente zum ersten
Mal aktiviert und LTPA als Authentifizierungsverfahren verwendet wird, werden die LTPA-Schl&uuml;ssel anhand
des in der Anzeige eingegebenen Kennworts automatisch generiert. Wenn neue Schl&uuml;ssel generiert werden m&uuml;ssen,
verwenden Sie diese Option, nachdem der Server bei aktivierter Sicherheitskomponente erneut gestartet wurde. 
Wenn Sie auf diese Schaltfl&auml;che klicken, werden die Schl&uuml;ssel generiert und an alle aktiven Server (Zelle,
Knoten und Anwendungsserver) weitergegeben. Die neuen Schl&uuml;ssel k&ouml;nnen zum Verschl&uuml;sseln und Entschl&uuml;sseln
der LTPA-Token verwendet werden. Klicken Sie in der Task-Leiste der Konsole auf
<strong>Speichern</strong>, um die neuen Schl&uuml;ssel und das Kennwort im Repository zu speichern. </li>

<li>
<strong>Sofort stoppen</strong> Stoppt den Server, aber umgeht den normalen Prozess zum Beenden des Servers, d. h.
anstehende Anforderungen werden nicht wie herk&ouml;mmlich abgeschlossen, bevor der Serverprozess beendet wird.
Dieser Beendigungsmodus ist schneller als der normale, aber einige Anwendungsclients
k&ouml;nnten Ausnahmen empfangen.
</li>

<li>
<strong>Schl&uuml;ssel importieren. </strong>Importiert neue LTPA-Schl&uuml;ssel aus anderen Dom&auml;nen. Wenn SSO (Single Sign-On) unter WebSphere in mehreren WebSphere-Dom&auml;nen (Zellen) verwendet werden soll,
m&uuml;ssen LTPA-Schl&uuml;ssel
und ein Kennwort von den Dom&auml;nen gemeinsam verwendet werden. Wenn Sie auf diese Schaltfl&auml;che klicken, nachdem
Sie die Schl&uuml;ssel aus einer der Zellen in eine Datei exportiert haben, werden die Schl&uuml;ssel auf alle aktiven
Server (Zelle, Knoten und Anwendungsserver) importiert. Die neuen Schl&uuml;ssel k&ouml;nnen zum Verschl&uuml;sseln und
Entschl&uuml;sseln des LTPA-Token verwendet werden. Klicken Sie in der Task-Leiste der Konsole auf
<strong>Speichern</strong>, um die neuen Schl&uuml;ssel und das Kennwort im Repository zu speichern. </li>

<li>
<strong>Installieren. </strong>Zeigt die Seite "Anwendungsinstallation vorbereiten" an, auf der
Sie eine Anwendung, eine EJB oder eine Webkomponente auf einem Anwendungsserver
implementieren (Deployment) k&ouml;nnen.
</li>

<li>
<strong>RAR installieren.</strong> Mit dieser Schaltfl&auml;che &ouml;ffnen Sie einen Dialog, um einen JCA-Connector zu installieren
und einen Ressourcenadapter f&uuml;r diesen Connector zu erstellen.
</li>

<li>
<strong>Transaktionen verwalten. </strong>Zeigt eine Liste aktiver Transaktionen an, die auf einem Server
ausgef&uuml;hrt werden. Sie
k&ouml;nnen das Beenden einer Transaktion erzwingen, deren Verarbeitung gestoppt wurde, weil eine
Transaktionsressource nicht verf&uuml;gbar ist. </li>

<li>
<strong>&Auml;ndern. </strong>&Ouml;ffnet ein Dialogfenster zum &Auml;ndern einer Spezifikation. </li>

<li>
<strong>Verschieben. </strong>Verschiebt die ausgew&auml;hlten Anwendungsserver in ein anderes Verzeichnis in
der Administrationszelle.
Geben Sie bei Aufforderung das Zielverzeichnis an.</li>

<li>
<strong>Neu. </strong>Zeigt eine Seite an, mit der Sie eine neue Instanz definieren k&ouml;nnen. 
Wenn Sie z. B. auf der Seite "Anwendungsserver" auf <strong>Neu</strong> klicken, wird eine
Seite aufgerufen, auf der Sie einen neuen Anwendungsserver konfigurieren k&ouml;nnen. </li>

<li>
<strong>N&auml;chste(r/s). </strong>Zeigt die n&auml;chste Seite, den n&auml;chsten Rahmen oder das n&auml;chste Element in einer
Folge an. </li>

<li>
<strong>OK. </strong>Speichert die &Auml;nderungen und verl&auml;sst die Seite. </li>

<li>
<strong>Ping. </strong>Versucht, eine Verbindung zu ausgew&auml;hlten Anwendungsservern herzustellen.  </li>

<li>
<strong>Vorherige (r/s). </strong>Zeigt die vorherige Seite, den vorherigen Rahmen oder das
vorherige Element in einer Folge an. </li>

<li>
<strong>Verlassen. </strong>Verl&auml;sst ein Dialogfenster und macht nicht gespeicherte &Auml;nderungen r&uuml;ckg&auml;ngig. </li>

<li>
<strong>Aktualisieren. </strong>Aktualisiert die Datenanzeige f&uuml;r Instanzen, die gegenw&auml;rtig
auf dieser Registerseite aufgelistet sind.
</li>


<li>
<strong>L&ouml;schen. </strong>L&ouml;scht das ausgew&auml;hlte Element. </li>


<li>
<strong>Zur&uuml;cksetzen. </strong>L&ouml;scht die &Auml;nderungen auf der Registerseite oder Seite und stellt die zuletzt
gespeicherten Werte wieder her. </li>

<li>
<strong>Erneut starten.</strong>Stoppt die ausgew&auml;hlten Anwendungsserver und
startet sie erneut. </li>


<li>
<strong>Neuen abrufen. </strong>Ruft einen neuen Datensatz ab. </li>

<li>
<strong>Speichern. </strong>Speichert die &Auml;nderungen, die Sie in Ihrer lokalen Konfiguration
vorgenommen haben, in der Master-Konfiguration. </li>

<li>
<strong>Ausw&auml;hlen. </strong>Erm&ouml;glicht Ihnen, bei der Ressourcenanalyse einen Bereich
auszuw&auml;hlen, in dem Ressourcen &uuml;berwacht werden k&ouml;nnen.</li>

<li>
<strong>Festlegen. </strong>Speichert die &Auml;nderungen, die Sie an
Einstellungen in einem Dialogfenster vorgenommen haben. </li>

<li>
<strong>Einstellungen. </strong>Ruft ein Dialogfenster auf, in dem
Sie
Ressourceneinstellungen f&uuml;r Servlets bearbeiten k&ouml;nnen. </li>

<li>
<strong>Verwendete Einstellungen. </strong>Ruft ein Dialogfenster auf, in dem die gegenw&auml;rtig
verwendeten Einstellungen angezeigt werden. </li>

<li>
<strong>Starten. </strong>Startet im Kontext von Anwendungsservern die ausgew&auml;hlten Anwendungsserver. Startet im
Kontext der Datenerfassung die Datenerfassung f&uuml;r die Tabellen auf dieser Registerseite. </li>

<li>
<strong>Stoppen. </strong>Stoppt im Kontext von Serverkomponenten, wie z. B. Anwendungsservern, die ausgew&auml;hlten
Serverkomponenten. Stoppt im Kontext der Datenerfassung die Datenerfassung f&uuml;r die Tabellen auf einer
Registerseite. </li>




<li>
<strong>Deinstallieren. </strong>L&ouml;scht eine implementierte Anwendung aus dem Konfigurations-Repository des
WebSphere Application Server. L&ouml;scht auch Bin&auml;rdateien von Anwendungen aus dem Dateisystem. </li>

<li>
<strong>Aktualisieren. </strong>Ersetzt eine Anwendung, die auf einem
Server implementiert wurde (Deployment), durch eine aktualisierte Anwendung. 
M&ouml;glicherweise m&uuml;ssen Sie bei der Aktualisierung Schritte auf den Seiten
"Anwendungsinstallation vorbereiten" und "Anwendung aktualisieren"
durchf&uuml;hren. </li>

<li>
<strong>Ressourcenliste aktualisieren. </strong>Aktualisiert die Daten in einer Tabelle.
Ermittelt neue Instanzen und f&uuml;gt sie der Tabelle hinzu. </li>




<li>
<strong>Anzeigen </strong>&Ouml;ffnet ein Dialogfenster in einer Datei. </li>

</ul>

</body>
</html>
