<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Einstellungen f&uuml;r Serversicherheit</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="usecrgswc"></a>
<h2>Einstellungen f&uuml;r Serversicherheit</h2>

<p>Auf dieser Seite k&ouml;nnen Sie die Sicherheitseinstellungen des Servers konfigurieren und
die globalen Sicherheitseinstellungen au&szlig;er Kraft setzen.
Falls Sie die globalen Standardeinstellungen f&uuml;r die Sicherheit wiederherstellen m&uuml;ssen, w&auml;hlen Sie in der
Administrationskonsole einfach das entsprechende Markierungsfeld ab.
</p>

<p>Klicken Sie zum Anzeigen dieser Seite der Administrationskonsole auf
<strong>Server</strong> &gt; <strong>Anwendungsserver</strong> &gt; <em>Servername</em> &gt; <strong>Serversicherheit</strong>. Diese Einstellungen
gelten nur f&uuml;r Network Deployment.</p>

<p>Sie k&ouml;nnen die Sicherheits f&uuml;r einzelne Anwendungsserver zwar inaktivieren, wenn die globale Sicherheit
aktiviert ist. aber Sie k&ouml;nnen die Sicherheitseinrichtung
f&uuml;r einen Anwendungsserver nicht aktivieren, wenn die globale Sicherheit inaktiviert ist. Wenn
die Sicherheit des Anwendungsserver f&uuml;r Benutzeranforderungen inaktiviert ist, bleibt die Sicherheit f&uuml;r
Administrations- und Namensservices f&uuml;r diesen Anwendungsserver weiterhin aktiviert, damit die
Administrations- und Namensinfrastruktur gesch&uuml;tzt ist.
Vergewissern Sie sich, dass die Sicherheit f&uuml;r Namensservices die Zugriffsberechtigung <strong>Jeder</strong>
f&uuml;r die Namensfunktion hat, die Sie im Benutzercode verwenden.
Sie m&uuml;ssen die administrative Sicherheit nicht konfigurieren, weil der Benutzercode nicht direkt auf die Administrationsfunktionen
zugreift.
Der Benutzercode greift &uuml;ber die unterst&uuml;tzten Scripting-Tools auf die Administrationsfunktionen zu.
</p>

<div>
<p>
<strong>Register "Konfiguration"</strong>
</p>
<dl>
<dt>
<strong><a name="ServerSecurity_overrideCellSecurity_description"></a>Sicherheit auf Serverebene</strong>
</dt>
<dd>Gibt an ob der Server die Zellenstandardwerte f&uuml;r die Sicherheit au&szlig;er Kraft setzen soll.

<p>Zum Wiederherstellen der Zellenstandardwerte f&uuml;r die Sicherheit auf Serverebene klicken Sie auf
<strong>Zellensicherheit verwenden</strong>. Klicken Sie auf <strong>Anwenden</strong> und w&auml;hlen Sie dann
<strong>Speichern</strong> aus, um die &Auml;nderungen auf Serverebene zu validieren.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Standardwert </td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ServerSecurity_overrideCellCSI_description"></a>CSI</strong>
</dt>
<dd>Gibt an ob der Server die Zellenstandardwerte f&uuml;r das CSI-Protokoll au&szlig;er Kraft setzen soll.

<p>Zum Wiederherstellen der Zellenstandardwerte f&uuml;r das Protokoll CSI klicken Sie auf
<strong>Zellen-CSI verwenden</strong> . Klicken Sie auf <strong>Anwenden</strong> und w&auml;hlen Sie dann
<strong>Speichern</strong> aus, um die &Auml;nderungen auf Serverebene zu validieren.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Standardwert </td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="ServerSecurity_overrideCellIBM_description"></a>SAS</strong>
</dt>
<dd>Gibt an ob der Server die Zellenstandardwerte f&uuml;r das Protokoll  au&szlig;er Kraft setzen soll.

<p>Zum Wiederherstellen der Zellenstandardwerte f&uuml;r das Protokoll SAS klicken Sie auf
<strong>Zellen-SAS verwenden</strong> . Klicken Sie auf <strong>Anwenden</strong> und w&auml;hlen Sie dann
<strong>Speichern</strong> aus, um die &Auml;nderungen auf Serverebene zu validieren.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Standardwert </td>
<td align="left" valign="top" class="base">False</td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Zugeh&ouml;rige Informationen</strong>
</p>
<a href="rcon_buttons.html">Kn&ouml;pfe in der Adminstrationskonsole</a>
<br>

<a href="rcon_pageusage.html">Funktionen auf den Seiten der Administrationskonsole</a>
<br>

<a href="rcon_scope.html">Geltungsbereichseinstellungen f&uuml;r die Administrationskonsole</a>
<br>

<a href="rcon_filter.html">Filtereinstellungen f&uuml;r die Administrationskonsole</a>
<br>

<a href="rcon_preferences.html">Vorgaben f&uuml;r die Administrationskonsole</a>
<br>

</div>
</body>
</html>
