<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Colecci&oacute;n de enlace de espacio de nombres</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="unam_rmanage_namespace"></a>
<h2>Colecci&oacute;n de enlace de espacio de nombres</h2>

<p>Utilice esta p&aacute;gina para configurar un enlace de nombre de un EJB, un NamingContext de CosNaming de CORBA, un objeto de nodo inferior CORBA, un objeto que se pueda buscar mediante JNDI o un valor de serie constante.</p>

<p>La informaci&oacute;n de enlace de los enlaces configurados se almacena en la configuraci&oacute;n y se aplica al arrancar el servidor de nombres de cada servidor en el &aacute;mbito del enlace.</p>

<p>Para ver la p&aacute;gina Gestionar valores de enlaces de espacio de
nombres, pulse <strong>Entorno &gt; Denominaci&oacute;n &gt; Enlaces de espacio de
nombres</strong>.</p>

<p>Pulse los recuadros de selecci&oacute;n para seleccionar uno o m&aacute;s de los usuarios que aparecen en la colecci&oacute;n.
 Utilice los botones para controlar los usuarios seleccionados.</p>

<dl>
<dt>
<strong><a name="NameSpaceBinding_name_description"></a>Nombre</strong>
</dt>
<dd>Muestra los nombres asignados para identificar de forma exclusiva estos enlaces configurados.</dd>
<dt>
<strong><a name="NameSpaceBinding_name_scope"></a>&Aacute;mbito</strong>
</dt>
<dd>Muestra el &aacute;mbito del enlace configurado. Este valor indica la ubicaci&oacute;n de configuraci&oacute;n del archivo <samp>namebindings.xml</samp>. Este campo se proporciona para fines informativos solamente y no se puede actualizar. 
 <p>Si el enlace configurado tiene un &aacute;mbito de c&eacute;lula, el contexto inicial es el contexto de ra&iacute;z persistente de c&eacute;lula. Si el enlace configurado tiene un &aacute;mbito de nodo, el contexto inicial es el contexto de ra&iacute;z persistente de nodo. Si el enlace configurado tiene un &aacute;mbito de servidor, el contexto inicial es el contexto de ra&iacute;z de servidor del servidor.</p>
</dd>
<dt>
<strong><a name="NameSpaceBinding_name_bindingtype"></a>Tipo de enlace</strong>
</dt>
<dd>Muestra el tipo de enlace configurado. Las posibles opciones son Serie, EJB, CORBA,
y Indirecto. Este campo se proporciona para fines informativos solamente y no se puede actualizar.</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

<a href="unam_rcorba_namespace.html">Valores de enlace de objeto CORBA</a>
<br>

<a href="unam_rejb_namespace.html">Valores de enlace EJB</a>
<br>

<a href="unam_rindirectlookup_namespace.html">Valores de enlace de b&uacute;squeda indirecta</a>
<br>

<a href="unam_rstring_namespace.html">Valores de enlace de serie</a>
<br>

</div>
</body>
</html>
