<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>&#29616;&#26102;&#26631;&#24535;&#21333;&#20803;&#32423;&#21035;&#23646;&#24615;</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="uwbs_noncecellprop"></a>
<h2>
<img alt="[Release 5.1 and later]" src="v51.gif" border="0">&#29616;&#26102;&#26631;&#24535;&#21333;&#20803;&#32423;&#21035;&#23646;&#24615;</h2>

<p>&#20351;&#29992;&#27492;&#39029;&#38754;&#22312; WebSphere Application Server Network Deployment &#29615;&#22659;&#20013;&#22312;&#21333;&#20803;&#32423;&#21035;&#19978;&#25351;&#23450;&#29616;&#26102;&#26631;&#24535;&#37197;&#32622;&#12290;</p>

<p>&#35201;&#26597;&#30475;&#27492;&#31649;&#29702;&#25511;&#21046;&#21488;&#39029;&#38754;&#65292;&#21333;&#20987;<strong>&#23433;&#20840;&#24615; &gt; Web &#26381;&#21153;
&gt; &#23646;&#24615;</strong>&#12290;</p>

<p>&#36890;&#36807;&#21333;&#20987;<strong>&#26381;&#21153;&#22120; &gt; &#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120; &gt; </strong><em>server_name</em> &#23450;&#20041;&#26381;&#21153;&#22120;&#31471;&#29616;&#26102;&#26631;&#24535;&#37197;&#32622;&#12290;&#22312;&ldquo;&#20854;&#23427;&#23646;&#24615;&rdquo;&#19979;&#65292;&#21333;&#20987; <strong>Web &#26381;&#21153;&#65306;Web &#26381;&#21153;&#23433;&#20840;&#24615;&#30340;&#32570;&#30465;&#32465;&#23450;</strong>&#12290;</p>

<p>
<img alt="[Release 5.1 and later]" src="v51.gif" border="0"><em>&#29616;&#26102;&#26631;&#24535;</em>&#26159;&#23884;&#20837;&#22312;&#28040;&#24687;&#20013;&#24110;&#21161;&#20572;&#27490;&#29992;&#25143;&#21517;&#26631;&#35760;&#37325;&#22797;&#26410;&#25480;&#26435;&#30340;&#25915;&#20987;&#30340;&#21807;&#19968;&#21152;&#23494;&#25968;&#23383;&#12290;&#22312; WebSphere Application Server Network Deployment &#29615;&#22659;&#20013;&#65292;&#24744;&#24517;&#39035;&#25351;&#23450;&#21333;&#20803;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#12289;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#21644;<strong>&#29616;&#26102;&#26631;&#24535;&#20559;&#31227;</strong>&#23383;&#27573;&#30340;&#20540;&#12290;</p>

<dl>
<dt>
<strong><a name="sec_cellnoncecachetimeout"></a>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>
</dt>
<dd>&#25351;&#23450;&#26381;&#21153;&#22120;&#19978;&#39640;&#36895;&#32531;&#23384;&#30340;&#29616;&#26102;&#26631;&#24535;&#30340;&#36229;&#26102;&#20540;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;&#29616;&#26102;&#26631;&#24535;&#26159;&#38543;&#26426;&#29983;&#25104;&#30340;&#20540;&#12290;
<p>&#24744;&#24517;&#39035;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#26368;&#23567; 300 &#31186;&#30340;&#20540;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 600 &#31186;&#12290;</p>

<p>&#21333;&#20803;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#22312; WebSphere Application Server Network Deployment &#29615;&#22659;&#20013;&#26159;&#24517;&#38656;&#30340;&#12290;</p>

<p>
<b>&#27880;: </b>&#22914;&#26524;&#24744;&#26356;&#25913;&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;&#20540;&#65292;&#21017;&#24744;&#24517;&#39035;&#37325;&#26032;&#21551;&#21160; WebSphere Application Server &#20197;&#20351;&#26356;&#25913;&#29983;&#25928;&#12290;</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#32570;&#30465;&#20540;</td>
<td align="left" valign="top" class="base">600 &#31186;</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#26368;&#23567;&#20540;</td>
<td align="left" valign="top" class="base">300 &#31186;</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="sec_cellnoncemaxage"></a>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>
</dt>
<dd>&#25351;&#23450;&#29616;&#26102;&#26631;&#24535;&#26102;&#38388;&#25139;&#35760;&#21040;&#26399;&#20043;&#21069;&#30340;&#26102;&#38388;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;&#29616;&#26102;&#26631;&#24535;&#26159;&#38543;&#26426;&#29983;&#25104;&#30340;&#20540;&#12290;
<p>&#24744;&#24517;&#39035;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#25351;&#23450;&#26368;&#23567; 300 &#31186;&#30340;&#20540;&#12290;&#28982;&#32780;&#65292;&#26368;&#22823;&#20540;&#19981;&#33021;&#36229;&#36807;&#22312;&#21333;&#20803;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#31186;&#25968;&#12290;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 300 &#31186;&#12290;&#24744;&#22312;&#27492;&#21333;&#20803;&#32423;&#21035;&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#20540;&#26159;&#24744;&#21487;&#20197;&#20026;&#26381;&#21153;&#22120;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#26368;&#22823;&#20540;&#12290;&#24744;&#21487;&#36890;&#36807;&#21333;&#20987;<strong>&#26381;&#21153;&#22120; &gt; &#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120;  &gt; </strong><em>server_name</em> &#25351;&#23450;&#26381;&#21153;&#22120;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#20540;&#12290;&#22312;&ldquo;&#20854;&#23427;&#23646;&#24615;&rdquo;&#19979;&#65292;&#21333;&#20987; <strong>Web &#26381;&#21153;&#65306;Web &#26381;&#21153;&#23433;&#20840;&#24615;&#30340;&#32570;&#30465;&#32465;&#23450;</strong>&#12290;</p>

<p>&#21333;&#20803;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#22312; WebSphere Application Server Network Deployment &#29615;&#22659;&#20013;&#26159;&#24517;&#38656;&#30340;&#12290;</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#32570;&#30465;&#20540;</td>
<td align="left" valign="top" class="base">300 &#31186;</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#33539;&#22260;</td>
<td align="left" valign="top" class="base">300 &#21040;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#31186;&#25968;</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="sec_nonceclockskew"></a>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>
</dt>
<dd>&#25351;&#23450;&#24403; WebSphere Application Server &#26816;&#26597;&#28040;&#24687;&#26032;&#40092;&#24230;&#26102;&#35201;&#32771;&#34385;&#30340;&#26102;&#38047;&#20559;&#31227;&#20540;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;&#29616;&#26102;&#26631;&#24535;&#26159;&#38543;&#26426;&#29983;&#25104;&#30340;&#20540;&#12290;
<p>&#24744;&#24517;&#39035;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>&#23383;&#27573;&#25351;&#23450;&#26368;&#23567; 0 &#31186;&#30340;&#20540;&#12290;&#28982;&#32780;&#65292;&#26368;&#22823;&#20540;&#19981;&#33021;&#36229;&#36807;&#22312;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#21333;&#20803;&#32423;&#21035;&#23383;&#27573;&#20013;&#25351;&#23450;&#30340;&#31186;&#25968;&#12290;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 0 &#31186;&#12290;</p>

<p>&#21333;&#20803;&#32423;&#21035;&#30340;<strong>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>&#23383;&#27573;&#22312; WebSphere Application Server Network Deployment &#29615;&#22659;&#20013;&#26159;&#24517;&#38656;&#30340;&#12290;</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#32570;&#30465;&#20540;</td>
<td align="left" valign="top" class="base">0 &#31186;</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">&#33539;&#22260;</td>
<td align="left" valign="top" class="base">0 &#21040;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#31186;&#25968;</td>

</tr>

</table>

</dd>
</dl>
<div>
<p>
<strong>&#30456;&#20851;&#20449;&#24687;</strong>
</p>
<a href="uwbs_websvcb.html">Web &#26381;&#21153;&#65306;Web &#26381;&#21153;&#23433;&#20840;&#24615;&#38598;&#21512;&#30340;&#32570;&#30465;&#32465;&#23450;</a>
<br>

<a href="uwbs_logmapn.html">&#30331;&#24405;&#26144;&#23556;&#37197;&#32622;&#35774;&#32622;</a>
<br>

</div>
</body>
</html>
