<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection d'adaptateurs de ressources</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="manage_resource_adapters"></a>
<h2>Collection d'adaptateurs de ressources</h2>

<p>Utilisez cette page pour s&eacute;lectionner un adaptateur de ressources, lequel repr&eacute;sente
un fichier archive contenant le code qui impl&eacute;mente une biblioth&egrave;que pour la connexion
&agrave; un syst&egrave;me d'information d'entreprise dorsal tel que CICS, SAP ou PeopleSoft. </p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>Ressources</strong> &gt;<strong>Adaptateurs
de ressources</strong>.</p>

<dl>
<dt>
<strong><a name="J2CResourceAdapter_description"></a>Nom</strong>
</dt>
<dd>Liste des adaptateurs de ressources disponibles.
<p>Ces adaptateurs de ressources peuvent &ecirc;tre fournis par une soci&eacute;t&eacute; tierce
(autre qu'IBM). En g&eacute;n&eacute;ral, un adaptateur donn&eacute; ne peut se connecter qu'&agrave; un seul type de syst&egrave;me dorsal
(EIS), mais il peut accepter de nombreuses configurations diff&eacute;rentes pour les connexions &agrave; ce syst&egrave;me. L'adaptateur de ressources poss&egrave;de de nombreuses propri&eacute;t&eacute;s de configuration qui sont d&eacute;finies dans la sp&eacute;cification J2C. Les valeurs de ces propri&eacute;t&eacute;s sont configur&eacute;es par la soci&eacute;t&eacute; fournissant l'adaptateur. </p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">String (cha&icirc;ne)</td>

</tr>

</table>

</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_pageusage.html">Caract&eacute;ristiques de la page de la console d'administration</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

<a href="udat_manresaddet.html">Param&egrave;tres d'adaptateur de ressources</a>
<br>

</div>
</body>
</html>
