<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres des
sessions de messagerie</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="ujtc_rjmsi"></a>
<h2>Param&egrave;tres des
sessions de messagerie</h2>

<p>Cette page permet de configurer des fournisseurs de
messagerie sp&eacute;cifiques.</p>

<p>Pour afficher la page de la console d'administration, cliquez sur <strong>Ressources</strong> &gt; <strong>Fournisseurs JavaMail
</strong> &gt; <em>nom_fournisseur_messagerie</em> &gt; <strong>Sessions JavaMail</strong> &gt; <em>nom_session_messagerie</em>.</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="MailSession_name_description"></a>Nom</strong>
</dt>
<dd>Indique le nom d'administration de l'objet session JavaMail.</dd>
<dt>
<strong><a name="MailSession_jndiName_description"></a>Nom JNDI</strong>
</dt>
<dd>Indique le nom JNDI (Java Naming and Directory Interface) pour la ressource, y compris
les sous-contextes de nommage.
<p>Ce nom sert de lien entre les informations de liaison de la plateforme pour les
ressources d&eacute;finies dans le descripteur de d&eacute;ploiement des applications du client et les
ressources r&eacute;elles confin&eacute;es dans JNDI par la plateforme.</p>

</dd>
<dt>
<strong><a name="MailSession_description_description"></a>Description</strong>
</dt>
<dd> Sp&eacute;cifie une description facultative des enregistrements d'administration.</dd>
<dt>
<strong><a name="MailSession_category_description"></a>Cat&eacute;gorie</strong>
</dt>
<dd>Sp&eacute;cifie une collection facultative permettant de classer ou de regrouper des sessions. </dd>
<dt>
<strong><a name="MailSession_mailTransportHost_description"></a>H&ocirc;te de transfert de courrier</strong>
</dt>
<dd>Sp&eacute;cifie le serveur activ&eacute; lors de l'envoi de courrier.</dd>
<dt>
<strong><a name="MailSession_mailTransportProtocol_description"></a>Protocole de transfert de courrier</strong>
</dt>
<dd>Indique le protocole de transfert utilis&eacute; lors de l'envoi
de courrier. </dd>
<dt>
<strong><a name="MailSession_mailTransportUser_description"></a>Utilisateur de transfert de courrier</strong>
</dt>
<dd> Indique l'ID utilisateur &agrave; utiliser lorsque
l'h&ocirc;te de transfert du courrier requiert une authentification.
<p>Ce param&egrave;tre n'est g&eacute;n&eacute;ralement pas utilis&eacute; pour la
plupart des serveurs de messagerie. Vous pouvez laisser cette zone vide sauf
si vous utilisez un serveur de messagerie qui
requiert un ID utilisateur et un mot de passe.</p>

</dd>
<dt>
<strong><a name="MailSession_mailTransportPassword_description"></a>Mot de passe de transfert de courrier</strong>
</dt>
<dd> Indique le mot de passe &agrave; utiliser lorsque l'h&ocirc;te de
transfert du courrier requiert une authentification.
<p>Ce param&egrave;tre n'est g&eacute;n&eacute;ralement pas utilis&eacute; pour la
plupart des serveurs de messagerie. Vous pouvez laisser cette zone
vide sauf si vous utilisez un serveur de messagerie qui
requiert un ID utilisateur et un mot de passe. </p>

</dd>
<dt>
<strong><a name="MailSession_mailFrom_description"></a>Courrier de</strong>
</dt>
<dd>Indique l'&eacute;metteur du courrier.
<p>Cette valeur repr&eacute;sente une adresse &eacute;lectronique Internet qui, par
d&eacute;faut, affiche le message re&ccedil;u sous forme d'adresse <samp>De</samp> ou
<samp>R&eacute;pondre &agrave;</samp>.
La r&eacute;ponse du destinataire aboutit &agrave; cette adresse.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStoreHost_description"></a>H&ocirc;te de stockage de courrier</strong>
</dt>
<dd>Indique le serveur activ&eacute; lors de la r&eacute;ception de courrier.
<p>Combin&eacute; &agrave; l'ID utilisation de stockage de courrier et au mot de passe, ce param&egrave;tre repr&eacute;sente un compte de messagerie correct. Par exemple, si le compte de messagerie est <em>john_william@mon.entreprise.com</em>, l'h&ocirc;te de stockage de courrier est <em>mon.entreprise.com</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStoreProtocol_description"></a>Protocole de stockage de courrier</strong>
</dt>
<dd>Indique le protocole utilis&eacute; lors de la r&eacute;ception de courrier ; il peut s'agir d'IMAP, de POP3 ou de tout
protocole de stockage pour lequel l'utilisateur a install&eacute; un fournisseur.</dd>
<dt>
<strong><a name="MailSession_mailStoreUser_description"></a>Utilisateur de stockage de courrier</strong>
</dt>
<dd>Indique l'ID utilisateur du compte de messagerie donn&eacute;.
<p>Par exemple, si le compte de messagerie est <em>john_william@mon.entreprise.com</em>, l'utilisateur est <em>john_william</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStorePassword_description"></a>Mot de passe de stockage de courrier</strong>
</dt>
<dd>Indique le mot de passe du compte de messagerie donn&eacute;.
<p>Par exemple, si le compte de messagerie est <em>john_william@mon.entreprise.com</em>, entrez le mot de passe correspondant &agrave; l'ID <em>john_william</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_debug_description"></a>D&eacute;bogage</strong>
</dt>
<dd>Active et d&eacute;sactive le mode de d&eacute;bogage pour cette session de messagerie.</dd>
</dl>
</div>
</body>
</html>
