<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de fournisseurs de protocoles</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="ujtc_rprot"></a>
<h2>Collection de fournisseurs de protocoles</h2>

<p>Cette page permet de s&eacute;lectionner ou d'ajouter un nouveau fournisseur de protocole afin d'interagir avec les API JavaMail et les serveurs de messagerie s'ex&eacute;cutant sur desprotocoles li&eacute;s. Par exemple, le protocole SMTP (Simple Mail Transfer Protocol) est un protocole de transfert couramment
utilis&eacute; pour envoyer du courrier. Les applications JavaMail peuvent se connecter &agrave; un serveur SMTP et envoyer du courrier
par son interm&eacute;diaire, &agrave; l'aide du fournisseur de protocoles.</p>

<p>Pour afficher la page de la console d'administration, cliquez sur <strong>Ressources</strong>
&gt; <strong>Fournisseurs JavaMail </strong> &gt; <em>nom_fournisseur_messagerie</em> &gt;
<strong>Fournisseurs de protocole</strong>. </p>

<dl>
<dt>
<strong><a name="ProtocolProvider_protocol_description"></a>Protocole</strong>
</dt>
<dd>Sp&eacute;cifie la configuration du fournisseur de protocole pour un protocole donn&eacute;.</dd>
<dt>
<strong><a name="ProtocolProvider_classname_description"></a>Nom de classe</strong>
</dt>
<dd>Indique la classe d'impl&eacute;mentation du fournisseur de
protocoles sp&eacute;cifique (&eacute;galement connu sous le nom de fournisseur de
services JavaMail).  </dd>
<dt>
<strong><a name="ProtocolProvider_classpath_description"></a>Chemin d'acc&egrave;s aux classes</strong>
</dt>
<dd>Indique le chemin d'acc&egrave;s &agrave; la classe d'impl&eacute;mentation du
fournisseur de protocoles sp&eacute;cifique (&eacute;galement connu sous le nom de
fournisseur de services JavaMail). </dd>
<dt>
<strong><a name="ProtocolProvider_type_description"></a>Type </strong>
</dt>
<dd>Indique le type de fournisseur de protocoles.  Les options correctes sont <strong>Stockage</strong> et <strong>Transfert</strong>.</dd>
</dl>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="umai_rprov.html">Param&egrave;tres des fournisseurs de protocole</a>
<br>

<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
