<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Param&egrave;tres de rubriques WebSphere</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="WASTopic"></a>
<h2>Param&egrave;tres de rubriques WebSphere</h2>

<p>Utilisez cet &eacute;cran pour afficher ou modifier les propri&eacute;t&eacute;s de
configuration de la destination de rubriques s&eacute;lectionn&eacute;e pour une utilisation
avec le fournisseur JMS WebSphere int&eacute;gr&eacute;.</p>

<p>Une destination de rubrique permet de configurer les propri&eacute;t&eacute;s d'une rubrique JMS du
fournisseur JMS associ&eacute;. Les connexions &agrave; la rubrique sont cr&eacute;&eacute;es par la fabrique de
connexions de rubrique associ&eacute;e. Une rubrique destin&eacute;e &agrave; une utilisation avec le fournisseur JMS WebSphere int&eacute;gr&eacute; comporte les propri&eacute;t&eacute;s suivantes.</p>

<p>Pour afficher cette page de la console d'administration, cliquez sur <strong>Ressources-&gt; Fournisseur WebSphere
JMS-&gt; (Dans la sous-fen&ecirc;tre de contenu, sous les propri&eacute;t&eacute;s additionnelles) Destinations de rubrique
WebSphere-&gt; <em>nom_destination</em></strong>
</p>

<div>
<p>
<strong>Onglet Configuration</strong>
</p>
<dl>
<dt>
<strong><a name="WASTopic_contextId"></a>Port&eacute;e</strong>
</dt>
<dd>Indique &agrave; quel niveau cette d&eacute;finition de ressource est visible :
cellule, noeud ou serveur.
<p>Des ressources telles que les fournisseurs JMS, les liaisons d'espace de noms et les biblioth&egrave;ques partag&eacute;es
peuvent &ecirc;tre d&eacute;finies &agrave; plusieurs niveaux. Dans ce cas, pour une ressource donn&eacute;e, la d&eacute;finition figurant au
niveau le plus sp&eacute;cifique (par exemple, le serveur) l'emporte sur l'&eacute;ventuelle d&eacute;finition homologue figurant &agrave;
un niveau plus g&eacute;n&eacute;ral (par exemple, la cellule). </p>

<p>Notez que quelle que soit la port&eacute;e d'une ressource d&eacute;finie, les propri&eacute;t&eacute;s de cette
ressource s'appliquent uniquement au niveau d'un serveur individuel. Par exemple, si vous
d&eacute;finissez la port&eacute;e d'une source de donn&eacute;es au niveau cellule, tous les utilisateurs de
cette cellule peuvent rechercher et utiliser cette source de donn&eacute;es, laquelle est unique
au sein de cette cellule. Cependant, les propri&eacute;t&eacute;s de la ressource sont locales
&agrave; chaque serveur de la cellule. Par exemple, si vous attribuez la valeur 10
&agrave; la propri&eacute;t&eacute; <strong>Nombre maximal de connexions</strong>, chaque serveur de cette cellule pourra
avoir 10 connexions.<dl>
<dt>
<strong>Cellule</strong>
</dt>
<dd>Niveau de port&eacute;e le plus g&eacute;n&eacute;ral. Les ressources d&eacute;finies au niveau cellule
sont visibles depuis tous les noeuds et serveurs de cette cellule, sauf si elles sont red&eacute;finies
&agrave; un niveau inf&eacute;rieur. Pour visualiser les ressources d&eacute;finies au niveau cellule, ne sp&eacute;cifiez pas
de nom de serveur ni de nom de noeud dans le formulaire de s&eacute;lection de port&eacute;e.</dd>
<dt>
<strong>Noeud</strong>
</dt>
<dd>Port&eacute;e par d&eacute;faut de la plupart des types de ressources. Les ressources d&eacute;finies
au niveau noeud l'emportent sur les &eacute;ventuelles d&eacute;finitions homologues figurant au niveau cellule
et sont visibles depuis tous les serveurs du noeud consid&eacute;r&eacute;, sauf si elles sont red&eacute;finies &agrave; un niveau
serveur sur ce noeud. Pour visualiser les ressources d&eacute;finies au niveau d'un noeud, ne sp&eacute;cifiez pas de
serveur dans le formulaire de s&eacute;lection de port&eacute;e ; sp&eacute;cifiez simplement le nom du noeud concern&eacute;.</dd>
<dt>
<strong>Serveur</strong>
</dt>
<dd>Niveau de port&eacute;e le plus sp&eacute;cifique pour la d&eacute;finition des ressources. Les ressources
d&eacute;finies au niveau d'un serveur l'emportent sur les &eacute;ventuelles d&eacute;finitions homologues apparaissant au niveau
de la cellule parente ou du noeud parent ; elles sont visibles uniquement
depuis ce serveur. Pour visualiser les ressources d&eacute;finies au niveau d'un serveur, sp&eacute;cifiez le nom de ce
serveur ainsi que celui de son noeud parent dans le formulaire de s&eacute;lection de port&eacute;e.</dd>
</dl>
</p>

<p>Lorsque des ressources sont cr&eacute;&eacute;es, elles le sont toujours dans la port&eacute;e en cours,
c'est-&agrave;-dire celle qui est s&eacute;lectionn&eacute;e dans le formulaire. Pour afficher les ressources d'autres port&eacute;es,
sp&eacute;cifiez un noeud ou un serveur diff&eacute;rent dans le formulaire de s&eacute;lection de port&eacute;e.  </p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_name"></a>Nom</strong>
</dt>
<dd>Nom sous lequel cette file d'attente est connue pour l'administration d'IBM WebSphere
Application Server.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_jndiName"></a>Nom JNDI</strong>
</dt>
<dd>Nom JNDI utilis&eacute; pour lier la rubrique &agrave; l'espace nom du serveur d'applications.
<p>Par convention, utilisez le nom JNDI complet, par exemple sous la forme jms/<em>Nom</em>, <em>Nom</em>
correspondant au nom logique de la ressource.</p>

<p>Ce nom est utilis&eacute; pour lier les informations relatives &agrave; la
liaison des plateformes. La liaison associe les ressources d&eacute;finies dans le descripteur de d&eacute;ploiement du
module aux ressources r&eacute;elles (physiques) li&eacute;es sous JNDI par la plateforme.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_description"></a>Description</strong>
</dt>
<dd>Description de la rubrique dans le cadre de l'administration d'IBM WebSphere
Application Server.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">Null</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_category"></a>Cat&eacute;gorie</strong>
</dt>
<dd>Cat&eacute;gorie utilis&eacute;e pour classer ou grouper cette rubrique dans le cadre de
l'administration d'IBM WebSphere Application Server.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_topicName"></a>Rubrique</strong>
</dt>
<dd>Le nom de la rubrique telle que d&eacute;finie pour le fournisseur JMS.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Cha&icirc;ne</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">Null</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">La valeur de la rubrique peut &ecirc;tre en notation d&eacute;cimale et comporter des caract&egrave;res g&eacute;n&eacute;riques. </td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_persistence"></a>Persistance</strong>
</dt>
<dd>Indique si tous les messages envoy&eacute;s vers la destination sont
persistants, non-persistants ou ont leur persistance d&eacute;finie par
l'application
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Enum&eacute;ration</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">DEFINI PAR L'APPLICATION</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">
<dl>
<dt>
<strong>DEFINI PAR L'APPLICATION</strong>
</dt>
<dd>La persistance pour les messages de cette destination
est d&eacute;finie par l'application qui les placent dans la file.</dd>
<dt>
<strong>NON-PERSISTANT</strong>
</dt>
<dd>Les messages de cette destination ne sont pas persistants.</dd>
<dt>
<strong>PERSISTANT</strong>
</dt>
<dd>Les messages de cette destination sont persistants.</dd>
<dt>
<strong>DEFINI PAR LA FILE D'ATTENTE</strong>
</dt>
<dd>[Destination WebSphere MQ uniquement] La persistance des messages de cette destination est d&eacute;finie par les propri&eacute;t&eacute;s de d&eacute;finition de la file d'attente WebSphere MQ.</dd>
</dl>
</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_priority"></a>Priorit&eacute;</strong>
</dt>
<dd>Indique si la priorit&eacute; du message de cette destination
est d&eacute;finie par l'application ou par la propri&eacute;t&eacute; <strong>Priorit&eacute; sp&eacute;cifi&eacute;e</strong>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Enum&eacute;ration</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unit&eacute;</td>
<td align="left" valign="top" class="base">Non applicable</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">DEFINI PAR L'APPLICATION</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">
<dl>
<dt>
<strong>DEFINI PAR L'APPLICATION</strong>
</dt>
<dd>La priorit&eacute; des messages de cette destination est
d&eacute;finie par l'application qui les place sur cette destination.</dd>
<dt>
<strong>DEFINI PAR LA FILE D'ATTENTE</strong>
</dt>
<dd>[Destination WebSphere MQ uniquement] La persistance des messages de cette destination est d&eacute;finie par les propri&eacute;t&eacute;s de d&eacute;finition de la file d'attente WebSphere MQ.</dd>
<dt>
<strong>SPECIFIE</strong>
</dt>
<dd>La priorit&eacute; des messages de cette destination est d&eacute;finie par la propri&eacute;t&eacute;
<strong>Priorit&eacute; sp&eacute;cifi&eacute;e</strong>.<em>Si vous s&eacute;lectionnez cette option, vous devez d&eacute;finir une priorit&eacute; pour la propri&eacute;t&eacute; <strong>Priorit&eacute; sp&eacute;cifi&eacute;e</strong>.</em>
</dd>
</dl>
</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_specifiedPriority"></a>Priorit&eacute; sp&eacute;cifi&eacute;e</strong>
</dt>
<dd>Si la propri&eacute;t&eacute; <strong>Priorit&eacute;</strong> a la valeur
<samp>Sp&eacute;cifi&eacute;e</samp>, saisissez ici la priorit&eacute; des messages de cette file d'attente, de 0
(la plus faible) &agrave; 9 (la plus &eacute;lev&eacute;e)
<p>Si la propri&eacute;t&eacute; <strong>Priorit&eacute;</strong> a la valeur <samp>Sp&eacute;cifi&eacute;e</samp>, les messages envoy&eacute;s dans
cette file d'attente ont le niveau de priorit&eacute; indiqu&eacute; par cette propri&eacute;t&eacute;.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Entier</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unit&eacute;</td>
<td align="left" valign="top" class="base">Niveau de priorit&eacute; des messages</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">0</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">0 (priorit&eacute; la plus faible) &agrave; 9 (priorit&eacute; la plus &eacute;lev&eacute;e)</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_expiry"></a>Expiration</strong>
</dt>
<dd>Indique si le d&eacute;lai d'expiration de cette file d'attente est d&eacute;finie par l'application ou la propri&eacute;t&eacute; <strong>Expiration sp&eacute;cifi&eacute;e</strong> ou si les messages figurant dans la file d'attente n'expirent jamais (ont un d&eacute;lai d'expiration illimit&eacute;)
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Enum&eacute;ration</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unit&eacute;</td>
<td align="left" valign="top" class="base">Non applicable</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">DEFINI PAR L'APPLICATION</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">
<dl>
<dt>
<strong>DEFINI PAR L'APPLICATION</strong>
</dt>
<dd>Le d&eacute;lai d'expiration pour les messages de cette file est d&eacute;fini par l'application qui les placent sur la file.</dd>
<dt>
<strong>ILLIMITE</strong>
</dt>
<dd>Les messages sur cette file d'attente n'ont pas de d&eacute;lai
d'expiration, par cons&eacute;quent les messages ne sont jamais supprim&eacute;s.</dd>
<dt>
<strong>SPECIFIE</strong>
</dt>
<dd>Le d&eacute;lai d'expiration des messages de cette file d'attente est d&eacute;fini par la propri&eacute;t&eacute; <strong>Expiration sp&eacute;cifi&eacute;e</strong>. <em>Si vous s&eacute;lectionnez cette option, vous devez d&eacute;finir un d&eacute;lai d'expiration dans la propri&eacute;t&eacute; <strong>Expiration sp&eacute;cifi&eacute;e</strong>.</em>
</dd>
</dl>
</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="WASTopic_specifiedExpiry"></a>Expiration sp&eacute;cifi&eacute;e</strong>
</dt>
<dd>Si la propri&eacute;t&eacute; du <strong>d&eacute;lai d'expiration</strong> a pour valeur
<samp>Sp&eacute;cifi&eacute;e</samp>, saisissez ici le d&eacute;lai en millisecondes (sup&eacute;rieur &agrave; 0) &agrave; l'&eacute;ch&eacute;ance duquel les messages figurant dans cette file d'attente expirent
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Type de donn&eacute;es</td>
<td align="left" valign="top" class="base">Entier</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Unit&eacute;</td>
<td align="left" valign="top" class="base">Millisecondes</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valeur par d&eacute;faut</td>
<td align="left" valign="top" class="base">0</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Plage</td>
<td align="left" valign="top" class="base">Sup&eacute;rieur ou &eacute;gal &agrave; 0 <ul>

<li>0 indique que les messages n'arrivent jamais &agrave; expiration.</li>

<li>Les autres valeurs sont des nombres entiers indiquant le nombre de millisecondes</li>

</ul> 
</td>

</tr>

</table>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

</div>
</body>
</html>
