<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Collection de fabriques de connexions JMS</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="J2EEResourceProvider_factories_JMSConnectionFactory"></a>
<h2>Collection de fabriques de connexions JMS</h2>

<p>Fabriques de connexions JMS configur&eacute;es dans le fournisseur JMS associ&eacute; pour la messagerie point &agrave; point et par publication/abonnement. Utilisez cet &eacute;cran pour cr&eacute;er ou supprimer des fabriques de connexions JMS
ou pour s&eacute;lectionner une fabrique de connexions afin d'afficher ou de
modifier ses propri&eacute;t&eacute;s de configuration.</p>

<p>Cet &eacute;cran affiche une liste des fabriques de connexions JMS g&eacute;n&eacute;riques avec
un r&eacute;sum&eacute; de leurs propri&eacute;t&eacute;s de configuration.</p>

<p>Pour afficher cette page, effectuez les &eacute;tapes
suivantes sur la console administrative  :<ol>

<li>Dans la sous-fen&ecirc;tre de navigation, d&eacute;veloppez <strong>Ressources-&gt; Fournisseurs JMS g&eacute;n&eacute;riques</strong>
</li>

<li>Dans la sous-fen&ecirc;tre de contenu, s&eacute;lectionnez le fournisseur JMS devant prendre en charge la fabrique de connexions JMS.</li>

<li>Dans la liste de propri&eacute;t&eacute;s additionnelles du volet de contenu,
s&eacute;lectionnez l'option de fabrique de connexions JMS g&eacute;n&eacute;rique.</li>

</ol>
</p>

<p>Pour afficher ou modifier les
<a href="umj_pjcfp.html">propri&eacute;t&eacute;s
d'une fabrique de connexions JMS</a>, s&eacute;lectionnez son nom dans la liste
affich&eacute;e.</p>

<p>Pour agir sur une ou plusieurs des fabriques de connexions JMS affich&eacute;es, cochez les
cases &agrave; c&ocirc;t&eacute; des noms de ces objets, puis utilisez les <a href="rcon_buttons.html">Boutons de la console administrative</a> fournis.</p>

<div>
<p>
<strong>Informations connexes</strong>
</p>
<a href="umj_pjcfp.html">Param&egrave;tres de fabrique de connexions JMS g&eacute;n&eacute;rique</a>
<br>

<a href="rcon_buttons.html">Boutons de la console administrative</a>
<br>

<a href="rcon_scope.html">Param&egrave;tres de la port&eacute;e de la console administrative</a>
<br>

<a href="rcon_filter.html">Param&egrave;tres de filtrage de la console administrative</a>
<br>

<a href="rcon_preferences.html">Param&egrave;tres des pr&eacute;f&eacute;rences de la console administrative</a>
<br>

</div>
</body>
</html>
