<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Botones de la
consola administrativa</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="rrun_buttons"></a>
<h2>Botones de la
consola administrativa</h2>

<p>Las opciones de botones siguientes est&aacute;n disponibles en varias p&aacute;ginas de la
consola administrativa, seg&uacute;n las funciones del producto que haya habilitadas.</p>

<ul>

<li>
<strong>Interrumpir. </strong>Termina anormalmente una transacci&oacute;n que a&uacute;n no est&aacute; en
estado preparada. Todas las operaciones que la transacci&oacute;n ha completado se deshacen.</li>

<li>
<strong>A&ntilde;adir. </strong>A&ntilde;ade el elemento tecleado o seleccionado a una lista,
o abre un di&aacute;logo para a&ntilde;adir un elemento a una lista.</li>


<li>
<strong>Aplicar. </strong>Guarda los cambios en una p&aacute;gina sin salir de la p&aacute;gina.</li>

<li>
<strong>Atr&aacute;s. </strong>Visualiza la p&aacute;gina anterior o bien el elemento
anterior de una secuencia.  Tenga en cuenta que la consola administrativa no da soporte al uso de los botones Atr&aacute;s y Adelante de un navegador. La utilizaci&oacute;n de estos botones puede ocasionar problemas intermitentes. En su lugar, utilice los botones Atr&aacute;s o Cancelar de los paneles de la consola administrativa.</li>

<li>
<strong>Examinar. </strong>Abre un di&aacute;logo que permite buscar un archivo en el sistema.</li>

<li>
<strong>Cancelar. </strong>Sale del di&aacute;logo o de la p&aacute;gina actual, sin guardar los cambios realizados.
 Tenga en cuenta que la consola administrativa no da soporte al uso de los botones Atr&aacute;s y Adelante de un navegador. La utilizaci&oacute;n de estos botones puede ocasionar problemas intermitentes. En su lugar, utilice el bot&oacute;n Cancelar de los paneles de la consola
administrativa.</li>

<li>
<strong>Cambiar. </strong>En el contexto de seguridad, permite buscar el registro de usuario para un
id. de usuario de una aplicaci&oacute;n en la que ejecute.
En el contexto de propiedades de contenedor, permite cambiar el origen de datos del
contenedor que se est&aacute; utilizando.</li>

<li>
<strong>Borrar. </strong>Borra los cambios y restaura los &uacute;ltimos valores
guardados.</li>

<li>
<strong>Borrar selecci&oacute;n. </strong>Borra cualquier selecci&oacute;n de c&eacute;lulas de las
tablas de esta p&aacute;gina con pesta&ntilde;as.</li>

<li>
<strong>Cerrar. </strong>Sale del recuadro de di&aacute;logo.</li>

<li>
<strong>Comprometer. </strong>Libera todos los bloqueos que manten&iacute;a una transacci&oacute;n preparada y
fuerza el compromiso de la transacci&oacute;n.</li>

<li>
<strong>Copiar. </strong>Crea copias de los servidores de aplicaciones seleccionados.</li>

<li>
<strong>Crear. </strong>Guarda los cambios de todas las p&aacute;ginas con pesta&ntilde;as de un di&aacute;logo y sale
del mismo.</li>

<li>
<strong>Suprimir. </strong>Elimina la instancia seleccionada.</li>

<li>
<strong>Detalles. </strong>Muestra los detalles de una transacci&oacute;n. </li>

<li>
<strong>Hecho. </strong>Guarda los cambios de todas las p&aacute;ginas con pesta&ntilde;as de un di&aacute;logo y sale
del mismo.</li>

<li>
<strong>Abajo. </strong>Se desplaza en la lista hacia abajo.</li>

<li>
<strong>Volcado. </strong>Activa un volcado de un servidor de aplicaciones del
que se hace un rastreo.</li>

<li>
<strong>Editar. </strong>Permite editar el elemento seleccionado de la lista o abre un recuadro de
di&aacute;logo para editar dicho elemento.</li>

<li>
<strong>Exportar. </strong>Accede a una p&aacute;gina para exportar archivos EAR para una aplicaci&oacute;n de empresa.</li>

<li>
<strong>Exportar DDL. </strong>Accede a una p&aacute;gina para exportar archivos DDL para una aplicaci&oacute;n de empresa.</li>

<li>
<strong>Exportar claves. </strong>Exporta las claves LTPA a otros dominios.</li>

<li>
<strong>Filtrar. </strong>Abre un recuadro de di&aacute;logo para especificar los recursos a visualizar en
las tablas de esta p&aacute;gina con pesta&ntilde;as.</li>

<li>
<strong>Finalizar. </strong>Fuerza la finalizaci&oacute;n de una transacci&oacute;n, independientemente de si se
ha informado del resultado a todas las aplicaciones implicadas.</li>

<li>
<strong>Primero. </strong>Visualiza el primer registro de una serie de registros.</li>


<li>
<strong>Generar claves. </strong>Genera nuevas claves LTPA. Cuando se activa la seguridad por
primera vez con LTPA como mecanismo de autenticaci&oacute;n, las claves LTPA se generan
autom&aacute;ticamente con la contrase&ntilde;a entrada en este panel. Si hay que generar claves nuevas,
utilizar este bot&oacute;n despu&eacute;s de haber hecho copia de seguridad del servidor con la
seguridad activada.  Al pulsar este bot&oacute;n se generan las claves y se propagan a todos
los servidores activos (c&eacute;lula, nodo y servidores de aplicaci&oacute;n). Las claves nuevas se
pueden utilizar para cifrar y descifrar s&iacute;mbolos LTPA. Pulse <strong>Guardar</strong> en la barra de
tareas de la consola para guardar las claves nuevas y la contrase&ntilde;a en
el dep&oacute;sito.</li>

<li>
<strong>Detenci&oacute;n inmediata. </strong> Detiene el servidor, pero no utiliza el proceso normal de
inmovilizaci&oacute;n del servidor que permite finalizar las peticiones en proceso antes de que
concluya todo el proceso del servidor. Esta modalidad de cierre es m&aacute;s r&aacute;pida que el proceso normal de detenci&oacute;n del servidor, pero algunos clientes de aplicaciones pueden recibir excepciones.</li>

<li>
<strong>Importar claves. </strong>Importa claves LTPA nuevas de otros dominios. Para dar soporte de inicio de sesi&oacute;n &uacute;nico (SSO) en WebSphere
para varios dominios de WebSphere (c&eacute;lulas), se deben compartir
claves LTPA y una contrase&ntilde;a entre los dominios. Una vez exportadas las
claves de una de las c&eacute;lulas a un archivo, al pulsar este bot&oacute;n se
importan claves a todos los servidores activos (c&eacute;lula, nodo y
servidores de aplicaciones). Las claves nuevas se pueden utilizar para
cifrar y descifrar el s&iacute;mbolo LTPA. Pulse <strong>Guardar</strong> en la barra de
tareas de la consola para guardar las claves nuevas y la contrase&ntilde;a en
el dep&oacute;sito.</li>

<li>
<strong>Instalar. </strong>Muestra la p&aacute;gina Preparaci&oacute;n para la instalaci&oacute;n de la aplicaci&oacute;n, que se puede utilizar para desplegar una aplicaci&oacute;n o componente EJB o Web en un servidor de aplicaciones.</li>

<li>
<strong>Instalar RAR.</strong>El bot&oacute;n Instalar RAR abre un di&aacute;logo que se utiliza para instalar un
conector JCA y crear un adaptador de recursos para &eacute;l.</li>

<li>
<strong>Gestionar transacciones. </strong>Muestra una lista de transacciones activas que se ejecutan en un servidor. Puede forzar la finalizaci&oacute;n de cualquier transacci&oacute;n cuyo proceso se
haya detenido debido a que un recurso de la transacci&oacute;n no estaba disponible.</li>

<li>
<strong>Modificar. </strong>Abre un di&aacute;logo que se utiliza para cambiar una especificaci&oacute;n.</li>

<li>
<strong>Mover. </strong>Mueve los servidores de aplicaciones seleccionados a una
ubicaci&oacute;n distinta en la c&eacute;lula administrativa. Cuando se le solicite, especifique la ubicaci&oacute;n de destino.</li>

<li>
<strong>Nuevo. </strong>Visualiza una p&aacute;gina que se utiliza para definir una instancia nueva. Por ejemplo, cuando se pulsa <strong>Nuevo</strong> en la p&aacute;gina
servidor de aplicaciones se visualiza una p&aacute;gina en la que se puede
configurar un servidor de aplicaciones nuevo.</li>

<li>
<strong>Siguiente. </strong>Visualiza la p&aacute;gina, el marco o el elemento siguiente de una secuencia.</li>

<li>
<strong>Aceptar. </strong>Guarda los cambios y sale de la p&aacute;gina.</li>

<li>
<strong>Ping. </strong>Intenta ponerse en contacto con los servidores de aplicaciones seleccionados.</li>

<li>
<strong>Anterior. </strong>Visualiza la p&aacute;gina, el marco o el elemento anterior de una secuencia.</li>

<li>
<strong>Salir. </strong>Sale del recuadro de di&aacute;logo, descartando los cambios no guardados.</li>

<li>
<strong>Renovar. </strong>Renueva la vista de datos de las instancias actualmente
en la lista de esta p&aacute;gina con pesta&ntilde;as.</li>


<li>
<strong>Eliminar. </strong>Suprime el elemento seleccionado.</li>


<li>
<strong>Restablecer. </strong>Borra los cambios de la pesta&ntilde;a o p&aacute;gina y restaura los &uacute;ltimos
valores guardados.</li>

<li>
<strong>Rearrancar. </strong>Detiene los objetos seleccionados y los vuelve a iniciar.</li>


<li>
<strong>Recuperar nuevo. </strong>Recupera un registro nuevo.</li>

<li>
<strong>Guardar. </strong>Guarda los cambios de la configuraci&oacute;n local en la configuraci&oacute;n maestra.</li>

<li>
<strong>Seleccionar. </strong>Para el an&aacute;lisis de recursos, permite seleccionar un &aacute;mbito para
supervisar los recursos.</li>

<li>
<strong>Establecer. </strong>Guarda los cambios de los valores de un di&aacute;logo.</li>

<li>
<strong>Valores. </strong>Muestra un di&aacute;logo para editar los valores de recursos relacionados con un servlet.</li>

<li>
<strong>Valores en uso. </strong>Muestra un di&aacute;logo para editar los valores que est&aacute;n utiliz&aacute;ndose.</li>

<li>
<strong>Arrancar. </strong>En el contexto de servidores de aplicaciones, arranca los servidores
de aplicaciones seleccionados. En el contexto de recogida de datos, arranca la recogida
de datos para las tablas de esta p&aacute;gina con pesta&ntilde;as.</li>

<li>
<strong>Detener. </strong>En el contexto de componentes de servidor, como los servidores de
aplicaciones, detiene los componentes de servidor seleccionados. En el contexto de recogida de
datos, detiene la recogida de datos de esta p&aacute;gina con pesta&ntilde;as. </li>




<li>
<strong>Desinstalar. </strong>Elimina una aplicaci&oacute;n desplegada del dep&oacute;sito de configuraci&oacute;n de
WebSphere Application Server. Tambi&eacute;n suprime los archivos binarios de la aplicaci&oacute;n del sistema de archivos.</li>

<li>
<strong>Actualizar. </strong>Sustituye una aplicaci&oacute;n desplegada en un servidor por una aplicaci&oacute;n actualizada. Como parte de la actualizaci&oacute;n, deber&aacute; seguir los pasos de las p&aacute;ginas
Preparaci&oacute;n de la instalaci&oacute;n de la aplicaci&oacute;n y Actualizaci&oacute;n de aplicaciones.</li>

<li>
<strong>Actualizar lista de recursos. </strong>Actualiza los datos de una tabla. Busca y a&ntilde;ade instancias nuevas a la tabla.</li>




<li>
<strong>Ver. </strong>Abre un di&aacute;logo en un archivo.</li>

</ul>

</body>
</html>
