<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Acciones de la barra de tareas de la consola administrativa</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rtaskbar"></a>
<h2>Acciones de la barra de tareas de la consola administrativa</h2>

<p>Utilice la barra de tareas de la consola administrativa para volver a la p&aacute;gina
principal de la consola, guardar los cambios que haya realizado en configuraciones
administrativas, especificar preferencias de la consola, cerrar la sesi&oacute;n de la consola y
acceder a informaci&oacute;n sobre el producto.</p>

<p>Para ver la barra de tareas, vaya a la consola administrativa de
WebSphere Application Server y localice la barra horizontal que aparece
cerca de la parte superior de la consola. La barra de tareas proporciona varias acciones.</p>

<dl>
<dt>
<strong><a name="menu_workspace_home"></a>Inicio</strong>
</dt>
<dd>Muestra la p&aacute;gina principal de la consola administrativa en el espacio de trabajo.
El espacio de trabajo se encuentra en la parte derecha de la consola. 
La p&aacute;gina principal proporciona enlaces con la informaci&oacute;n sobre c&oacute;mo
utilizar el producto WebSphere Application Server.

</dd>
<dt>
<strong><a name="menu_save_changes"></a>Guardar</strong>
</dt>
<dd>Muestra la p&aacute;gina Guardar, que se utiliza para guardar el trabajo realizado en la consola administrativa.
<p>Los cambios realizados en las configuraciones administrativas se guardan en un dep&oacute;sito maestro formado por archivos de configuraci&oacute;n .xml. Para ver qu&eacute; cambios se guardan, expanda
<strong>Ver elementos con cambios</strong>. Es conveniente guardar el trabajo de forma
peri&oacute;dica para no perder los cambios que se hayan realizado.</p>

</dd>
<dt>
<strong><a name="menu_preferences"></a>Preferencias</strong>
</dt>
<dd>Muestra la p&aacute;gina Preferencias, donde puede especificar si desea que la p&aacute;gina del
espacio de trabajo de la consola administrativa se renueve autom&aacute;ticamente despu&eacute;s de los
cambios, que aparezcan di&aacute;logos de confirmaci&oacute;n y que el &aacute;mbito por omisi&oacute;n sea el nodo de la
consola administrativa.

</dd>
<dt>
<strong><a name="menu_logout"></a>Cerrar sesi&oacute;n</strong>
</dt>
<dd>Cierra la sesi&oacute;n de la consola administrativa y muestra la p&aacute;gina Inicio de sesi&oacute;n. Si ha modificado la configuraci&oacute;n administrativa desde la &uacute;ltima vez que guard&oacute; la configuraci&oacute;n en el dep&oacute;sito maestro, la p&aacute;gina Guardar se muestra antes de volver a la p&aacute;gina Inicio de sesi&oacute;n. Pulse <strong>Guardar</strong> para guardar los cambios en el dep&oacute;sito maestro, <strong>Descartar</strong> para salir de la sesi&oacute;n sin guardar los cambios o <strong>Cerrar sesi&oacute;n</strong> para salir de la sesi&oacute;n sin guardar los cambios, aunque con la posibilidad de recuperar los cambios cuando vuelva a la consola.

</dd>
<dt>
<strong><a name="menu_help"></a>Ayuda</strong>
</dt>
<dd>Abre un nuevo navegador Web en la
ayuda en l&iacute;nea para el producto WebSphere Application Server.

</dd>
<dt>
<strong><a name="menu_help"></a>conmutador Ocultar/Mostrar descripciones de campo y p&aacute;gina</strong>
</dt>
<dd>Permite seleccionar si se muestra la informaci&oacute;n de las p&aacute;ginas y campos de
la consola. Los iconos a la derecha en la barra de tareas proporcionan la conmutaci&oacute;n.

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="ucon_rpref.html">Valores de preferencias</a>
<br>

<a href="ucon_rlogin.html">Valores de inicio de sesi&oacute;n</a>
<br>

</div>
</body>
</html>
