<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de preferencias</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rpref"></a>
<h2>Valores de preferencias</h2>

<p>Utilice la p&aacute;gina Preferencias para especificar si desea que el espacio de trabajo
de la consola administrativa se renueve autom&aacute;ticamente despu&eacute;s de los cambios, el &aacute;mbito
por omisi&oacute;n sea el nodo de la consola administrativa, se muestren di&aacute;logos de confirmaci&oacute;n y
se visualicen las descripciones y el mensaje de cabecera del espacio de trabajo.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Preferencias</strong> en la barra de tareas.</p>

<dl>
<dt>
<strong><a name="console_preferences_autoRefresh"></a>Habilitar la renovaci&oacute;n autom&aacute;tica del espacio de trabajo</strong>
</dt>
<dd>Especifica si desea que el espacio de trabajo de la consola administrativa se vuelva a trazar autom&aacute;ticamente despu&eacute;s de que cambie la configuraci&oacute;n administrativa.
<p>El valor por omisi&oacute;n es que el espacio de trabajo se vuelva a trazar autom&aacute;ticamente. Si
dirige la consola para crear una nueva instancia, por ejemplo, de un servidor de aplicaciones,
la p&aacute;gina Servidores de aplicaciones se renueva autom&aacute;ticamente y muestra el nuevo nombre del
servidor en la colecci&oacute;n de servidores.</p>

<p>Si especifica que el espacio de trabajo no se vuelva a trazar autom&aacute;ticamente, significa que debe volver a acceder a la p&aacute;gina pulsando en el &aacute;rbol de navegaci&oacute;n de la consola o en los enlaces de las p&aacute;ginas de la colecci&oacute;n para ver los cambios realizados en la configuraci&oacute;n administrativa.</p>

<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Boolean</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">true</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="console_preferences_confirm"></a>No confirmar los descartes del espacio de trabajo</strong>
</dt>
<dd>Especifica si deben aparecer di&aacute;logos de confirmaci&oacute;n despu&eacute;s de una petici&oacute;n para suprimir un objeto. El valor por omisi&oacute;n es que no aparezcan di&aacute;logos de confirmaci&oacute;n.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Boolean</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">false</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="console_preferences_scope"></a>Utilizar &aacute;mbito por omisi&oacute;n</strong>
</dt>
<dd>Especifica si el &aacute;mbito por omisi&oacute;n es el nodo de la consola administrativa. El valor por omisi&oacute;n es que el &aacute;mbito no sea el nodo de la consola.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Boolean</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">false</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="console_preferences_banner"></a>Mostrar/ocultar mensaje de cabecera</strong>
</dt>
<dd>
Especifica si se visualizar&aacute; el mensaje de cabecera de WebSphere
Application Server en la parte superior de la consola administrativa. El valor por omisi&oacute;n es que se visualice el mensaje de cabecera.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Boolean</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">true</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="console_preferences_hideshow"></a>Mostrar/ocultar descripciones</strong>
</dt>
<dd>Especifica si se visualizar&aacute; la informaci&oacute;n de las p&aacute;ginas de la consola y los
campos de las p&aacute;ginas. Los iconos de mostrar/ocultar descripciones de campo y de p&aacute;gina que
aparecen en la parte derecha de la barra de tareas proporcionan la misma funci&oacute;n. El valor por
omisi&oacute;n es mostrar las descripciones de campo y de p&aacute;gina.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">Boolean</td>

</tr>

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Valor por omisi&oacute;n</td>
<td align="left" valign="top" class="base">true</td>

</tr>

</table>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

</div>
</body>
</html>
