<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>&Aacute;reas de la consola administrativa</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rconsole"></a>
<h2>&Aacute;reas de la consola administrativa</h2>

<p>Utilice la consola administrativa para crear y gestionar recursos, aplicaciones y
servidores o bien para ver los mensajes del producto.</p>

<p>Para ver la consola administrativa, aseg&uacute;rese de que el servidor de aplicaciones de la
consola administrativa se est&eacute; ejecutando. Apunte a un navegador Web en el URL
de la consola administrativa, entre el ID de usuario y, si es necesario, una contrase&ntilde;a en una
p&aacute;gina de inicio de sesi&oacute;n.</p>

<p>La consola tiene las siguientes &aacute;reas principales, que puede redimensionar seg&uacute;n lo desee:</p>

<dl>
<dt>
<strong><a name="menu"></a>Barra de tareas</strong>
</dt>
<dd>La barra de tareas ofrece opciones para volver a la p&aacute;gina principal de la consola,
guardar los cambios en las configuraciones administrativas, especificar preferencias en toda la
consola, terminar la sesi&oacute;n de la consola y acceder a la informaci&oacute;n de productos.

</dd>
<dt>
<strong><a name="tree"></a>&Aacute;rbol de navegaci&oacute;n</strong>
</dt>
<dd>El &aacute;rbol de
navegaci&oacute;n de la parte izquierda de la consola proporciona enlaces a
las p&aacute;ginas de la consola que se utilizan para crear y gestionar
componentes de una c&eacute;lula administrativa de WebSphere Application
Server.
<p>Pulse el signo <strong>+</strong> que aparece junto a un elemento o carpeta de &aacute;rbol para expandir el &aacute;rbol de la carpeta o elemento. Pulse el signo <strong>-</strong> para contraer el &aacute;rbol de la carpeta o elemento.  Pulse dos veces un elemento de la vista de &aacute;rbol para conmutar entre los estados expandido y contra&iacute;do.</p>

</dd>
<dt>
<strong><a name="workspace"></a>Espacio de trabajo</strong>
</dt>
<dd>El espacio de trabajo de la parte derecha de la consola contiene p&aacute;ginas que se
utilizan para crear y gestionar objetos de configuraci&oacute;n tales como los servidores y
recursos.
 Pulse los enlaces del &aacute;rbol de navegaci&oacute;n para ver los distintos tipos de objetos
configurados. En el espacio de trabajo, pulse los objetos configurados para ver las configuraciones, estados de tiempo de ejecuci&oacute;n y opciones correspondientes. Pulse <strong>Inicio</strong> en la barra de tareas para
visualizar la p&aacute;gina principal del espacio de trabajo, que contiene
enlaces con informaci&oacute;n sobre c&oacute;mo utilizar el producto WebSphere
Application Server.

</dd>
<dt>
<strong><a name="status"></a>Estado de WebSphere</strong>
</dt>
<dd>El &aacute;rea de mensajes
de estado situada en la parte inferior de la consola ofrece informaci&oacute;n
sobre los mensajes devueltos por WebSphere Application Server
relacionados con problemas de la configuraci&oacute;n administrativa as&iacute; como
con sucesos de tiempo de ejecuci&oacute;n. Pulse
<strong>Anterior</strong> o <strong>Siguiente</strong> para conmutar entre las pantallas de los problemas de
configuraci&oacute;n y los sucesos de tiempo de ejecuci&oacute;n.
<p>Puede ajustar el intervalo entre renovaciones autom&aacute;ticas en los valores de Preferencias.</p>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="ucon_rlogin.html">Valores de inicio de sesi&oacute;n</a>
<br>

<a href="ucon_rnavtree.html">Acciones del &aacute;rbol de navegaci&oacute;n de la consola administrativa</a>
<br>

<a href="ucon_rpref.html">Valores de preferencias</a>
<br>

<a href="ucon_rtaskbar.html">Acciones de la barra de tareas de la consola administrativa</a>
<br>

<a href="ucon_rstatus.html">Valores de estado de WebSphere</a>
<br>

</div>
</body>
</html>
