<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de estado de WebSphere</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rstatus"></a>
<h2>Valores de estado de WebSphere</h2>

<p>Utilice el &aacute;rea Estado de WebSphere de la consola administrativa para ver los mensajes de error y de sucesos de tiempo de ejecuci&oacute;n devueltos por WebSphere Application Server.</p>

<p>El &aacute;rea Estado de WebSphere se muestra a lo largo de la parte inferior de la consola y permanece visible mientras se desplace desde la p&aacute;gina principal de WebSphere a otras
p&aacute;ginas.
El &aacute;rea muestra dos marcos: <strong>Problemas de configuraci&oacute;n de WebSphere</strong> y
<strong>Mensajes de tiempo de ejecuci&oacute;n de WebSphere</strong>.  Pulse <strong>Anterior</strong> o <strong>Siguiente</strong> para conmutar entre los marcos.</p>

<p>Pulse el icono que aparece en la parte superior izquierda del &aacute;rea para renovar la
informaci&oacute;n mostrada.  Puede ajustar el intervalo entre renovaciones autom&aacute;ticas en los valores de <strong>Preferencias</strong>.</p>

<dl>
<dt>
<strong><a name="WebSphereStatus_configurationProblems_description"></a>Problemas de configuraci&oacute;n de WebSphere</strong>
</dt>
<dd>Muestra el n&uacute;mero de archivos de espacio de trabajo. En este marco, tambi&eacute;n se
muestra el n&uacute;mero de problemas con la configuraci&oacute;n administrativa para el ID de usuario.
<p>Pulse el n&uacute;mero para ver informaci&oacute;n detallada de los problemas.</p>

</dd>
<dt>
<strong><a name="WebSphereStatus_runtimeProblems_description"></a>Mensajes de tiempo de ejecuci&oacute;n de WebSphere</strong>
</dt>
<dd>Muestra el n&uacute;mero de mensajes devueltos por WebSphere Application
Server, adem&aacute;s del n&uacute;mero  de mensajes de error (icono <strong>x</strong>),
mensajes de aviso (icono <strong>!</strong>)  y mensajes informativos (icono<strong>i</strong>).
<p>Pulse el n&uacute;mero de mensajes para ver los detalles.</p>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

</div>
</body>
</html>
