<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Acciones del &aacute;rbol de navegaci&oacute;n de la consola administrativa</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="urun_rnavtree"></a>
<h2>Acciones del &aacute;rbol de navegaci&oacute;n de la consola administrativa</h2>

<p>Utilice el &aacute;rbol de navegaci&oacute;n de la consola administrativa para acceder a las
p&aacute;ginas para crear y gestionar servidores, aplicaciones, recursos y otros componentes.</p>

<p>Para ver el &aacute;rbol de navegaci&oacute;n, vaya a la consola administrativa de
WebSphere Application Server y busque el &aacute;rbol a la izquierda de la
consola. El &aacute;rbol permite el desplazamiento a las tareas de configuraci&oacute;n y la informaci&oacute;n de tiempo de ejecuci&oacute;n. Los temas principales que est&aacute;n disponibles en el &aacute;rbol se muestran a continuaci&oacute;n. Para utilizar el &aacute;rbol, expanda un tema principal de inter&eacute;s y seleccione un elemento de la lista ampliada para visualizar una p&aacute;gina en la que pueda finalizar el trabajo.</p>

<dl>
<dt>
<strong><a name="nav_webSphere_servers"></a>Servidores</strong>
</dt>
<dd>Permite configurar los servidores de administraci&oacute;n y otros tipos de servidores, como por ejemplo, los servidores JMS.

</dd>
<dt>
<strong><a name="rnavtree"></a>Aplicaciones</strong>
</dt>
<dd>Permite instalar aplicaciones en servidores y gestionar las aplicaciones instaladas.

</dd>
<dt>
<strong><a name="rnavtree-r"></a>Recursos</strong>
</dt>
<dd>Permite configurar recursos y ver informaci&oacute;n sobre los recursos que existen en la c&eacute;lula de administraci&oacute;n.

</dd>
<dt>
<strong><a name="rnavtree-sc"></a>Seguridad</strong>
</dt>
<dd>Sirve para acceder al Centro de Seguridad, que se utiliza para proteger las aplicaciones y servidores y gestionar los usuarios de la consola administrativa.

</dd>
<dt>
<strong><a name="nav_webSphere_environment_configuration"></a>Entorno</strong>
</dt>
<dd>Permite configurar sistemas principales, servidores Web, variables y otros componentes.

</dd>
<dt>
<strong><a name="rnavtree-pd"></a>Resoluci&oacute;n de problemas</strong>
            &nbsp;
            </dt>
<dd>Permite comprobar y hacer un seguimiento de errores y problemas de configuraci&oacute;n.

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="ucon_rlogin.html">Valores de inicio de sesi&oacute;n</a>
<br>

</div>
</body>
</html>
