# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided. 
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.50,0,02/07/10,12:51:45
#
#CMVCPATHNAME ws/code/webui.environment/src/environment/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE

nav.webSphere.environment.configuration=Entorno
nav.view.virtual.hosts=Sistemas principales virtuales  
nav.view.name.space.bindings=Enlaces de espacio de nombres
nav.view.libraries=Bibliotecas compartidas

environment.label.string=Serie
environment.label.ejb=EJB
environment.label.corba=CORBA
environment.label.indirect=Indirecto
environment.label.name=Nombre
environment.label.description=Descripci\u00f3n
environment.label.scope=\u00c1mbito

error.virtualhost.not.found=No se ha encontrado el sistema principal virtual.
error.duplicate.virtualhost.name=<span class\="validation-error">Error \: El sistema principal virtual "{0}" ya existe.</span><br>
warning.virtualhost.name.change=Si cambiar los valores de este sistema principal virtual, se pueden ver afectadas las aplicaciones que actualmente van a ejecutarse en el mismo.  Ser\u00e1 necesario que revise manualmente las correlaciones del sistema principal de cada aplicaci\u00f3n para asegurarse de que sean correctas.
error.noMimeEntry=<li>Falta tipo de MIME</li>
error.mimeentry.not.found=No se ha encontrado la entrada MIME.
error.hostalias.not.found=No se ha encontrado el alias del sistema principal.
error.variable.not.found=No se ha encontrado la variable.
missing.required.values=Faltan valores necesarios
warning.duplicate.namespacebinding.name=<span class\="validation-warn-info">Aviso \: El identificador de enlace "{0}" ya existe en este \u00e1mbito.</span><br>
warning.duplicate.namespacebinding.nameInNameSpace=<span class\="validation-warn-info">Aviso \: Ya se ha configurado en este \u00e1mbito un enlace con nombre en el espacio de nombres "{0}".</span><br>
error.namespacebinding.not.found=No se ha encontrado el enlace de espacio de nombres.
error.library.not.found=No se ha encontrado la biblioteca.
error.node.not.found=No se ha encontrado el nodo.
error.replicators.not.defined=No se han definido duplicadores para uno o m\u00e1s dominios
error.replicators.dont.exist=No se ha definido duplicadores para ninguno de los dominios existentes

VirtualHost.displayName=Sistemas principales virtuales
VirtualHost.description=Configuraci\u00f3n para permitir que una m\u00e1quina de sistema principal parezca varias m\u00e1quinas de sistema principal. Cada sistema principal virtual tiene un nombre l\u00f3gico y una lista de uno o m\u00e1s alias de DNS por los que se le conoce. 
VirtualHost.smallIcon=VirtualHost.gif
VirtualHost.largeIcon=VirtualHost32X32.gif
VirtualHost.name.description=Especifica un nombre l\u00f3gico utilizado para configurar aplicaciones Web en un nombre de sistema principal determinado. El sistema principal por omisi\u00f3n es adecuado para las configuraciones m\u00e1s simples.
VirtualHost.aliases.displayName= Alias de sistema principal
VirtualHost.aliases.description=Lista de uno o m\u00e1s alias de DNS por los que se conoce el sistema principal.
VirtualHost.mimeTypes.displayName=Tipos de MIME
VirtualHost.mimeTypes.description=Colecci\u00f3n de correlaciones de extensiones de tipo MIME definidas para los sistemas principales virtuales. Si no se especifican en el m\u00f3dulo Web las entradas MIME, se aplicar\u00e1n estas entradas MIME.
virtual.host.must.be.selected=Debe seleccionar al menos un sistema principal virtual para efectuar esta acci\u00f3n.

MimeEntry.displayName=Tipo de MIME
MimeEntry.description=Configuraci\u00f3n de la correlaci\u00f3n de tipos de MIME en extensiones.
MimeEntry.smallIcon=MimeEntry.gif
MimeEntry.largeIcon=MimeEntry32X32.gif
MimeEntry.type.description=Especifica un tipo MIME con el que se correlacionan las extensiones de nombre de archivo del tipo.
MimeEntry.extensions.displayName=Extensiones
MimeEntry.extensions.description=Lista las extensiones de archivo que se correlacionan con el tipo MIME.
HostAlias.displayName=Nombre del sistema principal
HostAlias.description=Un alias es el sistema principal de DNS y el n\u00famero de puerto que utiliza un cliente para realizar una petici\u00f3n de URL de un recurso de aplicaci\u00f3n Web (como un servlet, una JSP o p\u00e1gina HTML). Por ejemplo, es la parte "sistpral:8080" de  http://sistpral:8080/servlet/snoop.  Cuando no se especifica ning\u00fan n\u00famero de puerto, se utiliza el puerto por omisi\u00f3n 80.
HostAlias.smallIcon=HostAlias.gif
HostAlias.largeIcon=HostAlias32X32.gif
HostAlias.hostname.description=Direcci\u00f3n IP, nombre de sistema principal DNS con sufijo de nombre de dominio, o s\u00f3lo nombre de sistema principal DNS, utilizado por un cliente para solicitar un recurso de aplicaciones Web (como un servlet, una JSP o una p\u00e1gina HTML).
HostAlias.port.displayName=Puerto
HostAlias.port.description=El puerto con el que se ha configurado el servidor Web para que acepte las peticiones de los clientes. Especifique un valor de puerto junto con el nombre del sistema principal.

plugincfg.title=Actualizar el plug-in del servidor Web
plugincfg.description=Pulse el bot\u00f3n Aceptar para actualizar el archivo de configuraci\u00f3n del plug-in.
plugincfg.help=El archivo de configuraci\u00f3n del plug-in del servidor Web controla el contenido que se transfiere desde el servidor Web a un servidor de aplicaciones. Este archivo debe regenerarse cuando cambian las configuraciones del servidor, cl\u00faster, transporte HTTP o alias del sistema principal virtual. El archivo plugin-cfg.xml generado se sit\u00faa en el directorio config de la instalaci\u00f3n de WebSphere. Si el servidor Web est\u00e1 situado en una m\u00e1quina remota, deber\u00e1 trasladar a mano este archivo a esa m\u00e1quina. 

nav.view.variable.substitution.entry=Gestionar variables de WebSphere
VariableSubstitutionEntry.displayName=Variables de WebSphere
VariableSubstitutionEntry.description=Las variables de sustituci\u00f3n permiten especificar un nivel de desv\u00edo para los valores definidos en el sistema, tales como las ra\u00edces del sistema de archivos. Las variables pueden definirse a nivel de servidor, nodo o c\u00e9lula.  Cuando las variables de distintos \u00e1mbitos tienen el mismo nombre, el orden de resoluci\u00f3n es el siguiente: variables de servidor, variables de nodo y variables de c\u00e9lula.
VariableSubstitutionEntry.smallIcon=VariableSubstitutionEntry.gif
VariableSubstitutionEntry.largeIcon=VariableSubstitutionEntry32X32.gif
VariableSubstitutionEntry.symbolicName.description=Especifica el nombre simb\u00f3lico que representa una v\u00eda de acceso f\u00edsica o un directorio ra\u00edz de URL.
VariableSubstitutionEntry.value.displayName=Valor
VariableSubstitutionEntry.value.description=Especifica la v\u00eda de acceso absoluta que representa el nombre simb\u00f3lico.
VariableSubstitutionEntry.description.description=Proporciona una descripci\u00f3n opcional para sus registros administrativos.

NameSpaceBinding.displayName=Enlaces de espacio de nombres
NameSpaceBinding.description=Utilice esta p\u00e1gina para configurar un enlace de nombre de un enterprise bean, de un contexto de denominaci\u00f3n CORBA CosNaming u objeto de enlace inferior CORBA, de un objeto que se pueda buscar mediante JDNI, o un valor de serie constante.
NameSpaceBinding.smallIcon=NameSpaceBinding.gif
NameSpaceBinding.largeIcon=NameSpaceBinding32X32.gif
NameSpaceBinding.name.displayName=Identificador de enlace
NameSpaceBinding.name.description=Nombre dado para identificar de manera exclusiva este enlace configurado.
NameSpaceBinding.nameInNameSpace.displayName=Nombre en espacio de nombres
NameSpaceBinding.nameInNameSpace.description=Nombre utilizado para este enlace en el espacio de nombres. Nombre simple o compuesto relativo a la parte del espacio de nombres donde est\u00e1 configurado este enlace.
NameSpaceBinding.bindingType.description=El tipo de enlace configurado. Las opciones posibles son Serie, EJB, CORBA e Indirecto.
NameSpaceBinding.bindingType.displayName=Tipo de enlace
NameSpaceBinding.namingContext.description=El \u00e1mbito del enlace configurado.  Este valor indica la ubicaci\u00f3n de configuraci\u00f3n del archivo namebindings.xml.
EjbNameSpaceBinding.displayName=EjbNameSpaceBinding
EjbNameSpaceBinding.description=Utilice esta p\u00e1gina para configurar un enlace de nombre de una factor\u00eda de enterprise bean que ya est\u00e9 configurada en un servidor de la c\u00e9lula.
EjbNameSpaceBinding.smallIcon=EjbNameSpaceBinding.gif
EjbNameSpaceBinding.largeIcon=EjbNameSpaceBinding32X32.gif
EjbNameSpaceBinding.ejbJndiName.displayName=Nombre JNDI
EjbNameSpaceBinding.ejbJndiName.description=Nombre JNDI del enterprise bean desplegado (nombre JNDI del bean que se encuentra en los enlaces del enterprise bean, no el nombre java:comp).
EjbNameSpaceBinding.applicationServerName.displayName=Servidor
EjbNameSpaceBinding.applicationServerName.description=Nombre del servidor en cl\u00faster o no en cl\u00faster donde est\u00e1 configurado el enterprise bean.
EjbNameSpaceBinding.applicationNodeName.displayName=Nodo
EjbNameSpaceBinding.serverCluster.displayName=Cl\u00faster de servidores
EjbNameSpaceBinding.singleServer.displayName=Servidor \u00fanico (el nodo es obligatorio)
EjbNameSpaceBinding.bindingLocation.displayName=Ubicaci\u00f3n del enterprise bean
EjbNameSpaceBinding.bindingLocation.description=Especifica la ubicaci\u00f3n del enterprise bean.
EjbNameSpaceBinding.bindingLocation.description.base=Especifica la ubicaci\u00f3n del enterprise bean proporcionando el nombre de nodo.
EjbNameSpaceBinding.bindingLocation.description.nd=Especifica la ubicaci\u00f3n del enterprise bean.  Si el enterprise bean se est\u00e1 ejecutando en un cl\u00faster de servidores, seleccione 'Cl\u00faster de servidores'.  De lo contrario,seleccione 'Servidor \u00fanico' y proporcione el nombre de nodo.
CORBAObjectNameSpaceBinding.displayName=CORBAObjectNameSpaceBinding
CORBAObjectNameSpaceBinding.description=Utilice esta p\u00e1gina para configurar un enlace de nombre de una factor\u00eda de CORBA que ya est\u00e9 configurada en un servidor de la c\u00e9lula.
CORBAObjectNameSpaceBinding.smallIcon=CORBAObjectNameSpaceBinding.gif
CORBAObjectNameSpaceBinding.largeIcon=CORBAObjectNameSpaceBinding32X32.gif
CORBAObjectNameSpaceBinding.corbanameUrl.displayName=URL de nombre CORBA
CORBAObjectNameSpaceBinding.corbanameUrl.description=Serie de URL de nombre CORBA que identifica el punto de enlace del objeto en un servidor CosNaming.
CORBAObjectNameSpaceBinding.federatedContext.displayName=Contexto federado
CORBAObjectNameSpaceBinding.federatedContext.description=Si se selecciona, el destino es un CosNaming. contexto espec\u00edfico de aplicaci\u00f3n existente. Si no se selecciona, el destino es un objeto de nodo inferior.
IndirectLookupNameSpaceBinding.displayName=IndirectLookupNameSpaceBinding
IndirectLookupNameSpaceBinding.description=Utilice esta p\u00e1gina para configurar un enlace de nombre de un objeto que se pueda buscar mediante JNDI.
IndirectLookupNameSpaceBinding.smallIcon=IndirectLookupNameSpaceBinding.gif
IndirectLookupNameSpaceBinding.largeIcon=IndirectLookupNameSpaceBinding32X32.gif
IndirectLookupNameSpaceBinding.providerURL.displayName=URL del suministrador
IndirectLookupNameSpaceBinding.providerURL.description=Serie de URL de proveedor necesaria para obtener un contexto inicial de JNDI.
IndirectLookupNameSpaceBinding.jndiName.displayName=Nombre JNDI
IndirectLookupNameSpaceBinding.jndiName.description=Nombre utilizado para buscar el objeto de destino desde el contexto inicial.
StringNameSpaceBinding.displayName=StringNameSpaceBinding
StringNameSpaceBinding.description=Utilice esta p\u00e1gina para configurar un enlace de nombre de un valor de serie constante.
StringNameSpaceBinding.smallIcon=StringNameSpaceBinding.gif
StringNameSpaceBinding.largeIcon=StringNameSpaceBinding32X32.gif
StringNameSpaceBinding.stringToBind.displayName=Valor de serie
StringNameSpaceBinding.stringToBind.description=Serie que se debe enlazar con el espacio de nombres.
NameSpaceBinding.create.new=Nuevo enlace de espacio de nombres
NameSpaceBinding.create.new.description=Utilice este asistente para configurar un nuevo enlace de espacio de nombres.
NameSpaceBinding.new.step1=Especifique el tipo de enlace
NameSpaceBinding.new.step2.ejb=Especifique las propiedades b\u00e1sicas
NameSpaceBinding.new.step2.corba=Especifique las propiedades b\u00e1sicas
NameSpaceBinding.new.step2.indirect=Especifique las propiedades b\u00e1sicas
NameSpaceBinding.new.step2.string=Especifique las propiedades b\u00e1sicas
NameSpaceBinding.new.step3=Resumen

Node.displayName=Nodo
Node.description=Lista de nodos en esta c\u00e9lula. Puede a\u00f1adir nuevos nodos a la c\u00e9lula pulsando "A\u00f1adir nodo" y especificando una instancia remota de WebSphere Application Server en ejecuci\u00f3n.
Node.largeIcon=Node32X32.gif
Node.properties.displayName=Propiedades personalizadas
Node.properties.description=Propiedades de configuraci\u00f3n arbitrarias que se aplican a este nodo.
Node.name.displayName=Nombre
Node.name.description=Especifica un nombre l\u00f3gico para el nodo. El nombre debe ser exclusivo en la c\u00e9lula.
Node.status.displayName=Estado
Node.synchronized=Sincronizado
Node.not.synchronized=No sincronizado
Node.discoveryProtocol.displayName=Protocolo de descubrimiento
Node.discoveryProtocol.description=Especifica el protocolo que sigue el nodo para recuperar informaci\u00f3n de una red.
Cell.nodes.displayName=Nodos
Cell.nodes.description=Nodos definidos en esta c\u00e9lula
Cell.displayName=C\u00e9lula
Cell.description=Agrupaci\u00f3n l\u00f3gica de nodos de WebSphere para una administraci\u00f3n conjunta.
Cell.largeIcon=Cell32X32.gif
Cell.foreignCells.displayName=C\u00e9lulas for\u00e1neas
Cell.foreignCells.description=El dominio tiene una colecci\u00f3n de objetos for\u00e1neos de dominio que se pueden utilizar para acceder a un dominio distinto.  
Cell.properties.displayName=Propiedades personalizadas
Cell.properties.description=Propiedades de configuraci\u00f3n arbitrarias que se aplican a esta c\u00e9lula.
Cell.name.displayName=Nombre
Cell.name.description=Especifica el nombre de la c\u00e9lula existente.
Cell.cellDiscoveryProtocol.displayName=Protocolo de descubrimiento de c\u00e9lulas
Cell.cellDiscoveryProtocol.description=Especifica el protocolo que sigue la c\u00e9lula para recuperar informaci\u00f3n de una red.
Cell.discoveryAddressEndpointName.displayName=Nombre de punto final de direcci\u00f3n de descubrimiento
Cell.discoveryAddressEndpointName.description=Especifica el nombre del punto final que contiene la direcci\u00f3n de descubrimiento.
Cell.multicastDiscoveryAddressEndpointName.displayName=Nombre de punto final de direcci\u00f3n de descubrimiento multidifusi\u00f3n
Cell.multicastDiscoveryAddressEndpointName.description=Especifica el nombre del punto final que contiene la direcci\u00f3n de descubrimiento multidifusi\u00f3n.

EndPoint.displayName=Punto final
EndPoint.description=Especifica un punto final de comunicaciones utilizado por los servicios o los componentes de tiempo de ejecuci\u00f3n que se ejecuten en un proceso.
EndPoint.smallIcon=EndPoint.gif
EndPoint.largeIcon=EndPoint32X32.gif
EndPoint.host.displayName=Sistema principal
EndPoint.host.description=Direcci\u00f3n IP, nombre de sistema principal DNS con sufijo de nombre de dominio, o s\u00f3lo nombre de sistema principal DNS, utilizado por un cliente para solicitar un recurso de aplicaciones Web (como un servlet, una JSP o una p\u00e1gina HTML).
EndPoint.port.displayName=Puerto
EndPoint.port.description=El puerto con el que se ha configurado el servidor Web para que acepte las peticiones de los clientes. Especifique un valor de puerto junto con el nombre del sistema principal.

TCPIPProtocolType.UDP=UDP
TCPIPProtocolType.TCP=TCP
TCPIPProtocolType.MULTICAST=MULTICAST

Transport.displayName=Transporte
Transport.description=Los procesos de servidor pueden dar soporte a distintos transportes de IPC.  Los procesos del cliente se conectan al servidor mediante uno de los transportes admitidos por los servidores.
Transport.smallIcon=Transport.gif
Transport.largeIcon=Transport32X32.gif
Transport.address.displayName=direcci\u00f3n
Transport.address.description=Especifica la direcci\u00f3n a la que se debe efectuar la conexi\u00f3n para el transporte.
Transport.properties.displayName=Propiedades
Transport.properties.description=Propiedades de configuraci\u00f3n especiales para el transporte.  Cada tipo de transporte puede contener propiedades personalizadas especificadas por el proveedor de transporte.  Consulte la documentaci\u00f3n de cada uno de los tipos de transporte para determinar si existen nombres de propiedades de transporte especiales y cu\u00e1les son sus valores posibles.
Transport.external.displayName=Externo
Transport.external.description=Especifica si este transporte es para uso interno o externo.
Transport.sslEnabled.displayName=Habilitado para SSL
Transport.sslEnabled.description=Especifica si se deben proteger las conexiones entre el plug-in de WebSphere y el servidor de aplicaciones con SSL (Secure Socket Layer). El valor por omisi\u00f3n es no utilizar SSL.
Transport.sslConfig.displayName=SSL
Transport.sslConfig.description=Especifica el tipo de valores de Capa de sockets seguros (SSL) de las conexiones entre el plug-in de WebSphere y el servidor de aplicaciones. Las opciones incluyen uno o m\u00e1s valores SSL definidos en el Centro de seguridad, como por ejemplo DefaultSSLSettings, ORBSSLSettings o LDAPSSLSettings.

Property.displayName=Propiedad
Property.description=Especifica parejas de datos arbitrarias de nombre/valor, donde el nombre es una clave de propiedad y el valor es un valor de serie que se puede utilizar para establecer las propiedades internas de configuraci\u00f3n del sistema.
Property.smallIcon=Property.gif
Property.largeIcon=Property32X32.gif
Property.name.displayName=Nombre
Property.name.description=Especifica el nombre (o clave) de la propiedad.
Property.value.displayName=Valor
Property.value.description=Especifica el valor que forma pareja con el nombre especificado.
Property.description.displayName=Descripci\u00f3n
Property.description.description=Proporciona informaci\u00f3n acerca del par nombre-valor.
Property.required.displayName=Necesario
Property.required.description=Atributo opcional que especifica si esta propiedad debe tener un valor.
Property.validationExpression.displayName=Expresi\u00f3n de validaci\u00f3n
Property.validationExpression.description=La consola u otras herramientas utilizan este valor para validar el contenido del valor de esta propiedad.

PropertySet.displayName=Conjunto de propiedades
PropertySet.description=Colecci\u00f3n de propiedades que se utilizan con alg\u00fan objetivo.
PropertySet.smallIcon=PropertySet.gif
PropertySet.largeIcon=PropertySet32X32.gif
PropertySet.properties.displayName=Propiedades
PropertySet.properties.description=Algunos componentes de tiempo de ejecuci\u00f3n permiten una colecci\u00f3n de propiedades adicionales que se pueden utilizar en la personalizaci\u00f3n.  Consulte la documentaci\u00f3n relacionada con el componente de tiempo de ejecuci\u00f3n para determinar si se pueden utilizar propiedades especiales.
PropertySet.properties.TypedProperty.displayName=Propiedades escritas
PropertySet.description.displayName=descripci\u00f3n
PropertySet.description.description=Algunos componentes de tiempo de ejecuci\u00f3n permiten una colecci\u00f3n de propiedades adicionales que se pueden utilizar en la personalizaci\u00f3n.  Consulte la documentaci\u00f3n relacionada con el componente de tiempo de ejecuci\u00f3n para determinar si se pueden utilizar propiedades especiales.

TypedProperty.displayName=Propiedad escrita
TypedProperty.description=Valor de propiedad personalizada.  Consulte la documentaci\u00f3n del componente de tiempo de ejecuci\u00f3n para determinar si hay disponibles otras propiedades personalizadas soportadas.
TypedProperty.smallIcon=TypedProperty.gif
TypedProperty.largeIcon=TypedProperty32X32.gif
TypedProperty.type.displayName=Tipo
TypedProperty.type.description=Tipo plenamente cualificado de Java de esta propiedad (java.lang.Integer, java.lang.Byte).

Library.displayName=Bibliotecas compartidas
Library.description=Especifica una biblioteca compartida por todos los contenedores que puede utilizarse para desplegar aplicaciones.
Library.name.description=Nombre de la biblioteca compartida
Library.description.description=Descripci\u00f3n opcional de esta biblioteca compartida.
Library.classpath.displayName=Classpath
Library.classpath.description=Classpath que contiene los JAR de esta biblioteca. Las entradas de classpath se separan utilizando la tecla INTRO y no deben contener caracteres separadores de v\u00edas de acceso (por ejemplo, ';' o ':').  Las classpath pueden contener nombres de variables (simb\u00f3licos) que se pueden sustituir por una correlaci\u00f3n de variables.
Library.nativepath.displayName=V\u00eda de acceso de biblioteca nativa
Library.nativepath.description=V\u00eda de acceso opcional de las bibliotecas nativas (.dll, .so) necesaria para este biblioteca compartida.

button.addnode=A\u00f1adir nodo
button.removenode=Eliminar nodo
add.node.displayName=A\u00f1adir nodo
add.node.description=Especificar la instancia remota de WebSphere Application Server que se va a a\u00f1adir en la c\u00e9lula. El servidor remoto debe estar en ejecuci\u00f3n. 
add.node.host.displayName=Sistema principal
add.node.host.description=Nombre de red del nodo que se va a a\u00f1adir a la c\u00e9lula. En esta m\u00e1quina debe estar ejecut\u00e1ndose una instancia de WebSphere Application Server. 
add.node.port.displayName=Puerto del conector JMX
add.node.port.description=N\u00famero de puerto del conector JMX de la instancia que se va a a\u00f1adir a la c\u00e9lula. El puerto SOAPConnector por omisi\u00f3n es 8880.
add.node.rmi.port.displayName=Puerto del conector RMI
add.node.rmi.port.description=N\u00famero de puerto del conector RMI de la instancia que se va a a\u00f1adir a la c\u00e9lula. Por omisi\u00f3n, este puerto es 9809.
add.node.include.apps=Incluir aplicaciones
add.node.include.apps.description=Si se selecciona, se realizar\u00e1 un intento de copiar las aplicaciones instaladas en la instancia remota en la c\u00e9lula. No se copiar\u00e1n las aplicaciones con el mismo nombre que las aplicaciones que existen actualmente en la c\u00e9lula.
add.node.connector.displayName=Tipo de conector JMX
add.node.connector.description=Tipo de conector JMX utilizado para realizar la operaci\u00f3n
add.node.soap.displayName=SOAP
add.node.rmi.displayName=RMI
add.node.user.displayName=ID de usuario
add.node.user.description=Debido a que la seguridad est\u00e1 habilitada, debe entrar un ID de usuario y contrase\u00f1a para habilitar la instancia remota de WebSphere a fin comunicarse con el gestor de despliegue
add.node.password.displayName=Contrase\u00f1a
add.node.password.description=Contrase\u00f1a del ID de usuario especificado anteriormente
add.node.null.user.name=El ID de usuario es un par\u00e1metro necesario
add.node.null.password=La contrase\u00f1a es un par\u00e1metro necesario
add.node.status.adding=A\u00f1adiendo nodo
add.node.status.logout=El nuevo nodo no estar\u00e1 disponible en la consola hasta que vuelva a iniciar la sesi\u00f3n
add.node.status.logout.link=Cerrar la sesi\u00f3n de la consola administrativa de WebSphere
remove.node.status.removing=Eliminando nodo
remove.node.status.logout=El nodo aparecer\u00e1 listado en la consola hasta que vuelva a iniciar la sesi\u00f3n

null.host.name=El nombre de sistema principal es un par\u00e1metro necesario
null.port=El puerto es un par\u00e1metro necesario
add.node.failed=Se ha producido un error en la operaci\u00f3n de a\u00f1adir el nodo. Consulte las anotaciones cronol\u00f3gicas del servidor para obtener m\u00e1s detalles. 
add.node.failed.connector.exception=Se ha producido un error en la operaci\u00f3n de a\u00f1adir el nodo porque el gestor de despliegue no se ha podido conectar al servidor remoto. Compruebe los valores de sistema principal y puerto y aseg\u00farese de que se est\u00e9 ejecutando el servidor.
add.node.initiated=El gestor de despliegue ha iniciado la federaci\u00f3n del nodo sobre el sistema principal {0} en la c\u00e9lula. Esta operaci\u00f3n puede tardar unos minutos en completarse. Compruebe el archivo addNode.log en {0} para obtener detalles sobre esta operaci\u00f3n. Tendr\u00e1 que iniciar la sesi\u00f3n de nuevo en la consola despu\u00e9s de completarse la operaci\u00f3n para ver el nuevo nodo en la consola. 
remove.node.initiated=El gestor de despliegue est\u00e1 eliminando {0} de la c\u00e9lula. Esta operaci\u00f3n puede tardar unos minutos en completarse. Tendr\u00e1 que iniciar la sesi\u00f3n de nuevo en la consola despu\u00e9s de completarse la operaci\u00f3n para ver que el nodo se ha eliminado de la lista de nodos disponibles en la consola. 
remove.node.failed=No se ha podido eliminar el nodo {0}. Consulte las anotaciones cronol\u00f3gicas del servidor para obtener m\u00e1s detalles. 
remove.node.node.agent.not.active=El agente de nodo en el nodo {0} no est\u00e1 activo. No se puede eliminar el nodo. 
remote.instance.not.found=Se ha producido un error en la operaci\u00f3n de a\u00f1adir el nodo porque no se ha podido localizar la instancia remota. Compruebe los valores de sistema principal y puerto y aseg\u00farese de que se est\u00e1 ejecutando la instancia remota del servidor de aplicaciones.
sync.request.submitted=Se ha iniciado satisfactoriamente la sincronizaci\u00f3n del dep\u00f3sito en el nodo {0} con el dep\u00f3sito del gestor de despliegue.
node.sync.failed=No se ha podido iniciar la petici\u00f3n de sincronizaci\u00f3n del nodo {0}. Para obtener m\u00e1s informaci\u00f3n, consulte los archivos de anotaciones cronol\u00f3gicas. 
this.node.can.not.be.synchronized=No se puede aplicar la operaci\u00f3n de sincronizaci\u00f3n al nodo del gestor de despliegue {0}
this.node.can.not.be.removed=No se puede aplicar la operaci\u00f3n de eliminaci\u00f3n al nodo del gestor de despliegue {0}
this.node.can.not.be.stopped=No se puede aplicar la operaci\u00f3n de parada al nodo del gestor de despliegue {0}
this.node.already.synchronized=El nodo {0} ya est\u00e1 sincronizado
node.agent.must.be.active.for.sync=La operaci\u00f3n de sincronizaci\u00f3n no se puede realizar en el nodo {0} porque el agente de nodo no est\u00e1 activo
ExecutionState.UNKNOWN=Desconocido
button.sync=Sincronizar
button.syncall=Sincronizar todos
button.fullresync=Resincronizaci\u00f3n completa

plugincfg.generation.failed=Se ha producido un error al actualizar la configuraci\u00f3n del plug-in del servidor Web. Para obtener m\u00e1s informaci\u00f3n, consulte los archivos de anotaciones cronol\u00f3gicas.
plugincfg.generated=La configuraci\u00f3n del plug-in del servidor Web se ha actualizado satisfactoriamente
update.plugincfg=Actualizar configuraci\u00f3n del plug-in del servidor Web

explore.title=<span class="bluebold">WebSphere Application Server </span><span class="purpletext">en IBM.com</span>
explore.link.text=http:// www-3.ibm.com / software / webservers / appserv/
explore.desc=<span class="desctext">Lugar de soporte; incluidos avances, preguntas m\u00e1s frecuentes, sugerencias y consejos,y  notas t\u00e9cnicas.  Tambi\u00e9n est\u00e1n disponibles descargas, biblioteca, noticias y otra informaci\u00f3n de utilidad.</span>

about.title=<label for="abouttext"><spanclass="purplebold">Acerca de </span><span class="graytext">WebSphere Application Server</span></label>
about.link.text=Acceso ayuda
about.build.num=N\u00famero de build:
about.build.date=Fecha de build:

developer.domain.title=<span class="bluebold">WebSphere Developer Domain</span>
developer.domain.link.text=http:// www7b.software.ibm.com / wsdd / 
developer.domain.desc=<span class="desctext">Obtenga los art\u00edculos t\u00e9cnicos m\u00e1s recientes, mejores pr\u00e1cticas, gu\u00edas de aprendizaje y mucho m\u00e1s en <a href="http://www7b.software.ibm.com/wsdd/zones/was/" target="_blank">WebSphere Application Server Zone</a>. Influya en el desarrollo de WebSphere Application Server y <a href="http://www7b.software.ibm.com/webapp/wsdd/wasServlet3" target="_blank">solicite nuevas caracter\u00edsticas de productos</a>.</span>

infocenter.title=<span class="bluebold">InfoCenter</span>
infocenter.link.text=http:// www-3.ibm.com / software / webservers / appserv/
infocenter.desc=<span class="desctext">Fuente completa de documentaci\u00f3n del producto, incluyendo informaci\u00f3n de tareas, consulta y conceptos sobre las caracter\u00edsticas y funciones del producto.</span>
remove.node.title=Eliminar nodo
remove.node.help=Al eliminar un nodo, este desaparecer\u00e1 inmediatamente del dep\u00f3sito de configuraci\u00f3n maestra. Los cambios no se reflejar\u00e1n en el espacio de trabajo hasta que vuelva a iniciar la sesi\u00f3n en la consola. 
remove.node.confirm=Pulse el bot\u00f3n Aceptar para eliminar los nodos siguientes, o bien pulse el bot\u00f3n Cancelar para volver a la p\u00e1gina anterior. 
remove.node.only.select.one.node=La operaci\u00f3n de eliminaci\u00f3n de nodos s\u00f3lo puede efectuarse en un nodo a la vez
download.plugincfg=Ver o bajar el archivo de configuraci\u00f3n del plug-in del servidor Web actual

