# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided. 
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.50,0,02/07/10,12:51:45
#
#CMVCPATHNAME ws/code/webui.environment/src/environment/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE

nav.webSphere.environment.configuration=Environnement
nav.view.virtual.hosts=H\u00f4tes virtuels  
nav.view.name.space.bindings=Liaisons de l'espace de nom
nav.view.libraries=Biblioth\u00e8ques partag\u00e9es

environment.label.string=Cha\u00eene
environment.label.ejb=EJB
environment.label.corba=CORBA
environment.label.indirect=Indirect
environment.label.name=Nom
environment.label.description=Description
environment.label.scope=Port\u00e9e

error.virtualhost.not.found=H\u00f4te virtuel introuvable.
error.duplicate.virtualhost.name=<span class\="validation-error">Erreur \: L'h\u00f4te virtuel "{0}" existe d\u00e9j\u00e0.</span><br>
warning.virtualhost.name.change=La modification des param\u00e8tres de l'h\u00f4te virtuel peut affecter des applications cens\u00e9es s'ex\u00e9cuter sur cet h\u00f4te. Vous devez manuellement revoir les mappages d'h\u00f4tes virtuels de chaque application pour v\u00e9rifier qu'ils sont corrects.
error.noMimeEntry=<li>Type MIME manquant</li>
error.mimeentry.not.found=L'entr\u00e9e MIME est introuvable.
error.hostalias.not.found=L'alias h\u00f4te est introuvable.
error.variable.not.found=La variable est introuvable.
missing.required.values=Valeurs obligatoires manquantes
warning.duplicate.namespacebinding.name=<span class\="validation-warn-info">Avertissement \: L'ID de liaison "{0}" existe d\u00e9j\u00e0 dans cette port\u00e9e.</span><br>
warning.duplicate.namespacebinding.nameInNameSpace=<span class\="validation-warn-info">Avertissement \: Une liaison dont le nom figure dans l'espace-nom "{0}"  est d\u00e9j\u00e0 configur\u00e9e dans cette port\u00e9e.</span><br>
error.namespacebinding.not.found=La liaison de l'espace-nom est introuvable.
error.library.not.found=La biblioth\u00e8que est introuvable.
error.node.not.found=Le noeud est introuvable.
error.replicators.not.defined=Des r\u00e9plicateurs ne sont pas d\u00e9finis pour un ou plusieurs domaines.
error.replicators.dont.exist=Aucun r\u00e9plicateur n'est d\u00e9fini pour les domaines existants.

VirtualHost.displayName=H\u00f4tes virtuels
VirtualHost.description=Configuration pour transformer un syst\u00e8me h\u00f4te en plusieurs syst\u00e8mes h\u00f4te. Chaque h\u00f4te virtuel poss\u00e8de un nom logique et une liste d'alias DNS utilis\u00e9e pour le reconna\u00eetre. 
VirtualHost.smallIcon=VirtualHost.gif
VirtualHost.largeIcon=VirtualHost32X32.gif
VirtualHost.name.description=Permet de sp\u00e9cifier un nom logique utilis\u00e9 pour configurer des applications Web pour un nom d'h\u00f4te particulier. L'h\u00f4te virtuel par d\u00e9faut peut s'adapter aux configurations les plus simples.
VirtualHost.aliases.displayName= Alias d'h\u00f4te
VirtualHost.aliases.description=Liste d'un ou de plusieurs alias DN utilis\u00e9s pour reconna\u00eetre l'h\u00f4te virtuel.
VirtualHost.mimeTypes.displayName=Types MIME
VirtualHost.mimeTypes.description=Collection de mappages d'extensions de type MIME d\u00e9finis pour l'h\u00f4te virtuel. Si les entr\u00e9es MIME ne sont pas sp\u00e9cifi\u00e9es au niveau du module Web, ces entr\u00e9es MIME s'appliquent.
virtual.host.must.be.selected=Vous devez s\u00e9lectionner au moins un h\u00f4te virtuel pour effectuer cette action.

MimeEntry.displayName=Type MIME
MimeEntry.description=Configuration pour le mappage des types MIME vers les extensions.
MimeEntry.smallIcon=MimeEntry.gif
MimeEntry.largeIcon=MimeEntry32X32.gif
MimeEntry.type.description=Indique un type MIME auquel correspondent les extensions de noms de fichiers du type.
MimeEntry.extensions.displayName=Extensions
MimeEntry.extensions.description=R\u00e9pertorie les extensions de fichier correspondant au type MIME.
HostAlias.displayName=Nom d'h\u00f4te
HostAlias.description=Un alias repr\u00e9sente l'h\u00f4te DNS et le num\u00e9ro de port utilis\u00e9s par un client pour former la demande d'URL d'une ressource d'application Web (tel qu'un servlet, page JSP ou HTML). Par exemple, il s'agit de "monh\u00f4te:8080" dans http://monh\u00f4te:8080/servlet/snoop. Lorsqu'aucun num\u00e9ro de port n'est indiqu\u00e9, la valeur 80 est utilis\u00e9e par d\u00e9faut.
HostAlias.smallIcon=HostAlias.gif
HostAlias.largeIcon=HostAlias32X32.gif
HostAlias.hostname.description=Adresse IP, nom d'h\u00f4te DNS avec le suffixe de nom de domaine ou uniquement le nom d'h\u00f4te DNS, utilis\u00e9s par un client pour demander une ressource d'application Web (servlet, page JSP ou HTML).
HostAlias.port.displayName=Port
HostAlias.port.description=Port pour lequel le serveur Web a \u00e9t\u00e9 configur\u00e9 pour accepter les demandes client. Indiquez une valeur de port avec le nom d'h\u00f4te.

plugincfg.title=Mise \u00e0 jour du plug-in du serveur Web
plugincfg.description=Cliquez sur le bouton OK pour mettre \u00e0 jour le fichier de configuration du plug-in.
plugincfg.help=Le fichier de configuration du serveur Web contr\u00f4le le contenu transf\u00e9r\u00e9 entre le serveur Web et un serveur d'applications. Ce fichier doit \u00eatre r\u00e9g\u00e9n\u00e9r\u00e9 lorsque les configurations d\u00e9finies pour les alias des h\u00f4tes virtuels, le transport HTTP, les clusters et le serveur sont modifi\u00e9es. Le fichier plugin-cfg.xml g\u00e9n\u00e9r\u00e9 est plac\u00e9 dans le r\u00e9pertoire config de l'installation WebSphere. Si le serveur Web se trouve sur un syst\u00e8me \u00e9loign\u00e9, vous devez d\u00e9placer manuellement ce fichier sur ce syst\u00e8me. 

nav.view.variable.substitution.entry=Gestions des variables WebSphere
VariableSubstitutionEntry.displayName=Variables WebSphere
VariableSubstitutionEntry.description=Les variables de substitution permettent de sp\u00e9cifier un niveau d'adressage indirect pour les valeurs d\u00e9finies dans le syst\u00e8me, telles que les r\u00e9pertoires racine du syst\u00e8me de fichiers. Les variables peuvent \u00eatre d\u00e9finies au niveau du serveur, du noeud ou de la cellule. Lorsque des variables de diff\u00e9rents environnements portent le m\u00eame nom, l'ordre de r\u00e9solution est le suivant : variables de serveur, variables de noeud, variables de cellule.
VariableSubstitutionEntry.smallIcon=VariableSubstitutionEntry.gif
VariableSubstitutionEntry.largeIcon=VariableSubstitutionEntry32X32.gif
VariableSubstitutionEntry.symbolicName.description=Indique le nom symbolique repr\u00e9sentant un chemin physique ou une racine d'URL.
VariableSubstitutionEntry.value.displayName=Valeur
VariableSubstitutionEntry.value.description=Indique le chemin absolu repr\u00e9sent\u00e9 par le nom symbolique.
VariableSubstitutionEntry.description.description=Fournit une description facultative de vos enregistrements administratifs.

NameSpaceBinding.displayName=Liaisons de l'espace de nom
NameSpaceBinding.description=Cette page permet de configurer une liaison de nom sur un bean enterprise, un contexte de d\u00e9nomination CORBA CosNaming ou l'objet de noeud feuille CORBA, objet pouvant \u00eatre recherch\u00e9 \u00e0 l'aide de JNDI ou d'une valeur de cha\u00eene constante.
NameSpaceBinding.smallIcon=NameSpaceBinding.gif
NameSpaceBinding.largeIcon=NameSpaceBinding32X32.gif
NameSpaceBinding.name.displayName=ID de liaison
NameSpaceBinding.name.description=Nom donn\u00e9 pour identifier de mani\u00e8re unique cette liaison configur\u00e9e.
NameSpaceBinding.nameInNameSpace.displayName=Nom dans l'espace nom
NameSpaceBinding.nameInNameSpace.description=Nom utilis\u00e9 pour cette liaison dans l'espace de nom. Nom simple ou compos\u00e9 relatif \u00e0 la partie de l'espace de nom dans laquelle la liaison est configur\u00e9e.
NameSpaceBinding.bindingType.description=Type de liaison configur\u00e9. Les options autoris\u00e9es sont String, EJB, CORBA et Indirect.
NameSpaceBinding.bindingType.displayName=Type de liaison
NameSpaceBinding.namingContext.description=Port\u00e9e de la liaison configur\u00e9e. Cette valeur indique l'emplacement de la configuration du fichier namebindings.xml.
EjbNameSpaceBinding.displayName=EjbNameSpaceBinding
EjbNameSpaceBinding.description=Cette page permet de configurer une liaison de nom de l'interface Home du bean enterprise qui a d\u00e9j\u00e0 \u00e9t\u00e9 configur\u00e9e sur un serveur de la cellule.
EjbNameSpaceBinding.smallIcon=EjbNameSpaceBinding.gif
EjbNameSpaceBinding.largeIcon=EjbNameSpaceBinding32X32.gif
EjbNameSpaceBinding.ejbJndiName.displayName=Nom JNDI
EjbNameSpaceBinding.ejbJndiName.description=Nom JNDI du bean entreprise d\u00e9ploy\u00e9 (nom JNDI du bean indiqu\u00e9 dans les liaisons du bean enterprise, pas le nom java:comp).
EjbNameSpaceBinding.applicationServerName.displayName=Serveur
EjbNameSpaceBinding.applicationServerName.description=Nom du serveur en grappe ou du serveur standard sur lequel le bean est configur\u00e9.
EjbNameSpaceBinding.applicationNodeName.displayName=Noeud
EjbNameSpaceBinding.serverCluster.displayName=Cluster de serveurs
EjbNameSpaceBinding.singleServer.displayName=Serveur unique (le noeud est requis)
EjbNameSpaceBinding.bindingLocation.displayName=Emplacement du bean enterprise
EjbNameSpaceBinding.bindingLocation.description=Indique l'emplacement du bean enterprise.
EjbNameSpaceBinding.bindingLocation.description.base=Indique l'emplacement du bean enterprise en fournissant le m\u00eame nom de noeud.
EjbNameSpaceBinding.bindingLocation.description.nd=Sp\u00e9cifiez l'emplacement du bean enterprise. Si le bean enterprise est en cours d'ex\u00e9cution dans un cluster de serveurs, s\u00e9lectionnez Cluster de serveurs. Sinon, s\u00e9lectionnez Serveur unique et indiquez le nom du noeud.
CORBAObjectNameSpaceBinding.displayName=CORBAObjectNameSpaceBinding
CORBAObjectNameSpaceBinding.description=Cette page permet de configurer une liaison de nom d'une interface Home CORBA qui a d\u00e9j\u00e0 \u00e9t\u00e9 configur\u00e9e sur un serveur de la cellule.
CORBAObjectNameSpaceBinding.smallIcon=CORBAObjectNameSpaceBinding.gif
CORBAObjectNameSpaceBinding.largeIcon=CORBAObjectNameSpaceBinding32X32.gif
CORBAObjectNameSpaceBinding.corbanameUrl.displayName=URL Corbaname
CORBAObjectNameSpaceBinding.corbanameUrl.description=Cha\u00eene URL CORBA identifiant l'emplacement de liaison de l'objet dans un serveur CosNaming.
CORBAObjectNameSpaceBinding.federatedContext.displayName=Contexte f\u00e9d\u00e9r\u00e9
CORBAObjectNameSpaceBinding.federatedContext.description=Si cette option est s\u00e9lectionn\u00e9e, la cible est un contexte CosNaming. Si cette option n'est pas s\u00e9lectionn\u00e9e, la cible est un objet de noeud feuille.
IndirectLookupNameSpaceBinding.displayName=IndirectLookupNameSpaceBinding
IndirectLookupNameSpaceBinding.description=Cette page permet de configurer une liaison de nom d'un objet qui peut \u00eatre recherch\u00e9e \u00e0 l'aide de JNDI.
IndirectLookupNameSpaceBinding.smallIcon=IndirectLookupNameSpaceBinding.gif
IndirectLookupNameSpaceBinding.largeIcon=IndirectLookupNameSpaceBinding32X32.gif
IndirectLookupNameSpaceBinding.providerURL.displayName=URL du fournisseur
IndirectLookupNameSpaceBinding.providerURL.description=La cha\u00eene d'URL de fournisseur doit obtenir un contexte d'origine JNDI.
IndirectLookupNameSpaceBinding.jndiName.displayName=Nom JNDI
IndirectLookupNameSpaceBinding.jndiName.description=Nom permettant de rechercher l'objet \u00e0 cible partir du contexte d'origine.
StringNameSpaceBinding.displayName=StringNameSpaceBinding
StringNameSpaceBinding.description=Cette page permet de configurer une liaison de nom d'une valeur de cha\u00eene constante.
StringNameSpaceBinding.smallIcon=StringNameSpaceBinding.gif
StringNameSpaceBinding.largeIcon=StringNameSpaceBinding32X32.gif
StringNameSpaceBinding.stringToBind.displayName=Valeur de cha\u00eene
StringNameSpaceBinding.stringToBind.description=Cha\u00eene \u00e0 lier \u00e0 l'espace de nom.
NameSpaceBinding.create.new=Nouvelle liaison d'espace de nom
NameSpaceBinding.create.new.description=Cet assistant permet de configurer une nouvelle liaison d'espace nom.
NameSpaceBinding.new.step1=Sp\u00e9cification du type de liaison
NameSpaceBinding.new.step2.ejb=Sp\u00e9cification des propri\u00e9t\u00e9s de base
NameSpaceBinding.new.step2.corba=Sp\u00e9cification des propri\u00e9t\u00e9s de base
NameSpaceBinding.new.step2.indirect=Sp\u00e9cification des propri\u00e9t\u00e9s de base
NameSpaceBinding.new.step2.string=Sp\u00e9cification des propri\u00e9t\u00e9s de base
NameSpaceBinding.new.step3=R\u00e9capitulatif

Node.displayName=Noeud
Node.description=Liste de noeuds de cette cellule. Vous pouvez ajouter des noeuds \u00e0 la cellule en cliquant sur l'option permettant d'ajouter un noeud et en indiquant une instance WebSphere Application Server en cours d'ex\u00e9cution.
Node.largeIcon=Node32X32.gif
Node.properties.displayName=Propri\u00e9t\u00e9s personnalis\u00e9es
Node.properties.description=Propri\u00e9t\u00e9s de configuration arbitraire qui s'appliquent \u00e0 ce noeud.
Node.name.displayName=Nom
Node.name.description=D\u00e9finit un nom logique pour le noeud. Le nom doit \u00eatre unique dans la cellule.
Node.status.displayName=Etat
Node.synchronized=Synchronis\u00e9
Node.not.synchronized=Non synchronis\u00e9
Node.discoveryProtocol.displayName=Protocole de reconnaissance
Node.discoveryProtocol.description=D\u00e9finit le protocole suivi par le noeud pour extraire des informations \u00e0 partir d'un r\u00e9seau.
Cell.nodes.displayName=Noeuds
Cell.nodes.description=Noeuds d\u00e9finis cette cellule
Cell.displayName=Cellule
Cell.description=Groupe logique de noeuds WebSphere d\u00e9di\u00e9 \u00e0 l'administration commune.
Cell.largeIcon=Cell32X32.gif
Cell.foreignCells.displayName=Cellules externes
Cell.foreignCells.description=Le domaine contient une collection d'objets Domain \u00e9trangers pouvant \u00eatre utilis\u00e9s pour acc\u00e9der \u00e0 un domaine diff\u00e9rent.  
Cell.properties.displayName=Propri\u00e9t\u00e9s personnalis\u00e9es
Cell.properties.description=Propri\u00e9t\u00e9s de configuration arbitraire qui s'appliquent \u00e0 cette cellule.
Cell.name.displayName=Nom
Cell.name.description=D\u00e9finit le nom de la cellule existante.
Cell.cellDiscoveryProtocol.displayName=Protocole de reconnaissance des cellules
Cell.cellDiscoveryProtocol.description=D\u00e9finit le protocole suivi pour l'extraction d'information d'un r\u00e9seau.
Cell.discoveryAddressEndpointName.displayName=Nom du noeud final de l'adresse de reconnaissance
Cell.discoveryAddressEndpointName.description=D\u00e9finit le nom du noeud final qui contient l'adresse de d\u00e9couverte.
Cell.multicastDiscoveryAddressEndpointName.displayName=Nom du noeud final de l'adresse de reconnaissance multidiffusion
Cell.multicastDiscoveryAddressEndpointName.description=D\u00e9finit le nom du noeud final qui contient l'adresse de d\u00e9couverte de multidiffusion.

EndPoint.displayName=Noeud final
EndPoint.description=Noeud final de communication utilis\u00e9 par des services ou des composants d'ex\u00e9cution s'ex\u00e9cutant sur un processus.
EndPoint.smallIcon=EndPoint.gif
EndPoint.largeIcon=EndPoint32X32.gif
EndPoint.host.displayName=H\u00f4te
EndPoint.host.description=Adresse IP, nom d'h\u00f4te DNS avec le suffixe de nom de domaine ou uniquement le nom d'h\u00f4te DNS, utilis\u00e9s par un client pour demander une ressource d'application Web (servlet, page JSP ou HTML).
EndPoint.port.displayName=Port
EndPoint.port.description=Port pour lequel le serveur Web a \u00e9t\u00e9 configur\u00e9 pour accepter les demandes client. Indiquez une valeur de port avec le nom d'h\u00f4te.

TCPIPProtocolType.UDP=UDP
TCPIPProtocolType.TCP=TCP
TCPIPProtocolType.MULTICAST=MULTICAST

Transport.displayName=Transport
Transport.description=Les processus du serveur peuvent supporter diff\u00e9rents transports pour IPC. Les processus client se connectent au serveur \u00e0 l'aide de l'un des transports support\u00e9s par les serveurs.
Transport.smallIcon=Transport.gif
Transport.largeIcon=Transport32X32.gif
Transport.address.displayName=adresse
Transport.address.description=Indique l'adresse \u00e0 laquelle se connecter pour le transport.
Transport.properties.displayName=Propri\u00e9t\u00e9s
Transport.properties.description=Propri\u00e9t\u00e9s de configuration sp\u00e9ciales pour le transport. Chaque type de transport peut contenir des propri\u00e9t\u00e9s personnalis\u00e9es sp\u00e9cifi\u00e9es par le fournisseur de transport. Consultez la documentation de chaque type de transport pour d\u00e9terminer s'il y a des noms de propri\u00e9t\u00e9s de transport sp\u00e9ciales et quelles sont les valeurs possibles de ces propri\u00e9t\u00e9s.
Transport.external.displayName=Externe
Transport.external.description=Indique si le transport est destin\u00e9 \u00e0 une utilisation interne ou externe.
Transport.sslEnabled.displayName=SSL activ\u00e9
Transport.sslEnabled.description=Indique si les connexions entre le plug-in WebSphere et le serveur d'applications doivent \u00eatre prot\u00e9g\u00e9es avec SSL (Secure Socket Layer) Par d\u00e9faut, SSL n'est pas utilis\u00e9.
Transport.sslConfig.displayName=SSL
Transport.sslConfig.description=D\u00e9finit le type de param\u00e8tre SSL (Secure Socket Layer) pour les connexions entre le plug-in WebSphere et le serveur d'applications. Les options incluent un ou plusieurs param\u00e8tres SSL d\u00e9finis dans le centre de s\u00e9curit\u00e9, comme DefaultSSLSettings, ORBSSLSettings ou LDAPSSLSettings.

Property.displayName=Propri\u00e9t\u00e9
Property.description=Sp\u00e9cifie des paires de donn\u00e9es nom-valeur arbitraires, le nom \u00e9tant une cl\u00e9 de propri\u00e9t\u00e9 et la valeur \u00e9tant une cha\u00eene pouvant \u00eatre utilis\u00e9e pour d\u00e9finir les propri\u00e9t\u00e9s de configuration interne du syst\u00e8me.
Property.smallIcon=Property.gif
Property.largeIcon=Property32X32.gif
Property.name.displayName=Nom
Property.name.description=Sp\u00e9cifie le nom (ou la cl\u00e9) de la propri\u00e9t\u00e9.
Property.value.displayName=Valeur
Property.value.description=Sp\u00e9cifie la valeur associ\u00e9e au nom indiqu\u00e9.
Property.description.displayName=Description
Property.description.description=Fournit des informations sur la paire nom/valeur.
Property.required.displayName=Requise
Property.required.description=Attribut facultatif indiquant si la propri\u00e9t\u00e9 est requise pour avoir une valeur.
Property.validationExpression.displayName=Expression de validation
Property.validationExpression.description=La console ou d'autres outils utilisent cette valeur pour valider le contenu de la valeur de cette propri\u00e9t\u00e9.

PropertySet.displayName=Ensemble de propri\u00e9t\u00e9s
PropertySet.description=Collection de propri\u00e9t\u00e9s utilis\u00e9es dans certains buts.
PropertySet.smallIcon=PropertySet.gif
PropertySet.largeIcon=PropertySet32X32.gif
PropertySet.properties.displayName=Propri\u00e9t\u00e9s
PropertySet.properties.description=Certains composants d'ex\u00e9cution permettent la collecte de propri\u00e9t\u00e9s suppl\u00e9mentaires qui peuvent \u00eatre utilis\u00e9es pour une personnalisation ult\u00e9rieure. Reportez-vous \u00e0 la documentation relative au composant d'ex\u00e9cution pour d\u00e9finir si des propri\u00e9t\u00e9s sp\u00e9ciales peuvent \u00eatre utilis\u00e9es.
PropertySet.properties.TypedProperty.displayName=Propri\u00e9t\u00e9s saisies
PropertySet.description.displayName=description
PropertySet.description.description=Certains composants d'ex\u00e9cution permettent la collecte de propri\u00e9t\u00e9s suppl\u00e9mentaires qui peuvent \u00eatre utilis\u00e9es pour une personnalisation ult\u00e9rieure. Reportez-vous \u00e0 la documentation relative au composant d'ex\u00e9cution pour d\u00e9finir si des propri\u00e9t\u00e9s sp\u00e9ciales peuvent \u00eatre utilis\u00e9es.

TypedProperty.displayName=Propri\u00e9t\u00e9 saisie
TypedProperty.description=Valeur de propri\u00e9t\u00e9 personnalis\u00e9e. Consultez la documentation du composant d'ex\u00e9cution pour d\u00e9finir si des propri\u00e9t\u00e9s personnalis\u00e9es suppl\u00e9mentaires et prises en charge sont disponibles.
TypedProperty.smallIcon=TypedProperty.gif
TypedProperty.largeIcon=TypedProperty32X32.gif
TypedProperty.type.displayName=Type
TypedProperty.type.description=Type Java qualifi\u00e9 complet de cette propri\u00e9t\u00e9 (java.lang.Integer ou java.lang.Byte).

Library.displayName=Biblioth\u00e8ques partag\u00e9es
Library.description=D\u00e9finit une biblioth\u00e8que partag\u00e9e au niveau du serveur pouvant \u00eatre utilis\u00e9e par des applications d\u00e9ploy\u00e9es.
Library.name.description=Nom de la biblioth\u00e8que partag\u00e9e
Library.description.description=Description facultative de la biblioth\u00e8que partag\u00e9e.
Library.classpath.displayName=Chemin d'acc\u00e8s aux classes
Library.classpath.description=Chemin d'acc\u00e8s aux classes contenant le(s) fichier(s) JAR de cette biblioth\u00e8que. Les entr\u00e9es du chemin d'acc\u00e8s aux classes sont s\u00e9par\u00e9es \u00e0 l'aide de la touche ENTREE et ne doivent pas contenir des s\u00e9parateurs (tels que ; ou :). Les chemins d'acc\u00e8s aux classes peuvent contenir des noms variables (symboliques) pouvant \u00eatre substitu\u00e9s par une mappe de variables.
Library.nativepath.displayName=Chemin d'acc\u00e8s aux biblioth\u00e8ques natives
Library.nativepath.description=Chemin facultatif d'acc\u00e8s aux biblioth\u00e8ques natives  (.dll's, .so's) requises par cette biblioth\u00e8que partag\u00e9e.

button.addnode=Ajouter un noeud
button.removenode=Supprimer un noeud
add.node.displayName=Ajouter un noeud
add.node.description=D\u00e9finit une instance \u00e9loign\u00e9e WebSphere Application Server \u00e0 ajouter \u00e0 la cellule. Le serveur \u00e9loign\u00e9 doit \u00eatre en cours d'ex\u00e9cution. 
add.node.host.displayName=H\u00f4te
add.node.host.description=Nom r\u00e9seau du noeud \u00e0 ajouter \u00e0 la cellule. Une instance WebSphere Application Server doit \u00eatre en cours d'ex\u00e9cution sur cette machine. 
add.node.port.displayName=Port du connecteur JMX
add.node.port.description=Num\u00e9ro de port du connecteur JMX de l'instance \u00e0 ajouter \u00e0 la cellule. Le port SOAPConnector par d\u00e9faut est 8880.
add.node.rmi.port.displayName=Port du connecteur RMI
add.node.rmi.port.description=Num\u00e9ro de port du connecteur RMI de l'instance \u00e0 ajouter \u00e0 la cellule. Par d\u00e9faut, il s'agit du port 9809.
add.node.include.apps=Inclusion d'applications
add.node.include.apps.description=Si cette option est s\u00e9lectionn\u00e9e, le syst\u00e8me tente de copier les installations install\u00e9es sur l'instance distante dans la cellule. Les applications portant le m\u00eame \
nom que des applications existantes dans la cellule ne seront pas copi\u00e9es.
add.node.connector.displayName=Type de connecteur JMX
add.node.connector.description=Type du connecteur JMX utilis\u00e9 pour effectuer l'op\u00e9ration
add.node.soap.displayName=SOAP
add.node.rmi.displayName=RMI
add.node.user.displayName=ID utilisateur
add.node.user.description=Comme la s\u00e9curit\u00e9 est activ\u00e9e, vous devez entrer un ID utilisateur et un mot de passe afin d'activer l'instance WebSphere distante pour communiquer avec le gestionnaire de d\u00e9ploiement.
add.node.password.displayName=Mot de passe
add.node.password.description=Mot de passe correspondant \u00e0 l'ID utilisateur entr\u00e9e plus haut.
add.node.null.user.name=L'ID utilisateur est un param\u00e8tre obligatoire
add.node.null.password=Le mot de passe est un param\u00e8tre obligatoire
add.node.status.adding=Ajout d'un noeud en cours
add.node.status.logout=Le nouveau noeud ne sera pas disponible dans la console tant que vous ne vous y connectez pas \u00e0 nouveau.
add.node.status.logout.link=D\u00e9connexion de la console d'administration WebSphere.
remove.node.status.removing=Suppression du noeud en cours
remove.node.status.logout=Le noeud est r\u00e9pertori\u00e9 dans la console tant que vous ne vous y connectez pas \u00e0 nouveau.

null.host.name=Le nom d'h\u00f4te est un param\u00e8tre requis
null.port=Le port est un param\u00e8tre requis
add.node.failed=L'op\u00e9ration d'ajout de noeud n'a pas abouti. Pour obtenir plus d'informations, reportez-vous aux journaux du serveur. 
add.node.failed.connector.exception=L'op\u00e9ration d'ajout de noeud a \u00e9chou\u00e9 car le gestionnaire de d\u00e9ploiement n'a pas pu se connecter au serveur distant. V\u00e9rifiez les valeurs du nom d'h\u00f4te et du port et assurez-vous que le serveur est en cours d'ex\u00e9cution.
add.node.initiated=Le gestionnaire de d\u00e9ploiement a lanc\u00e9 la f\u00e9d\u00e9ration du noeud sur l'h\u00f4te {0} dans la cellule. Cette op\u00e9ration peut prendre plusieurs minutes. Pour obtenir plus de d\u00e9tails sur cette op\u00e9ration, consultez le fichier addNode.log sur {0}. Une fois l'op\u00e9ration termin\u00e9, vous devez vous connecter \u00e0 la console \u00e0 nouveau pour voir le nouveau noeud dans la console. 
remove.node.initiated=Le gestionnaire de d\u00e9ploiement supprime {0} de la cellule. Cette op\u00e9ration peut prendre plusieurs minutes. Une fois l'op\u00e9ration termin\u00e9, vous devez vous connecter \u00e0 nouveau \u00e0 la console pour voir dans la console que les noeuds ont \u00e9t\u00e9 supprim\u00e9s de la liste des noeuds disponibles. 
remove.node.failed=La suppression du noeud {0} n'a pas abouti. Pour obtenir plus d'informations, reportez-vous aux journaux du serveur. 
remove.node.node.agent.not.active=L'agent de noeud sur le noeud {0} n'est pas actif. Ce noeud ne peut pas \u00eatre supprim\u00e9. 
remote.instance.not.found=L'op\u00e9ration d'ajout de noeud n'a pas abouti car il n'a pas \u00e9t\u00e9 possible de localiser l'instance \u00e9loign\u00e9e. V\u00e9rifiez les valeurs de l'h\u00f4te et du port et assurez-vous que l'instance du serveur d'applications \u00e9loign\u00e9e est en cours d'ex\u00e9cution.
sync.request.submitted=Le lancement de la synchronisation du r\u00e9f\u00e9rentiel sur le noeud {0} avec le r\u00e9f\u00e9rentiel du gestionnaire de d\u00e9ploiement a abouti.
node.sync.failed=Le lancement de la demande de synchronisation du noeud {0} n'a pas abouti. V\u00e9rifiez les fichiers journaux pour obtenir plus de d\u00e9tails. 
this.node.can.not.be.synchronized=L'op\u00e9ration de synchronisation ne s'applique pas au noeud du gestionnaire de d\u00e9ploiement {0}.
this.node.can.not.be.removed=L'op\u00e9ration de suppression ne s'applique pas au noeud du gestionnaire de d\u00e9ploiement {0}.
this.node.can.not.be.stopped=L'op\u00e9ration d'arr\u00eat ne s'applique pas au noeud du gestionnaire de d\u00e9ploiement {0}.
this.node.already.synchronized=Le noeud {0} est d\u00e9j\u00e0 synchronis\u00e9
node.agent.must.be.active.for.sync=L'op\u00e9ration de synchronisation ne peut pas \u00eatre effectu\u00e9e sur le noeud {0} car son agent de noeud n'est pas actif.
ExecutionState.UNKNOWN=Inconnu
button.sync=Synchroniser
button.syncall=Tout synchroniser
button.fullresync=Resynchronisation compl\u00e8te

plugincfg.generation.failed=Une erreur s'est produite lors de la mise \u00e0 jour de la configuration du plug-in du serveur Web. V\u00e9rifiez les fichiers journaux pour obtenir plus de d\u00e9tails.
plugincfg.generated=La mise \u00e0 jour de la configuration du plug-in du serveur Web a abouti
update.plugincfg=Mise \u00e0 jour de la configuration du plug-in du serveur Web

explore.title=<span class="bluebold">WebSphere Application Server </span><span class="purpletext">sur IBM.com</span>
explore.link.text=http:// www-3.ibm.com / software / webservers / appserv/
explore.desc=<span class="desctext">Emplacement du support, comprenant des flashs WebSphere, des forums de questions, des conseils et des astuces ainsi que des notes techniques. Il permet \u00e9galement des t\u00e9l\u00e9chargements, contient une biblioth\u00e8que et des nouvelles ainsi que d'autres informations utiles.</span>

about.title=<label for="abouttext"><spanclass="purplebold">A propos </span><span class="graytext">de votre WebSphere Application Server</span></label>
about.link.text=Acc\u00e9der \u00e0 l'aide
about.build.num=Num\u00e9ro de g\u00e9n\u00e9ration :
about.build.date=Date de g\u00e9n\u00e9ration :

developer.domain.title=<span class="bluebold">WebSphere Developer Domain</span>
developer.domain.link.text=http:// www7b.software.ibm.com / wsdd / 
developer.domain.desc=<span class="desctext">Ce site comporte les articles techniques les plus r\u00e9cents, les meilleurs exercices et tutoriels ainsi que d'autres informations dans <a href="http://www7b.software.ibm.com/wsdd/zones/was/" target="_blank">WebSphere Application Server Zone</a>. Vous pouvez influencer l'\u00e9volution de WebSphere Application Server et <a href="http://www7b.software.ibm.com/webapp/wsdd/wasServlet3" target="_blank">demander de nouvelles fonctions</a>.</span>

infocenter.title=<span class="bluebold">InfoCenter</span>
infocenter.link.text=http:// www-3.ibm.com / software / webservers / appserv/
infocenter.desc=<span class="desctext">Source compl\u00e8te sur la documentation du produit. Comporte notamment les t\u00e2ches, les r\u00e9f\u00e9rences et des informations de concept sur les fonctions et fonctionnalit\u00e9s du produit.</span>
remove.node.title=Supprimer un noeud
remove.node.help=Si vous supprimez un noeud, il est supprim\u00e9 imm\u00e9diatement du r\u00e9f\u00e9rentiel de configuration ma\u00eetre. Les modifications ne seront pas refl\u00e9t\u00e9es dans votre espace de travail tant que vous ne vous serez pas reconnect\u00e9 \u00e0 la console. 
remove.node.confirm=Cliquez sur le bouton OK pour supprimer les noeuds suivants ou sur Annuler pour retourner \u00e0 la page pr\u00e9c\u00e9dente. 
remove.node.only.select.one.node=L'op\u00e9ration de suppression de noeud ne peut \u00eatre r\u00e9alis\u00e9e que sur un seul noeud \u00e0 la fois.
download.plugincfg=Affichez ou t\u00e9l\u00e9chargez le fichier de configuration du plug-in du serveur Web actuel.

