# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided. 
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.50,0,02/07/10,12:51:45
#
#CMVCPATHNAME ws/code/webui.environment/src/environment/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE

nav.webSphere.environment.configuration=Umgebung
nav.view.virtual.hosts=Virtuelle Hosts

nav.view.name.space.bindings=Namespace-Bindungen
nav.view.libraries=Gemeinsame Bibliotheken

environment.label.string=Zeichenfolge
environment.label.ejb=EJB
environment.label.corba=CORBA
environment.label.indirect=Indirekt
environment.label.name=Name
environment.label.description=Beschreibung
environment.label.scope=Bereich

error.virtualhost.not.found=Der virtuelle Host wurde nicht gefunden.
error.duplicate.virtualhost.name=<span class\="validation-error">Fehler\: Der virtuelle Host "{0}" ist bereits vorhanden. </span><br>
warning.virtualhost.name.change=Wenn Sie die Einstellungen dieses virtuellen Host \u00e4ndern, hat dies m\u00f6glicherweise Auswirkungen auf die Anwendungen, die derzeit auf diesem Host ausgef\u00fchrt werden. Sie m\u00fcssen die VirtualHost-Zuordnungen jeder Anwendung \u00fcberpr\u00fcfen, um sicherzustellen, dass sie korrekt sind.
error.noMimeEntry=<li>Fehlender MIME-Typ</li>
error.mimeentry.not.found=Der MIME-Eintrag wurde nicht gefunden.
error.hostalias.not.found=Der Hostaliasname wurde nicht gefunden.
error.variable.not.found=Die Variable wurde nicht gefunden.
missing.required.values=Erforderliche Werte fehlen
warning.duplicate.namespacebinding.name=<span class\="validation-warn-info">Warnung\: Die Bindungs-ID "{0}" ist bereits in diesem Bereich vorhanden. </span><br>
warning.duplicate.namespacebinding.nameInNameSpace=<span class\="validation-warn-info">Warnung:\: Es ist bereits eine Bindung mit diesem Namen im Namespace "{0}" f\u00fcr diesen Bereich konfiguriert.</span><br>
error.namespacebinding.not.found=Die Namespace-Bindung wurde nicht gefunden.
error.library.not.found=Die Bibliothek wurde nicht gefunden.
error.node.not.found=Der Knoten wurde nicht gefunden.
error.replicators.not.defined=F\u00fcr mindestens eine Dom\u00e4ne wurden keine Replikatoren definiert.
error.replicators.dont.exist=F\u00fcr keine der vorhandenen Dom\u00e4nen wurden Replikatoren definiert.

VirtualHost.displayName=Virtuelle Hosts
VirtualHost.description=Verwenden Sie diese Option, um eine einzelne Hostmaschine so zu konfigurieren, dass  sie mehrere Hostmaschinen simuliert. Jeder virtuelle Host besitzt einen logischen Namen und eine Liste von DNS-Aliasnamen, unter denen er bekannt ist.

VirtualHost.smallIcon=VirtualHost.gif
VirtualHost.largeIcon=VirtualHost32X32.gif
VirtualHost.name.description=Ein logischer Name f\u00fcr die Konfiguration von Webanwendungen auf einem bestimmten Host. F\u00fcr die meisten einfachen Konfigurationen eignet sich der virtuelle Standardhost.
VirtualHost.aliases.displayName= Hostaliasnamen
VirtualHost.aliases.description=Eine Liste mit einem oder mehreren DNS-Aliasnamen, unter denen der virtuelle Host bekannt ist.
VirtualHost.mimeTypes.displayName=MIME-Typen
VirtualHost.mimeTypes.description=Eine Auflistung von Erweiterungszuordnungen f\u00fcr MIME-Typen, die f\u00fcr den virtuellen Host definiert sind. Falls keine MIME-Eintr\u00e4ge auf Webmodulebene angegeben sind, werden diese MIME-Eintr\u00e4ge angewendet.
virtual.host.must.be.selected=Sie m\u00fcssen zum Ausf\u00fchren dieser Aktion mindestens einen virtuellen Host ausw\u00e4hlen.

MimeEntry.displayName=MIME-Typ
MimeEntry.description=Konfiguration f\u00fcr die Zuordnung von MIME-Typen zu Erweiterungen
MimeEntry.smallIcon=MimeEntry.gif
MimeEntry.largeIcon=MimeEntry32X32.gif
MimeEntry.type.description=Ein MIME-Typ, dem die Dateinamenserweiterungen des Typs zugeordnet werden.
MimeEntry.extensions.displayName=Erweiterungen
MimeEntry.extensions.description=Eine Liste der Dateierweiterungen, die dem MIME-Typ zugeordnet sind.
HostAlias.displayName=Hostname
HostAlias.description=Ein Aliasname ist der DNS-Hostname und die Port-Nummer, die ein Client verwendet, um die URL-Anforderung f\u00fcr eine Webanwendungsressource (z. B. ein Servlet, eine JSP oder eine HTML-Seite) zu formulieren. Beispielsweise ist der Abschnitt "meinhost:8080" in http://meinhost:8080/servlet/snoop der Aliasname. Wenn keine Port-Nummer angegeben ist, wird der Standard-Port 80 verwendet.
HostAlias.smallIcon=HostAlias.gif
HostAlias.largeIcon=HostAlias32X32.gif
HostAlias.hostname.description=Die IP-Adresse, der DNS-Hostname mit Dom\u00e4nennamenssuffix oder einfach der DNS-Hostname, der von einem Client verwendet wird, um eine Web-Anwendungsressource (z. B. ein Servlet, eine JSP oder eine HTML-Seite) anzufordern.
HostAlias.port.displayName=Port            
HostAlias.port.description=Der Port, der f\u00fcr den Webserver konfiguriert wurde, um Clientanforderungen entgegen zu nehmen. Geben Sie einen Port-Wert zusammen mit dem Hostnamen an.

plugincfg.title=Webserver-Plug-in aktualisieren
plugincfg.description=Klicken Sie auf die Schaltfl\u00e4che OK, um die Konfigurationsdatei des Plug-in zu aktualisieren.
plugincfg.help=Die Konfigurationsdatei des Webserver-Plug-in legt fest, welche Inhalte vom Webserver an einen Anwendungsserver \u00fcbertragen werden. Diese Datei muss erneut generiert werden, wenn der Server, der Cluster, der HTTP-Transport oder die Konfigurationen von Aliasnamen f\u00fcr virtuelle Hosts ge\u00e4ndert werden. Die generierte Datei plugin-cfg.xml wird im Konfigurationsverzeichnis der WebSphere-Installation abgelegt. Falls sich der Webserver auf einer fernen Maschine befindet, m\u00fcssen Sie die Datei manuell auf diese Maschine verschieben.


nav.view.variable.substitution.entry=WebSphere-Variablen verwalten
VariableSubstitutionEntry.displayName=WebSphere-Variablen
VariableSubstitutionEntry.description=Mit Substitutionsvariablen k\u00f6nnen Sie eine Zwischenstufe f\u00fcr im System definierte Werte wie die Stammverzeichnisse von Dateisystemen festlegen. Variablen k\u00f6nnen auf Server-, Knoten- und Zellenebene definiert werden. Sollten Variablen in unterschiedlichen Bereichen denselben Namen haben, wird bei der Aufl\u00f6sung die folgende Reihenfolge angewendet: Servervariablen, Knotenvariablen, Zellenvariablen.
VariableSubstitutionEntry.smallIcon=VariableSubstitutionEntry.gif
VariableSubstitutionEntry.largeIcon=VariableSubstitutionEntry32X32.gif
VariableSubstitutionEntry.symbolicName.description=Der symbolische Name f\u00fcr einen physischen Pfad oder ein URL-Stammverzeichnis.
VariableSubstitutionEntry.value.displayName=Wert
VariableSubstitutionEntry.value.description=Der absolute Pfad des symbolischen Namens.
VariableSubstitutionEntry.description.description=Eine optionale Beschreibung Ihrer Verwaltungsdatens\u00e4tze.

NameSpaceBinding.displayName=Namespace-Bindungen
NameSpaceBinding.description=Auf dieser Seite k\u00f6nnen Sie die Namensbindung f\u00fcr eine Enterprise-Bean, einen CORBA-CosNaming-Namenskontext oder ein CORBA-Blattknotenobjekt, ein Objekt, das mit JNDI gesucht werden kann, oder einen konstanten Zeichenfolgewert konfigurieren.
NameSpaceBinding.smallIcon=NameSpaceBinding.gif
NameSpaceBinding.largeIcon=NameSpaceBinding32X32.gif
NameSpaceBinding.name.displayName=Bindungs-ID
NameSpaceBinding.name.description=Der Name, der diese konfigurierte Bindung eindeutig kennzeichnet.
NameSpaceBinding.nameInNameSpace.displayName=Name im Namespace
NameSpaceBinding.nameInNameSpace.description=Der Name, der im Namespace f\u00fcr diese Bindung verwendet wird. Ein einfacher oder zusammengesetzter Name, der relativ zu dem Bereich des Namespace interpretiert wird, in dem diese Bindung konfiguriert ist.
NameSpaceBinding.bindingType.description=Der Typ der konfigurierten Bindung. G\u00fcltige Optionen sind Strings, EJB, CORBA und Indirect.
NameSpaceBinding.bindingType.displayName=Bindungstyp
NameSpaceBinding.namingContext.description=Der Geltungsbereich der konfigurierten Bindung. Dieser Wert gibt die Konfigurationsposition f\u00fcr die Datei namebindings.xml an.
EjbNameSpaceBinding.displayName=Bindung des EJB-Namespace
EjbNameSpaceBinding.description=Auf dieser Seite k\u00f6nnen Sie die Namensbindung f\u00fcr das Home-Verzeichnis einer Enterprise-Bean konfigurieren, das bereits auf einem Server in der Zelle konfiguriert wurde.
EjbNameSpaceBinding.smallIcon=EjbNameSpaceBinding.gif
EjbNameSpaceBinding.largeIcon=EjbNameSpaceBinding32X32.gif
EjbNameSpaceBinding.ejbJndiName.displayName=JNDI-Name
EjbNameSpaceBinding.ejbJndiName.description=Der JNDI-Name der implementierten Enterprise-Bean (d. h. der JNDI-Name der Bean aus den Bindungen der Enterprise-Bean und nicht der java:comp-Name).
EjbNameSpaceBinding.applicationServerName.displayName=Server
EjbNameSpaceBinding.applicationServerName.description=Der Name des Cluster oder Einzelservers, in dem die Enterprise-Bean konfiguriert ist.
EjbNameSpaceBinding.applicationNodeName.displayName=Knoten  
EjbNameSpaceBinding.serverCluster.displayName=Server-Cluster
EjbNameSpaceBinding.singleServer.displayName=Einzelserver (Knoten erforderlich)
EjbNameSpaceBinding.bindingLocation.displayName=Position der Enterprise-Bean
EjbNameSpaceBinding.bindingLocation.description=Geben Sie die Position der Enterprise-Bean an.
EjbNameSpaceBinding.bindingLocation.description.base=Geben Sie als Position f\u00fcr die Enterprise-Bean einen Knotennamen an.
EjbNameSpaceBinding.bindingLocation.description.nd=Geben Sie die Position der Enterprise-Bean an. Falls die Enterprise-Bean in einem Server-Cluster ausgef\u00fchrt wird, w\u00e4hlen Sie 'Server-Cluster' aus. W\u00e4hlen Sie andernfalls 'Einzelserver' aus und geben Sie den Knotennamen an.
CORBAObjectNameSpaceBinding.displayName=Bindung des Namespace f\u00fcr CORBA-Objekte
CORBAObjectNameSpaceBinding.description=Auf dieser Seite k\u00f6nnen Sie die Namensbindung f\u00fcr ein CORBA-Home-Verzeichnis konfigurieren, das bereits auf einem Server in der Zelle konfiguriert wurde.
CORBAObjectNameSpaceBinding.smallIcon=CORBAObjectNameSpaceBinding.gif
CORBAObjectNameSpaceBinding.largeIcon=CORBAObjectNameSpaceBinding32X32.gif
CORBAObjectNameSpaceBinding.corbanameUrl.displayName=URL des CORBA-Namens
CORBAObjectNameSpaceBinding.corbanameUrl.description=Ein URL f\u00fcr den CORBA-Namen, der angibt, wo das Objekt in einem CosNaming-Server gebunden ist.
CORBAObjectNameSpaceBinding.federatedContext.displayName=Zusammengefasster Kontext
CORBAObjectNameSpaceBinding.federatedContext.description=Wenn Sie diese Option ausw\u00e4hlen, ist das Ziel ein CosNaming-Kontext. Ist die Option nicht ausgew\u00e4hlt, ist das Ziel ein Blattknotenobjekt.
IndirectLookupNameSpaceBinding.displayName=Bindung des Namespace f\u00fcr indirekte Lookups
IndirectLookupNameSpaceBinding.description=Auf dieser Seite k\u00f6nnen Sie die Namensbindung f\u00fcr ein Objekt konfigurieren, das mit JNDI gesucht werden kann.
IndirectLookupNameSpaceBinding.smallIcon=IndirectLookupNameSpaceBinding.gif
IndirectLookupNameSpaceBinding.largeIcon=IndirectLookupNameSpaceBinding32X32.gif
IndirectLookupNameSpaceBinding.providerURL.displayName=Provider-URL
IndirectLookupNameSpaceBinding.providerURL.description=Die Provider-URL-Zeichenfolge, die zum Abrufen eines JNDI-Ausgangskontextes ben\u00f6tigt wird.
IndirectLookupNameSpaceBinding.jndiName.displayName=JNDI-Name
IndirectLookupNameSpaceBinding.jndiName.description=Der Name, unter dem das Zielobjekt im Ausgangskontext gespeichert ist.
StringNameSpaceBinding.displayName=Bindung des Namespace f\u00fcr Zeichenfolgen
StringNameSpaceBinding.description=Auf dieser Seite k\u00f6nnen Sie die Namensbindung eines konstanten Zeichenfolgewertes konfigurieren.
StringNameSpaceBinding.smallIcon=StringNameSpaceBinding.gif
StringNameSpaceBinding.largeIcon=StringNameSpaceBinding32X32.gif
StringNameSpaceBinding.stringToBind.displayName=Zeichenfolgewert
StringNameSpaceBinding.stringToBind.description=Die Zeichenfolge, die an den Namespace gebunden werden soll.
NameSpaceBinding.create.new=Neue Namespace-Bindung
NameSpaceBinding.create.new.description=Verwenden Sie diesen Assistenten, um eine neue Namespace-Bindung zu konfigurieren.
NameSpaceBinding.new.step1=Bindungstyp angeben
NameSpaceBinding.new.step2.ejb=Basismerkmale angeben
NameSpaceBinding.new.step2.corba=Basismerkmale angeben
NameSpaceBinding.new.step2.indirect=Basismerkmale angeben
NameSpaceBinding.new.step2.string=Basismerkmale angeben
NameSpaceBinding.new.step3=Zusammenfassung

Node.displayName=Knoten  
Node.description=Eine Liste der Knoten in dieser Zelle. Sie k\u00f6nnen neue Knoten zu der Zelle hinzuf\u00fcgen, indem Sie auf "Knoten hinzuf\u00fcgen" klicken und eine ferne, aktive WAS-Instanz angeben.
Node.largeIcon=Node32X32.gif
Node.properties.displayName=Benutzerdefinierte Merkmale
Node.properties.description=Vom Benutzer ausgew\u00e4hlte Konfigurationswerte f\u00fcr diesen Knoten.
Node.name.displayName=Name
Node.name.description=Ein logischer Name f\u00fcr den Knoten. Der Name muss in der Zelle eindeutig sein.
Node.status.displayName=Status
Node.synchronized=Synchronisiert
Node.not.synchronized=Nicht synchronisiert
Node.discoveryProtocol.displayName=Discovery-Protokoll
Node.discoveryProtocol.description=Gibt das Protokoll an, das der Koten zum Abrufen von Informationen aus einem Netz verwendet.
Cell.nodes.displayName=Knoten
Cell.nodes.description=In dieser Zelle definierte Knoten
Cell.displayName=Zelle
Cell.description=Eine logische Zusammenfassung von WebSphere-Knoten, die es erm\u00f6glicht, die Knoten einheitlich zu verwalten.
Cell.largeIcon=Cell32X32.gif
Cell.foreignCells.displayName=Fremde Zellen
Cell.foreignCells.description=Die Dom\u00e4ne verwaltet eine Liste fremder Dom\u00e4nenobjekte, die f\u00fcr den Zugriff auf eine andere Dom\u00e4ne verwendet werden k\u00f6nnen.

Cell.properties.displayName=Benutzerdefinierte Merkmale
Cell.properties.description=Vom Benutzer ausgew\u00e4hlte Konfigurationswerte f\u00fcr diese Zelle.
Cell.name.displayName=Name
Cell.name.description=Der Name der vorhandenen Zelle.
Cell.cellDiscoveryProtocol.displayName=Discovery-Protokoll f\u00fcr Zelle
Cell.cellDiscoveryProtocol.description=Gibt das Protokoll an, das die Zelle zum Abrufen von Informationen aus einem Netz verwendet.
Cell.discoveryAddressEndpointName.displayName=Name des Endpoint f\u00fcr Discovery-Adresse
Cell.discoveryAddressEndpointName.description=Gibt den Namen des Endpoint mit der Discovery-Adresse an.
Cell.multicastDiscoveryAddressEndpointName.displayName=Name des Endpoint f\u00fcr Multicast-Discovery-Adresse
Cell.multicastDiscoveryAddressEndpointName.description=Gibt den Namen des Endpoint mit der Multicast-Discovery-Adresse an. 
EndPoint.displayName=Endpoint
EndPoint.description=Der \u00dcbertragungs-Endpoint, der von den Services und Laufzeitkomponenten verwendet wird, die in einem Prozess ausgef\u00fchrt werden.
EndPoint.smallIcon=EndPoint.gif
EndPoint.largeIcon=EndPoint32X32.gif
EndPoint.host.displayName=Host
EndPoint.host.description=Die IP-Adresse, der DNS-Hostname mit Dom\u00e4nennamenssuffix oder einfach der DNS-Hostname, der von einem Client verwendet wird, um eine Web-Anwendungsressource (z. B. ein Servlet, eine JSP oder eine HTML-Seite) anzufordern.
EndPoint.port.displayName=Port            
EndPoint.port.description=Der Port, der f\u00fcr den Webserver konfiguriert wurde, um Clientanforderungen entgegen zu nehmen. Geben Sie einen Port-Wert zusammen mit dem Hostnamen an.

TCPIPProtocolType.UDP=UDP
TCPIPProtocolType.TCP=TCP
TCPIPProtocolType.MULTICAST=MULTICAST

Transport.displayName=Transport
Transport.description=Serverprozesse k\u00f6nnen verschiedene Transporte f\u00fcr IPC unterst\u00fctzen. Clientprozesse stellen mit einem der vom Server unterst\u00fctzten Transporte eine Verbindung zum Server her.
Transport.smallIcon=Transport.gif
Transport.largeIcon=Transport32X32.gif
Transport.address.displayName=Adresse
Transport.address.description=Gibt die Adresse an, zu der f\u00fcr einen Transport eine Verbindung hergestellt wird.
Transport.properties.displayName=Merkmale
Transport.properties.description=Spezielle Konfigurationsmerkmale des Transports. Jede Art von Transport kann benutzerdefinierte Merkmale enthalten, die vom Transportprovider festgelegt werden. Lesen Sie die Dokumentation zum jeweiligen Transporttyp, um festzustellen, ob Sondermerkmale vorhanden sind und welche Werte f\u00fcr das jeweilige Sondermerkmal verf\u00fcgbar sind.
Transport.external.displayName=Extern
Transport.external.description=Gibt an, ob dieser Transport f\u00fcr interne oder externe Verwendung bestimmt ist.
Transport.sslEnabled.displayName=SSL aktiviert
Transport.sslEnabled.description=Bei Auswahl dieser Option werden die Verbindungen zwischen dem WebSphere-Plug-in und dem Anwendungsserver durch Secure Socket Layer (SSL) gesch\u00fctzt. SSL wird standardm\u00e4\u00dfig nicht verwendet.
Transport.sslConfig.displayName=SSL
Transport.sslConfig.description=Die SSL-Einstellungen (Secure Socket Layer) f\u00fcr die Verbindungen zwischen dem WebSphere-Plug-in und dem Anwendungsserver. Sie k\u00f6nnen eine oder mehrere der im Sicherheitscenter definierten SSL-Einstellungen angeben, z. B. SSL-Standardeinstellungen, ORB-SSL-Einstellungen oder LDAP-SSL-Einstellungen.

Property.displayName=Merkmal
Property.description=Beliebige Name/Wert-Datenpaare. Name steht f\u00fcr einen Merkmalschl\u00fcssel und Wert f\u00fcr einen Zeichenfolgewert, mit dem Merkmale f\u00fcr die interne Systemkonfiguration definiert werden k\u00f6nnen.
Property.smallIcon=Property.gif
Property.largeIcon=Property32X32.gif
Property.name.displayName=Name
Property.name.description=Der Name (oder Schl\u00fcssel) des Merkmals.
Property.value.displayName=Wert
Property.value.description=Der Wert zu dem angegebenen Namen.
Property.description.displayName=Beschreibung
Property.description.description=Informationen zum Name/Wert-Paar.
Property.required.displayName=Erforderlich
Property.required.description=Ein optionales Attribut, das festlegt, ob das Merkmal einen Wert haben muss.
Property.validationExpression.displayName=Validierungsausdruck
Property.validationExpression.description=Die Konsole und andere Tools verwenden diesen Wert, um den Inhalt des Merkmalwerts zu validieren.

PropertySet.displayName=Merkmalgruppe
PropertySet.description=Eine Gruppe von Merkmalen, die f\u00fcr einen gemeinsamen Zweck verwendet werden.
PropertySet.smallIcon=PropertySet.gif
PropertySet.largeIcon=PropertySet32X32.gif
PropertySet.properties.displayName=Merkmale
PropertySet.properties.description=Einige Laufzeitkomponenten lassen eine Sammlung weiterer Merkmale zu, die f\u00fcr eine weitere Anpassung verwendet werden k\u00f6nnen. Lesen Sie in den Dokumentationen zu den einzelnen Laufzeitkomponenten nach, ob spezielle Merkmale verwendet werden k\u00f6nnen.
PropertySet.properties.TypedProperty.displayName=Typisierte Merkmale
PropertySet.description.displayName=Beschreibung
PropertySet.description.description=Einige Laufzeitkomponenten lassen eine Sammlung weiterer Merkmale zu, die f\u00fcr eine weitere Anpassung verwendet werden k\u00f6nnen. Lesen Sie in den Dokumentationen zu den einzelnen Laufzeitkomponenten nach, ob spezielle Merkmale verwendet werden k\u00f6nnen.

TypedProperty.displayName=Typisiertes Merkmal
TypedProperty.description=Benutzerdefinierter Merkmalwert. Lesen Sie in den Dokumentationen zu den Laufzeitkomponenten nach, ob weitere benutzerdefinierte Merkmale unterst\u00fctzt werden.
TypedProperty.smallIcon=TypedProperty.gif
TypedProperty.largeIcon=TypedProperty32X32.gif
TypedProperty.type.displayName=Typ
TypedProperty.type.description=Der vollst\u00e4ndig qualifizierte Java-Typ des Merkmals (java.lang.Integer, java.lang.Byte).

Library.displayName=Gemeinsame Bibliotheken
Library.description=Eine containerweite gemeinsam benutzte Bibliothek, die von den implementierten Anwendungen verwendet werden kann.
Library.name.description=Der Name der gemeinsam benutzten Bibliothek.
Library.description.description=Eine optionale Beschreibung der gemeinsam benutzten Bibliothek.
Library.classpath.displayName=Klassenpfad
Library.classpath.description=Ein Klassenpfad mit den JAR-Dateien der Bibliothek. Zwischen den Klassenpfadeintr\u00e4gen muss die Eingabetaste gedr\u00fcckt werden. Die Eintr\u00e4ge d\u00fcrfen keine Pfadtrennzeichen (wie ';' oder ':') enthalten. Klassenpfade k\u00f6nnen variable (symbolische) Namen enthalten, die durch eine Variablenzuordnung ersetzt werden k\u00f6nnen.
Library.nativepath.displayName=Pfad der nativen Bibliothek
Library.nativepath.description=Ein optionaler Pfad zu allen nativen Bibliotheken (.dll, .so), die von dieser gemeinsamen Bibliothek ben\u00f6tigt werden. 
button.addnode=Knoten hinzuf\u00fcgen
button.removenode=Knoten entfernen
add.node.displayName=Knoten hinzuf\u00fcgen
add.node.description=Geben Sie eine ferne WAS-Instanz an, die zu der Zelle hinzugef\u00fcgt werden soll. Der ferne Server muss aktiv sein.

add.node.host.displayName=Host
add.node.host.description=Der Netzname des Knotens, der zu der Zelle hinzugef\u00fcgt werden soll. Es muss eine WAS-Instanz auf der Maschine aktiv sein.

add.node.port.displayName=Port des JMX-Connector
add.node.port.description=Die Port-Nummer des JMX-Connector in der Instanz, die der Zelle hinzugef\u00fcgt werden soll. Der Standard-Port f\u00fcr den SOAPConnector ist 8880.
add.node.rmi.port.displayName=Port des RMI-Connector
add.node.rmi.port.description=Die Port-Nummer des RMI-Connector in der Instanz, die der Zelle hinzugef\u00fcgt werden soll. Der Standard-Port ist 9809.
add.node.include.apps=Anwendungen einschlie\u00dfen
add.node.include.apps.description=Wenn diese Option ausgew\u00e4hlt ist, wird versucht, die in der fernen Instanz installierten Anwendungen in die Zelle zu kopieren. Sollte bereits eine Anwendung mit demselben Namen in der Zelle vorhanden sein, wird diese Anwendung nicht kopiert.
add.node.connector.displayName=Typ des JMX-Connector
add.node.connector.description=Der Typ des JMX-Connector, der die Operation ausf\u00fchren soll.
add.node.soap.displayName=SOAP
add.node.rmi.displayName=RMI
add.node.user.displayName=Benutzer-ID
add.node.user.description=Da die Sicherheit aktiviert ist, m\u00fcssen Sie eine Benutzer-ID und ein Kennwort eingeben, damit die ferne WebSphere-Instanz mit dem Deployment Manager kommunizieren kann.
add.node.password.displayName=Kennwort
add.node.password.description=Das passende Kennwort zur eingegeben Benutzer-ID.
add.node.null.user.name=Die Benutzer-ID muss angegeben werden.
add.node.null.password=Das Kennwort muss angegeben werden.
add.node.status.adding=Knoten hinzuf\u00fcgen
add.node.status.logout=Der neue Knoten ist erst dann in der Konsole verf\u00fcgbar, wenn Sie sich erneut anmelden.
add.node.status.logout.link=Von der WebSphere-Administrationskonsole abmelden
remove.node.status.removing=Knoten entfernen
remove.node.status.logout=Der Knoten wird in der Konsole angezeigt, wenn Sie sich erneut anmelden.

null.host.name=Der Hostname muss angegeben werden.
null.port=Der Port muss angegeben werden.
add.node.failed=Das Hinzuf\u00fcgen des Knotens ist fehlgeschlagen. \u00dcberpr\u00fcfen Sie die Protokolle auf n\u00e4here Einzelheiten.

add.node.failed.connector.exception=Der Knoten konnte nicht hinzugef\u00fcgt werden, weil der Deployment Manager keine Verbindung zum fernen Server herstellen konnte. \u00dcberpr\u00fcfen Sie Hostnamen und Port und stellen Sie sicher, dass der Server aktiv ist.
add.node.initiated=Der Deployment Manager hat die Einbindung des Knotens in die Zelle auf Host {0} eingeleitet. Diese Operation kann einige Minuten dauern. N\u00e4here Einzelheiten zu dieser Operation finden Sie in der Datei addNode.log auf {0}. Sie m\u00fcssen sich nach Beendigung der Operation erneut an der Konsole anmelden, um den neuen Knoten in der Konsole zu sehen.

remove.node.initiated=Der Deployment Manager entfernt {0} aus der Zelle. Diese Operation kann einige Minuten dauern. Sie m\u00fcssen sich nach Beendigung der Operation erneut an der Konsole anmelden, um \u00fcberpr\u00fcfen, ob der Knoten aus der Liste der verf\u00fcgbaren Knoten entfernt wurde.

remove.node.failed=Der Knoten {0} konnte nicht entfernt werden. \u00dcberpr\u00fcfen Sie die Protokolle auf n\u00e4here Einzelheiten.

remove.node.node.agent.not.active=Der Node Agent auf Knoten {0} ist nicht aktiv. Der Knoten kann nicht entfernt werden.

remote.instance.not.found=Der Knoten konnte nicht hinzugef\u00fcgt werden, weil die Knoteninstanz nicht gefunden wurde. \u00dcberpr\u00fcfen Sie Hostnamen und Port und stellen Sie sicher, dass die Instanz des fernen Anwendungsservers aktiv ist.
sync.request.submitted=Die Synchronisation des Repository auf Knoten {0} mit dem Repository des Deployment Manager wurde eingeleitet.
node.sync.failed=Die Synchronisationsanforderung f\u00fcr Knoten {0} konnte nicht eingeleitet werden. N\u00e4here Einzelheiten finden Sie m\u00f6glicherweise in den Protokollen.

this.node.can.not.be.synchronized=Die Synchronisationsoperation kann f\u00fcr den Deployment-Manager-Knoten {0} nicht durchgef\u00fchrt werden.
this.node.can.not.be.removed=Die Entfernungsoperation kann f\u00fcr den Deployment-Manager-Knoten {0} nicht durchgef\u00fchrt werden.
this.node.can.not.be.stopped=Die Stoppoperation kann f\u00fcr den Deployment-Manager-Knoten {0} nicht durchgef\u00fchrt werden.
this.node.already.synchronized=Der Knoten {0} wurde bereits synchronisiert.
node.agent.must.be.active.for.sync=Die Synchronisationsoperation kann nicht f\u00fcr Knoten {0} durchgef\u00fchrt werden, weil der Node Agent nicht aktiv ist.
ExecutionState.UNKNOWN=Unbekannt
button.sync=Synchronisieren
button.syncall=Alle synchronisieren
button.fullresync=Vollst\u00e4ndige Neusynchronisation

plugincfg.generation.failed=Beim Aktualisieren der Konfiguration des Webserver-Plug-in ist ein Fehler aufgetreten. N\u00e4here Einzelheiten finden Sie m\u00f6glicherweise in den Protokollen.
plugincfg.generated=Die Konfiguration des Webserver-Plug-in wurde aktualisiert.
update.plugincfg=Konfiguration des Webserver-Plug-in aktualisieren

explore.title=<span class="bluebold">WebSphere Application Server </span><span class="purpletext">auf IBM.com</span>
explore.link.text=http:// www-3.ibm.com / software / webservers / appserv/
explore.desc=<span class="desctext">Support-Website mit Neuigkeiten zu WebSphere, FAQs, Hinweisen, Tipps und technischen Informationen. Dar\u00fcber hinaus finden Sie auf dieser Website Downloads, Bibliotheken, Neuigkeiten und weitere n\u00fctzliche Informationen.</span>

about.title=<label for="abouttext"><spanclass="purplebold">Informationen zu </span><span class="graytext">Ihrem WebSphere Application Server</span></label>
about.link.text=Auf die Hilfe zugreifen
about.build.num=Build-Nummer:
about.build.date=Build-Datum:

developer.domain.title=<span class="bluebold">WebSphere-Entwicklerdom\u00e4ne</span>
developer.domain.link.text=http:// www7b.software.ibm.com / wsdd / 

developer.domain.desc=<span class="desctext">Laden Sie aktuelle Artikel mit technischen Hinweisen, empfohlene Techniken, Lernprogramme usw. von der Website <a href="http://www7b.software.ibm.com/wsdd/zones/was/" target="_blank">WebSphere Application Server Zone</a> herunter. Nehmen Sie Einfluss auf die Entwicklung von WebSphere Application Server und <a href="http://www7b.software.ibm.com/webapp/wsdd/wasServlet3" target="_blank">fordern Sie neue Produkt-Features</a>.</span>

infocenter.title=<span class="bluebold">InfoCenter</span>
infocenter.link.text=http:// www-3.ibm.com / software / webservers / appserv/
infocenter.desc=<span class="desctext">Die vollst\u00e4ndige Quelle f\u00fcr Produktdokumentationen, Task-Informationen, Referenzliteratur und Konzeptinformationen zu den Produkt-Features und -funktionen. </span>
remove.node.title=Knoten entfernen
remove.node.help=Wenn Sie einen Knoten entfernen, wird dieser sofort aus dem Master-Konfigurations-Repository gel\u00f6scht. Die \u00c4nderungen spiegeln sich erst dann im Arbeitsbereich wider, wenn Sie sich erneut an der Konsole anmelden.

remove.node.confirm=Klicken Sie auf die Schaltfl\u00e4che \"OK\", um die folgenden Knoten zu entfernen, oder klicken Sie auf die Schaltfl\u00e4che \"Abbrechen\", um zur vorherigen Seite zur\u00fcckzukehren.

remove.node.only.select.one.node=Die Operation zum Entfernen von Knoten kann immer nur auf einem Knoten ausgef\u00fchrt werden.
download.plugincfg=Aktuelle Konfigurationsdatei f\u00fcr Webserver-Plug-ins anzeigen oder herunterladen

