# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided. 
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.50,0,02/07/10,12:51:45
#
#CMVCPATHNAME ws/code/webui.environment/src/environment/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE

nav.webSphere.environment.configuration=\u74b0\u5883
nav.view.virtual.hosts=\u4eee\u60f3\u30db\u30b9\u30c8  
nav.view.name.space.bindings=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
nav.view.libraries=\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc

environment.label.string=\u30b9\u30c8\u30ea\u30f3\u30b0
environment.label.ejb=EJB
environment.label.corba=CORBA
environment.label.indirect=\u9593\u63a5
environment.label.name=\u540d\u524d
environment.label.description=\u8aac\u660e
environment.label.scope=\u6709\u52b9\u7bc4\u56f2

error.virtualhost.not.found=\u4eee\u60f3\u30db\u30b9\u30c8\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.duplicate.virtualhost.name=<span class\="validation-error">\u30a8\u30e9\u30fc \: \u4eee\u60f3\u30db\u30b9\u30c8 "{0}" \u306f\u3059\u3067\u306b\u5b58\u5728\u3057\u307e\u3059\u3002</span><br>
warning.virtualhost.name.change=\u3053\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u306b\u5bfe\u3059\u308b\u8a2d\u5b9a\u306e\u5909\u66f4\u306f\u3001\u5b9f\u884c\u3059\u308b\u305f\u3081\u306b\u73fe\u5728\u30d0\u30a4\u30f3\u30c9\u3055\u308c\u3066\u3044\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u5f71\u97ff\u3092\u4e0e\u3048\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002  \u5404\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u306e\u30de\u30c3\u30d4\u30f3\u30b0\u3092\u624b\u52d5\u3067\u691c\u8a0e\u3057\u3001\u3053\u308c\u3089\u304c\u6b63\u3057\u3044\u3053\u3068\u3092\u78ba\u8a8d\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
error.noMimeEntry=<li>MIME \u30bf\u30a4\u30d7\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093</li>
error.mimeentry.not.found=MIME \u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.hostalias.not.found=\u30db\u30b9\u30c8\u5225\u540d\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.variable.not.found=\u5909\u6570\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
missing.required.values=\u5fc5\u9808\u306e\u5024\u304c\u5165\u529b\u3055\u308c\u3066\u3044\u307e\u305b\u3093
warning.duplicate.namespacebinding.name=<span class\="validation-warn-info">\u8b66\u544a \: \u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0 ID "{0}" \u306f\u3059\u3067\u306b\u3053\u306e\u6709\u52b9\u7bc4\u56f2\u306b\u5b58\u5728\u3057\u307e\u3059\u3002</span><br>
warning.duplicate.namespacebinding.nameInNameSpace=<span class\="validation-warn-info">\u8b66\u544a \: \u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9 "{0}" \u306b\u540d\u524d\u3092\u6301\u3064\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306f\u3001\u3059\u3067\u306b\u3053\u306e\u6709\u52b9\u7bc4\u56f2\u3067\u69cb\u6210\u3055\u308c\u3066\u3044\u307e\u3059\u3002</span><br>
error.namespacebinding.not.found=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.library.not.found=\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.node.not.found=\u30ce\u30fc\u30c9\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
error.replicators.not.defined=1 \u3064\u4ee5\u4e0a\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u3001\u5b9a\u7fa9\u3055\u308c\u305f\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u304c\u3042\u308a\u307e\u305b\u3093
error.replicators.dont.exist=\u65e2\u5b58\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u306f\u5b9a\u7fa9\u3055\u308c\u305f\u30ec\u30d7\u30ea\u30b1\u30fc\u30bf\u30fc\u304c\u3042\u308a\u307e\u305b\u3093

VirtualHost.displayName=\u4eee\u60f3\u30db\u30b9\u30c8
VirtualHost.description=\u5358\u4e00\u306e\u30db\u30b9\u30c8\u30fb\u30de\u30b7\u30f3\u3092\u8907\u6570\u306e\u30db\u30b9\u30c8\u30fb\u30de\u30b7\u30f3\u3068\u540c\u69d8\u306b\u4f7f\u7528\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u69cb\u6210\u3002 \u5404\u4eee\u60f3\u30db\u30b9\u30c8\u306f\u30011 \u3064\u306e\u8ad6\u7406\u540d\u3068\u305d\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u306e\u8a8d\u8b58\u306b\u4f7f\u7528\u3055\u308c\u308b 1 \u3064\u4ee5\u4e0a\u306e DNS \u5225\u540d\u306e\u30ea\u30b9\u30c8\u3092\u6301\u3063\u3066\u3044\u307e\u3059\u3002 
VirtualHost.smallIcon=VirtualHost.gif
VirtualHost.largeIcon=VirtualHost32X32.gif
VirtualHost.name.description=Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u7279\u5b9a\u306e\u30db\u30b9\u30c8\u540d\u306b\u69cb\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b\u8ad6\u7406\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u306f\u3001\u591a\u304f\u306e\u7c21\u6613\u69cb\u6210\u306b\u9069\u3057\u3066\u3044\u307e\u3059\u3002
VirtualHost.aliases.displayName= \u30db\u30b9\u30c8\u5225\u540d
VirtualHost.aliases.description=\u4eee\u60f3\u30db\u30b9\u30c8\u306e\u8a8d\u8b58\u306b\u4f7f\u7528\u3055\u308c\u308b 1 \u3064\u4ee5\u4e0a\u306e DNS \u5225\u540d\u306e\u30ea\u30b9\u30c8\u3002
VirtualHost.mimeTypes.displayName=MIME \u30bf\u30a4\u30d7
VirtualHost.mimeTypes.description=\u4eee\u60f3\u30db\u30b9\u30c8\u306e\u305f\u3081\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b MIME \u30bf\u30a4\u30d7\u306e\u62e1\u5f35\u5b50\u30de\u30c3\u30d4\u30f3\u30b0\u306e\u96c6\u307e\u308a\u3002 Web \u30e2\u30b8\u30e5\u30fc\u30eb\u30fb\u30ec\u30d9\u30eb\u3067 MIME \u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u3053\u308c\u3089\u306e MIME \u30a8\u30f3\u30c8\u30ea\u30fc\u304c\u9069\u7528\u3055\u308c\u307e\u3059\u3002
virtual.host.must.be.selected=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044

MimeEntry.displayName=MIME \u30bf\u30a4\u30d7
MimeEntry.description=MIME \u30bf\u30a4\u30d7\u3092\u62e1\u5f35\u5b50\u306b\u30de\u30c3\u30d7\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3002
MimeEntry.smallIcon=MimeEntry.gif
MimeEntry.largeIcon=MimeEntry32X32.gif
MimeEntry.type.description=\u30bf\u30a4\u30d7\u306e\u30d5\u30a1\u30a4\u30eb\u540d\u62e1\u5f35\u5b50\u304c\u30de\u30c3\u30d7\u3059\u308b MIME \u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
MimeEntry.extensions.displayName=\u62e1\u5f35\u5b50
MimeEntry.extensions.description=MIME \u30bf\u30a4\u30d7\u306b\u30de\u30c3\u30d7\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u62e1\u5f35\u5b50\u3092\u30ea\u30b9\u30c8\u3057\u307e\u3059\u3002
HostAlias.displayName=\u30db\u30b9\u30c8\u540d
HostAlias.description=\u5225\u540d\u3068\u306f\u3001\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9 (\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3001JSP\u3001\u307e\u305f\u306f HTML \u30da\u30fc\u30b8\u306a\u3069) \u306e URL \u8981\u6c42\u3092\u5f62\u6210\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b DNS \u30db\u30b9\u30c8\u304a\u3088\u3073\u30dd\u30fc\u30c8\u756a\u53f7\u3067\u3059\u3002 \u305f\u3068\u3048\u3070\u3001http://myhost:8080/servlet/snoop \u306e\u300cmyhost:8080\u300d\u306e\u90e8\u5206\u3067\u3059\u3002  \u30dd\u30fc\u30c8\u756a\u53f7\u3092\u6307\u5b9a\u3057\u306a\u3044\u3068\u3001\u30c7\u30d5\u30a9\u30eb\u30c8\u30fb\u30dd\u30fc\u30c8 80 \u304c\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002
HostAlias.smallIcon=HostAlias.gif
HostAlias.largeIcon=HostAlias32X32.gif
HostAlias.hostname.description=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9 (\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3001JSP\u3001\u307e\u305f\u306f HTML \u30da\u30fc\u30b8\u306a\u3069) \u3092\u8981\u6c42\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b IP \u30a2\u30c9\u30ec\u30b9\u3001\u30c9\u30e1\u30a4\u30f3\u30fb\u30cd\u30fc\u30e0\u30fb\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u306e\u4ed8\u3044\u305f DNS \u30db\u30b9\u30c8\u540d\u3001\u307e\u305f\u306f\u5358\u306a\u308b DNS \u30db\u30b9\u30c8\u540d\u3067\u3059\u3002
HostAlias.port.displayName=\u30dd\u30fc\u30c8
HostAlias.port.description=Web \u30b5\u30fc\u30d0\u30fc\u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8981\u6c42\u3092\u53d7\u4fe1\u3059\u308b\u3088\u3046\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30dd\u30fc\u30c8\u3002 \u30db\u30b9\u30c8\u540d\u3068\u3068\u3082\u306b\u30dd\u30fc\u30c8\u5024\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

plugincfg.title=Web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u306e\u66f4\u65b0
plugincfg.description=\u300cOK\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u304c\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
plugincfg.help=Web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u3069\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u3092 Web \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u8ee2\u9001\u3059\u308b\u304b\u3092\u5236\u5fa1\u3057\u307e\u3059\u3002 \u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u3001\u30af\u30e9\u30b9\u30bf\u30fc\u3001HTTP \u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3001\u307e\u305f\u306f\u4eee\u60f3\u30db\u30b9\u30c8\u5225\u540d\u69cb\u6210\u304c\u5909\u66f4\u3055\u308c\u305f\u5834\u5408\u3001\u518d\u751f\u6210\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 \u751f\u6210\u3055\u308c\u305f plugin-cfg.xml \u30d5\u30a1\u30a4\u30eb\u306f\u3001WebSphere \u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306e config \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u7f6e\u304b\u308c\u307e\u3059\u3002 Web \u30b5\u30fc\u30d0\u30fc\u304c\u30ea\u30e2\u30fc\u30c8\u30fb\u30de\u30b7\u30f3\u4e0a\u306b\u7f6e\u304b\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u624b\u52d5\u3067\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u305d\u306e\u30de\u30b7\u30f3\u306b\u79fb\u52d5\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 

nav.view.variable.substitution.entry=WebSphere \u5909\u6570\u306e\u7ba1\u7406
VariableSubstitutionEntry.displayName=WebSphere \u5909\u6570
VariableSubstitutionEntry.description=\u7f6e\u63db\u5909\u6570\u306b\u3088\u308a\u3001\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u30fb\u30eb\u30fc\u30c8\u306a\u3069\u3001\u30b7\u30b9\u30c6\u30e0\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u5024\u306e\u9593\u63a5\u5ea6\u306e\u30ec\u30d9\u30eb\u3092\u6307\u5b9a\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 \u5909\u6570\u306f\u30b5\u30fc\u30d0\u30fc\u3001\u30ce\u30fc\u30c9\u3001\u307e\u305f\u306f\u30bb\u30eb\u30fb\u30ec\u30d9\u30eb\u3067\u5b9a\u7fa9\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u7570\u306a\u308b\u6709\u52b9\u7bc4\u56f2\u3067\u5909\u6570\u304c\u540c\u3058\u540d\u524d\u306e\u5834\u5408\u3001\u89e3\u6c7a\u306e\u9806\u5e8f\u306f\u30b5\u30fc\u30d0\u30fc\u5909\u6570\u3001\u30ce\u30fc\u30c9\u5909\u6570\u3001\u30bb\u30eb\u5909\u6570\u306b\u306a\u308a\u307e\u3059\u3002
VariableSubstitutionEntry.smallIcon=VariableSubstitutionEntry.gif
VariableSubstitutionEntry.largeIcon=VariableSubstitutionEntry32X32.gif
VariableSubstitutionEntry.symbolicName.description=\u7269\u7406\u30d1\u30b9\u307e\u305f\u306f URL \u30eb\u30fc\u30c8\u3092\u8868\u3059\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
VariableSubstitutionEntry.value.displayName=\u5024
VariableSubstitutionEntry.value.description=\u30b7\u30f3\u30dc\u30ea\u30c3\u30af\u540d\u304c\u8868\u3059\u7d76\u5bfe\u30d1\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
VariableSubstitutionEntry.description.description=\u7ba1\u7406\u30ec\u30b3\u30fc\u30c9\u306b\u5bfe\u3057\u3066\u3001\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8aac\u660e\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002

NameSpaceBinding.displayName=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
NameSpaceBinding.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001Enterprise Bean\u3001CORBA CosNaming \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u307e\u305f\u306f CORBA \u30ea\u30fc\u30d5\u30fb\u30ce\u30fc\u30c9\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3001JNDI \u3092\u4f7f\u3063\u3066\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u3067\u304d\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3001\u307e\u305f\u306f\u5b9a\u6570\u30b9\u30c8\u30ea\u30f3\u30b0\u5024\u306e\u30cd\u30fc\u30e0\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
NameSpaceBinding.smallIcon=NameSpaceBinding.gif
NameSpaceBinding.largeIcon=NameSpaceBinding32X32.gif
NameSpaceBinding.name.displayName=\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0 ID
NameSpaceBinding.name.description=\u3053\u306e\u69cb\u6210\u6e08\u307f\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u4e00\u610f\u7684\u306b\u8b58\u5225\u3059\u308b\u305f\u3081\u306b\u4e0e\u3048\u3089\u308c\u308b\u540d\u524d\u3002
NameSpaceBinding.nameInNameSpace.displayName=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u306b\u304a\u3051\u308b\u540d\u524d
NameSpaceBinding.nameInNameSpace.description=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u5185\u3067\u3053\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306b\u4f7f\u7528\u3055\u308c\u308b\u540d\u524d\u3002 \u3053\u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u306e\u90e8\u5206\u306b\u95a2\u9023\u3059\u308b\u5358\u4e00\u307e\u305f\u306f\u8907\u5408\u540d\u3002
NameSpaceBinding.bindingType.description=\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306e\u30bf\u30a4\u30d7\u3002 String\u3001EJB\u3001CORBA\u3001\u304a\u3088\u3073\u9593\u63a5\u306e\u4e2d\u304b\u3089\u9078\u629e\u3067\u304d\u307e\u3059\u3002
NameSpaceBinding.bindingType.displayName=\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30bf\u30a4\u30d7
NameSpaceBinding.namingContext.description=\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306e\u6709\u52b9\u7bc4\u56f2\u3002\u3053\u306e\u5024\u306f\u3001namebindings.xml \u30d5\u30a1\u30a4\u30eb\u306e\u69cb\u6210\u30ed\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u793a\u3057\u307e\u3059\u3002
EjbNameSpaceBinding.displayName=EjbNameSpaceBinding
EjbNameSpaceBinding.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001\u30bb\u30eb\u5185\u306e\u30b5\u30fc\u30d0\u30fc\u4e0a\u306b\u3059\u3067\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b Enterprise Bean \u30db\u30fc\u30e0\u306e\u30cd\u30fc\u30e0\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
EjbNameSpaceBinding.smallIcon=EjbNameSpaceBinding.gif
EjbNameSpaceBinding.largeIcon=EjbNameSpaceBinding32X32.gif
EjbNameSpaceBinding.ejbJndiName.displayName=JNDI \u540d
EjbNameSpaceBinding.ejbJndiName.description=\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u305f Enterprise Bean \u306e JNDI \u540d (Enterprise Bean \u306e\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u306b\u3042\u308b\u3001Bean \u306e JNDI \u540d\u3002java:comp \u540d\u3067\u306f\u306a\u3044)\u3002
EjbNameSpaceBinding.applicationServerName.displayName=\u30b5\u30fc\u30d0\u30fc
EjbNameSpaceBinding.applicationServerName.description=Enterprise Bean \u304c\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30af\u30e9\u30b9\u30bf\u30fc\u307e\u305f\u306f\u975e\u30af\u30e9\u30b9\u30bf\u30fc\u30fb\u30b5\u30fc\u30d0\u30fc\u306e\u540d\u524d\u3002
EjbNameSpaceBinding.applicationNodeName.displayName=\u30ce\u30fc\u30c9
EjbNameSpaceBinding.serverCluster.displayName=\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9\u30bf\u30fc
EjbNameSpaceBinding.singleServer.displayName=\u5358\u4e00\u30b5\u30fc\u30d0\u30fc (\u30ce\u30fc\u30c9\u304c\u5fc5\u8981)
EjbNameSpaceBinding.bindingLocation.displayName=Enterprise Bean \u306e\u5834\u6240
EjbNameSpaceBinding.bindingLocation.description=Enterprise Bean \u306e\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EjbNameSpaceBinding.bindingLocation.description.base=\u30ce\u30fc\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u3001Enterprise Bean \u306e\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EjbNameSpaceBinding.bindingLocation.description.nd=Enterprise Bean \u306e\u5834\u6240\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002  Enterprise Bean \u304c\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9\u30bf\u30fc\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u306f\u3001\u300c\u30b5\u30fc\u30d0\u30fc\u30fb\u30af\u30e9\u30b9\u30bf\u30fc\u300d\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u305d\u308c\u4ee5\u5916\u306e\u5834\u5408\u306f\u3001\u300c\u5358\u4e00\u30b5\u30fc\u30d0\u30fc\u300d\u3092\u9078\u629e\u3057\u3066\u3001\u30ce\u30fc\u30c9\u540d\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
CORBAObjectNameSpaceBinding.displayName=CORBAObjectNameSpaceBinding
CORBAObjectNameSpaceBinding.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001\u30bb\u30eb\u5185\u306e\u30b5\u30fc\u30d0\u30fc\u4e0a\u306b\u3059\u3067\u306b\u69cb\u6210\u3055\u308c\u3066\u3044\u308b CORBA \u30db\u30fc\u30e0\u306e\u30cd\u30fc\u30e0\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
CORBAObjectNameSpaceBinding.smallIcon=CORBAObjectNameSpaceBinding.gif
CORBAObjectNameSpaceBinding.largeIcon=CORBAObjectNameSpaceBinding32X32.gif
CORBAObjectNameSpaceBinding.corbanameUrl.displayName=Corbaname URL
CORBAObjectNameSpaceBinding.corbanameUrl.description=CosNaming \u30b5\u30fc\u30d0\u30fc\u306e\u3069\u3053\u3067\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u304c\u30d0\u30a4\u30f3\u30c9\u3055\u308c\u3066\u3044\u308b\u304b\u3092\u8b58\u5225\u3059\u308b CORBA \u540d URL \u30b9\u30c8\u30ea\u30f3\u30b0\u3002
CORBAObjectNameSpaceBinding.federatedContext.displayName=\u9023\u5408\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8
CORBAObjectNameSpaceBinding.federatedContext.description=\u30c1\u30a7\u30c3\u30af\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u306f CosNaming \u306b\u306a\u308a\u307e\u3059\u3002 \u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u3002 \u9078\u629e\u3055\u308c\u3066\u3044\u306a\u3044\u5834\u5408\u3001\u30bf\u30fc\u30b2\u30c3\u30c8\u306f\u30ea\u30fc\u30d5\u30fb\u30ce\u30fc\u30c9\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3067\u3059\u3002
IndirectLookupNameSpaceBinding.displayName=IndirectLookupNameSpaceBinding
IndirectLookupNameSpaceBinding.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001JNDI \u3092\u4f7f\u3063\u3066\u30eb\u30c3\u30af\u30a2\u30c3\u30d7\u3067\u304d\u308b\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30cd\u30fc\u30e0\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
IndirectLookupNameSpaceBinding.smallIcon=IndirectLookupNameSpaceBinding.gif
IndirectLookupNameSpaceBinding.largeIcon=IndirectLookupNameSpaceBinding32X32.gif
IndirectLookupNameSpaceBinding.providerURL.displayName=\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc URL
IndirectLookupNameSpaceBinding.providerURL.description=JNDI \u521d\u671f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u306e\u53d6\u5f97\u306b\u5fc5\u8981\u306a\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc URL \u30b9\u30c8\u30ea\u30f3\u30b0\u3002
IndirectLookupNameSpaceBinding.jndiName.displayName=JNDI \u540d
IndirectLookupNameSpaceBinding.jndiName.description=\u521d\u671f\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u304b\u3089\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3055\u308c\u308b\u540d\u524d\u3002
StringNameSpaceBinding.displayName=StringNameSpaceBinding
StringNameSpaceBinding.description=\u3053\u306e\u30da\u30fc\u30b8\u3092\u4f7f\u7528\u3057\u3066\u3001\u5b9a\u6570\u30b9\u30c8\u30ea\u30f3\u30b0\u5024\u306e\u30cd\u30fc\u30e0\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
StringNameSpaceBinding.smallIcon=StringNameSpaceBinding.gif
StringNameSpaceBinding.largeIcon=StringNameSpaceBinding32X32.gif
StringNameSpaceBinding.stringToBind.displayName=\u30b9\u30c8\u30ea\u30f3\u30b0\u5024
StringNameSpaceBinding.stringToBind.description=\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u306b\u30d0\u30a4\u30f3\u30c9\u3055\u308c\u308b\u30b9\u30c8\u30ea\u30f3\u30b0\u3002
NameSpaceBinding.create.new=\u65b0\u898f\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0
NameSpaceBinding.create.new.description=\u3053\u306e\u30a6\u30a3\u30b6\u30fc\u30c9\u3092\u4f7f\u7528\u3057\u3066\u3001\u65b0\u898f\u30cd\u30fc\u30e0\u30fb\u30b9\u30da\u30fc\u30b9\u30fb\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u3092\u69cb\u6210\u3057\u307e\u3059\u3002
NameSpaceBinding.new.step1=\u30d0\u30a4\u30f3\u30c7\u30a3\u30f3\u30b0\u30fb\u30bf\u30a4\u30d7\u306e\u6307\u5b9a
NameSpaceBinding.new.step2.ejb=\u57fa\u672c\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u6307\u5b9a
NameSpaceBinding.new.step2.corba=\u57fa\u672c\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u6307\u5b9a
NameSpaceBinding.new.step2.indirect=\u57fa\u672c\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u6307\u5b9a
NameSpaceBinding.new.step2.string=\u57fa\u672c\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u6307\u5b9a
NameSpaceBinding.new.step3=\u8981\u7d04

Node.displayName=\u30ce\u30fc\u30c9
Node.description=\u3053\u306e\u30bb\u30eb\u5185\u306e\u30ce\u30fc\u30c9\u306e\u30ea\u30b9\u30c8\u3002 \u30bb\u30eb\u306b\u65b0\u898f\u30ce\u30fc\u30c9\u3092\u8ffd\u52a0\u3059\u308b\u306b\u306f\u3001\u300c\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3001\u30ea\u30e2\u30fc\u30c8\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b WebSphere Application Server \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Node.largeIcon=Node32X32.gif
Node.properties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Node.properties.description=\u3053\u306e\u30ce\u30fc\u30c9\u306b\u9069\u7528\u3055\u308c\u308b\u4efb\u610f\u306e\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
Node.name.displayName=\u540d\u524d
Node.name.description=\u30ce\u30fc\u30c9\u306e\u8ad6\u7406\u540d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u3053\u306e\u540d\u524d\u306f\u3001\u30bb\u30eb\u5185\u3067\u56fa\u6709\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002
Node.status.displayName=\u72b6\u6cc1
Node.synchronized=\u540c\u671f\u5316
Node.not.synchronized=\u975e\u540c\u671f\u5316
Node.discoveryProtocol.displayName=\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb
Node.discoveryProtocol.description=\u30ce\u30fc\u30c9\u304c\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u304b\u3089\u60c5\u5831\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u5f93\u3046\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Cell.nodes.displayName=\u30ce\u30fc\u30c9
Cell.nodes.description=\u3053\u306e\u30bb\u30eb\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u30ce\u30fc\u30c9
Cell.displayName=\u30bb\u30eb
Cell.description=\u5171\u901a\u7ba1\u7406\u3092\u76ee\u7684\u3068\u3057\u305f WebSphere \u30ce\u30fc\u30c9\u306e\u8ad6\u7406\u30b0\u30eb\u30fc\u30d7\u3002
Cell.largeIcon=Cell32X32.gif
Cell.foreignCells.displayName=\u5916\u90e8\u30bb\u30eb
Cell.foreignCells.description=\u3053\u306e\u30c9\u30e1\u30a4\u30f3\u306b\u306f\u3001\u5225\u306e\u30c9\u30e1\u30a4\u30f3\u3078\u306e\u30a2\u30af\u30bb\u30b9\u306b\u4f7f\u7528\u3067\u304d\u308b\u5916\u90e8\u30c9\u30e1\u30a4\u30f3\u30fb\u30aa\u30d6\u30b8\u30a7\u30af\u30c8\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u304c\u4fdd\u6301\u3055\u308c\u307e\u3059\u3002  
Cell.properties.displayName=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Cell.properties.description=\u3053\u306e\u30bb\u30eb\u306b\u9069\u7528\u3055\u308c\u308b\u4efb\u610f\u306e\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002
Cell.name.displayName=\u540d\u524d
Cell.name.description=\u65e2\u5b58\u306e\u30bb\u30eb\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Cell.cellDiscoveryProtocol.displayName=\u30bb\u30eb\u30fb\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30d7\u30ed\u30c8\u30b3\u30eb
Cell.cellDiscoveryProtocol.description=\u30bb\u30eb\u304c\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u304b\u3089\u60c5\u5831\u3092\u691c\u7d22\u3059\u308b\u305f\u3081\u306b\u5f93\u3046\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Cell.discoveryAddressEndpointName.displayName=\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30a2\u30c9\u30ec\u30b9\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u540d
Cell.discoveryAddressEndpointName.description=\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30a2\u30c9\u30ec\u30b9\u3092\u542b\u3080\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Cell.multicastDiscoveryAddressEndpointName.displayName=\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u30fb\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30a2\u30c9\u30ec\u30b9\u30fb\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u540d\u3002
Cell.multicastDiscoveryAddressEndpointName.description=\u30de\u30eb\u30c1\u30ad\u30e3\u30b9\u30c8\u30fb\u30c7\u30a3\u30b9\u30ab\u30d0\u30ea\u30fc\u30fb\u30a2\u30c9\u30ec\u30b9\u306e\u542b\u307e\u308c\u305f\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u306e\u540d\u524d\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002

EndPoint.displayName=\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8
EndPoint.description=\u30d7\u30ed\u30bb\u30b9\u5185\u3067\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u30b5\u30fc\u30d3\u30b9\u307e\u305f\u306f\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u3088\u3063\u3066\u4f7f\u7528\u3055\u308c\u308b\u901a\u4fe1\u30a8\u30f3\u30c9\u30dd\u30a4\u30f3\u30c8\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
EndPoint.smallIcon=EndPoint.gif
EndPoint.largeIcon=EndPoint32X32.gif
EndPoint.host.displayName=\u30db\u30b9\u30c8
EndPoint.host.description=\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u304c Web \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9 (\u30b5\u30fc\u30d6\u30ec\u30c3\u30c8\u3001JSP\u3001\u307e\u305f\u306f HTML \u30da\u30fc\u30b8\u306a\u3069) \u3092\u8981\u6c42\u3059\u308b\u305f\u3081\u306b\u4f7f\u7528\u3059\u308b IP \u30a2\u30c9\u30ec\u30b9\u3001\u30c9\u30e1\u30a4\u30f3\u30fb\u30cd\u30fc\u30e0\u30fb\u30b5\u30d5\u30a3\u30c3\u30af\u30b9\u306e\u4ed8\u3044\u305f DNS \u30db\u30b9\u30c8\u540d\u3001\u307e\u305f\u306f\u5358\u306a\u308b DNS \u30db\u30b9\u30c8\u540d\u3067\u3059\u3002
EndPoint.port.displayName=\u30dd\u30fc\u30c8
EndPoint.port.description=Web \u30b5\u30fc\u30d0\u30fc\u304c\u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u8981\u6c42\u3092\u53d7\u4fe1\u3059\u308b\u3088\u3046\u69cb\u6210\u3055\u308c\u3066\u3044\u308b\u30dd\u30fc\u30c8\u3002 \u30db\u30b9\u30c8\u540d\u3068\u3068\u3082\u306b\u30dd\u30fc\u30c8\u5024\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002

TCPIPProtocolType.UDP=UDP
TCPIPProtocolType.TCP=TCP
TCPIPProtocolType.MULTICAST=MULTICAST

Transport.displayName=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8
Transport.description=\u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30ed\u30bb\u30b9\u306f\u3001IPC \u306e\u5404\u7a2e\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e 1 \u3064\u3092\u4f7f\u3063\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u3078\u306e\u63a5\u7d9a\u3092\u51e6\u7406\u3057\u307e\u3059\u3002
Transport.smallIcon=Transport.gif
Transport.largeIcon=Transport32X32.gif
Transport.address.displayName=\u30a2\u30c9\u30ec\u30b9
Transport.address.description=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e\u63a5\u7d9a\u5148\u30a2\u30c9\u30ec\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Transport.properties.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Transport.properties.description=\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u306e\u305f\u3081\u306e\u7279\u6b8a\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3002  \u5404\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7\u306b\u306f\u3001\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306b\u3088\u3063\u3066\u6307\u5b9a\u3055\u308c\u305f\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u7279\u6b8a\u306a\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u540d\u304c\u5b58\u5728\u3059\u308b\u304b\u3001\u5b58\u5728\u3059\u308b\u5834\u5408\u3001\u3069\u306e\u3088\u3046\u306a\u5024\u3092\u6307\u5b9a\u3067\u304d\u308b\u304b\u3092\u5224\u5225\u3059\u308b\u306b\u306f\u3001\u5404\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u30fb\u30bf\u30a4\u30d7\u306e\u8cc7\u6599\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
Transport.external.displayName=\u5916\u90e8
Transport.external.description=\u3053\u306e\u30c8\u30e9\u30f3\u30b9\u30dd\u30fc\u30c8\u304c\u5185\u90e8\u4f7f\u7528\u306e\u305f\u3081\u306a\u306e\u304b\u3001\u5916\u90e8\u4f7f\u7528\u306e\u305f\u3081\u306a\u306e\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Transport.sslEnabled.displayName=SSL \u4f7f\u7528\u53ef\u80fd
Transport.sslEnabled.description=\u30bb\u30ad\u30e5\u30a2\u30fb\u30bd\u30b1\u30c3\u30c8\u30fb\u30ec\u30a4\u30e4\u30fc (SSL) \u3092\u4f7f\u7528\u3057\u3066\u3001WebSphere \u30d7\u30e9\u30b0\u30a4\u30f3\u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3068\u306e\u9593\u306e\u63a5\u7d9a\u3092\u4fdd\u8b77\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306f\u3001SSL \u3092\u4f7f\u7528\u3057\u307e\u305b\u3093\u3002
Transport.sslConfig.displayName=SSL
Transport.sslConfig.description=WebSphere \u30d7\u30e9\u30b0\u30a4\u30f3\u3068\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u9593\u306e\u63a5\u7d9a\u306e\u305f\u3081\u306e\u30bb\u30ad\u30e5\u30a2\u30fb\u30bd\u30b1\u30c3\u30c8\u30fb\u30ec\u30a4\u30e4\u30fc (SSL) \u8a2d\u5b9a\u30bf\u30a4\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30aa\u30d7\u30b7\u30e7\u30f3\u306b\u306f\u3001\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30bb\u30f3\u30bf\u30fc\u3067\u5b9a\u7fa9\u3055\u308c\u305f 1 \u3064\u4ee5\u4e0a\u306e SSL \u8a2d\u5b9a\u304c\u7d44\u307f\u8fbc\u307e\u308c\u307e\u3059\u3002\u4f8b\u3048\u3070\u3001DefaultSSLSettings\u3001ORBSSLSettings\u3001\u307e\u305f\u306f LDAPSSLSettings \u306e\u3088\u3046\u306b\u306a\u308a\u307e\u3059\u3002

Property.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
Property.description=\u30c7\u30fc\u30bf\u306e\u4efb\u610f\u306e\u540d\u524d\u3068\u5024\u306e\u5bfe\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002\u540d\u524d\u306f\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30ad\u30fc\u3001\u5024\u306f\u30b9\u30c8\u30ea\u30f3\u30b0\u5024\u3067\u3001\u3053\u308c\u3089\u306b\u3088\u308a\u5185\u90e8\u306e\u30b7\u30b9\u30c6\u30e0\u69cb\u6210\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u8a2d\u5b9a\u3067\u304d\u307e\u3059\u3002
Property.smallIcon=Property.gif
Property.largeIcon=Property32X32.gif
Property.name.displayName=\u540d\u524d
Property.name.description=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u5bfe\u3059\u308b\u540d\u524d (\u307e\u305f\u306f\u30ad\u30fc) \u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Property.value.displayName=\u5024
Property.value.description=\u6307\u5b9a\u3055\u308c\u305f\u540d\u524d\u3068\u30da\u30a2\u306b\u306a\u308b\u5024\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Property.description.displayName=\u8aac\u660e
Property.description.description=\u540d\u524d\u3068\u5024\u306e\u30da\u30a2\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002
Property.required.displayName=\u5fc5\u8981
Property.required.description=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306b\u5024\u304c\u5fc5\u8981\u304b\u3069\u3046\u304b\u3092\u6307\u5b9a\u3059\u308b\u5c5e\u6027 (\u30aa\u30d7\u30b7\u30e7\u30f3)\u3002
Property.validationExpression.displayName=\u59a5\u5f53\u6027\u6f14\u7b97\u5f0f
Property.validationExpression.description=\u30b3\u30f3\u30bd\u30fc\u30eb\u3084\u305d\u306e\u4ed6\u306e\u30c4\u30fc\u30eb\u304c\u3001\u3053\u306e\u5024\u3092\u4f7f\u3063\u3066\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5024\u306e\u5185\u5bb9\u3092\u691c\u8a3c\u3057\u307e\u3059\u3002

PropertySet.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30bb\u30c3\u30c8
PropertySet.description=\u4e00\u5b9a\u306e\u76ee\u7684\u306b\u4f7f\u7528\u3055\u308c\u308b\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3002
PropertySet.smallIcon=PropertySet.gif
PropertySet.largeIcon=PropertySet32X32.gif
PropertySet.properties.displayName=\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
PropertySet.properties.description=\u4e00\u90e8\u306e\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3067\u306f\u3001\u3055\u3089\u306b\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3092\u884c\u3046\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002  \u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u95a2\u9023\u3057\u305f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3092\u53c2\u7167\u3057\u3066\u3001\u7279\u6b8a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u4f7f\u7528\u3067\u304d\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PropertySet.properties.TypedProperty.displayName=\u30bf\u30a4\u30d7\u4ed8\u304d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
PropertySet.description.displayName=\u8aac\u660e
PropertySet.description.description=\u4e00\u90e8\u306e\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u3067\u306f\u3001\u3055\u3089\u306b\u30ab\u30b9\u30bf\u30de\u30a4\u30ba\u3092\u884c\u3046\u305f\u3081\u306b\u4f7f\u7528\u3067\u304d\u308b\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u304c\u8a31\u53ef\u3055\u308c\u3066\u3044\u307e\u3059\u3002  \u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u306b\u95a2\u9023\u3057\u305f\u30c9\u30ad\u30e5\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3092\u53c2\u7167\u3057\u3066\u3001\u7279\u6b8a\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u4f7f\u7528\u3067\u304d\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002

TypedProperty.displayName=\u30bf\u30a4\u30d7\u4ed8\u304d\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
TypedProperty.description=\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u5024\u3002  \u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30b3\u30f3\u30dd\u30fc\u30cd\u30f3\u30c8\u30fb\u30c9\u30ad\u30e5\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u3001\u3053\u306e\u307b\u304b\u306b\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u308b\u30ab\u30b9\u30bf\u30e0\u30fb\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u304c\u3042\u308b\u304b\u3069\u3046\u304b\u3092\u5224\u5225\u3057\u3066\u304f\u3060\u3055\u3044\u3002
TypedProperty.smallIcon=TypedProperty.gif
TypedProperty.largeIcon=TypedProperty32X32.gif
TypedProperty.type.displayName=\u30bf\u30a4\u30d7
TypedProperty.type.description=\u3053\u306e\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u306e\u5b8c\u5168\u4fee\u98fe Java \u30bf\u30a4\u30d7 (java.lang.Integer\u3001java.lang.Byte)\u3002

Library.displayName=\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc
Library.description=\u30c7\u30d7\u30ed\u30a4\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u4f7f\u7528\u3067\u304d\u308b\u30b3\u30f3\u30c6\u30ca\u30fc\u5168\u4f53\u306e\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
Library.name.description=\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u540d\u524d
Library.description.description=\u3053\u306e\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u30aa\u30d7\u30b7\u30e7\u30f3\u306e\u8aac\u660e\u3002
Library.classpath.displayName=\u30af\u30e9\u30b9\u30d1\u30b9
Library.classpath.description=\u3053\u306e\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e JAR \u306e\u542b\u307e\u308c\u305f\u30af\u30e9\u30b9\u30d1\u30b9\u3002 \u30af\u30e9\u30b9\u30d1\u30b9\u30fb\u30a8\u30f3\u30c8\u30ea\u30fc\u306f\u3001Enter (\u5b9f\u884c) \u30ad\u30fc\u3092\u4f7f\u3063\u3066\u533a\u5207\u3089\u308c\u3001\u30d1\u30b9\u306e\u533a\u5207\u308a\u6587\u5b57 (';' \u3084 ':' \u306a\u3069) \u3092\u542b\u3081\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002\u30af\u30e9\u30b9\u30d1\u30b9\u306b\u306f\u3001\u5909\u6570\u30de\u30c3\u30d7\u3092\u4f7f\u3063\u3066\u7f6e\u63db\u3067\u304d\u308b\u5909\u6570 (\u30b7\u30f3\u30dc\u30ea\u30c3\u30af) \u540d\u3092\u542b\u3081\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
Library.nativepath.displayName=\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u30fb\u30d1\u30b9
Library.nativepath.description=\u3053\u306e\u5171\u7528\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306b\u5fc5\u8981\u306a\u3001\u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3078\u306e\u30aa\u30d7\u30b7\u30e7\u30ca\u30eb\u30fb\u30d1\u30b9 (.dll \u306a\u3069)\u3002

button.addnode=\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0
button.removenode=\u30ce\u30fc\u30c9\u306e\u9664\u53bb
add.node.displayName=\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0
add.node.description=\u30bb\u30eb\u306b\u8ffd\u52a0\u3059\u308b\u30ea\u30e2\u30fc\u30c8 WebSphere Application Server \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002 \u30ea\u30e2\u30fc\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u306f\u7a3c\u50cd\u4e2d\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093\u3002 
add.node.host.displayName=\u30db\u30b9\u30c8
add.node.host.description=\u30bb\u30eb\u306b\u8ffd\u52a0\u3059\u308b\u30ce\u30fc\u30c9\u306e\u30cd\u30c3\u30c8\u30ef\u30fc\u30af\u540d\u3002 \u3053\u306e\u30de\u30b7\u30f3\u4e0a\u3067 WebSphere Application Server \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 
add.node.port.displayName=JMX \u30b3\u30cd\u30af\u30bf\u30fc\u30fb\u30dd\u30fc\u30c8:
add.node.port.description=\u30bb\u30eb\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u4e0a\u306e JMX \u30b3\u30cd\u30af\u30bf\u30fc\u306e\u30dd\u30fc\u30c8\u756a\u53f7\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306e SOAPConnector \u30dd\u30fc\u30c8\u306f 8880 \u3067\u3059\u3002
add.node.rmi.port.displayName=RMI \u30b3\u30cd\u30af\u30bf\u30fc\u30fb\u30dd\u30fc\u30c8:
add.node.rmi.port.description=\u30bb\u30eb\u306b\u8ffd\u52a0\u3055\u308c\u308b\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u4e0a\u306e RMI \u30b3\u30cd\u30af\u30bf\u30fc\u306e\u30dd\u30fc\u30c8\u756a\u53f7\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u3001\u3053\u308c\u306f\u30dd\u30fc\u30c8 9809 \u306b\u306a\u308a\u307e\u3059\u3002
add.node.include.apps=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u7d44\u307f\u8fbc\u3080
add.node.include.apps.description=\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u5834\u5408\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u306b\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3055\u308c\u3066\u3044\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30bb\u30eb\u306b\u30b3\u30d4\u30fc\u3059\u308b\u8a66\u307f\u304c\u884c\u308f\u308c\u307e\u3059\u3002 \u73fe\u5728\u30bb\u30eb\u306b\u5b58\u5728\u3059\u308b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3068\u540c\u3058\u540d\u524d\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u30b3\u30d4\u30fc\u3055\u308c\u307e\u305b\u3093\u3002
add.node.connector.displayName=JMX \u30b3\u30cd\u30af\u30bf\u30fc\u30fb\u30bf\u30a4\u30d7
add.node.connector.description=\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u5834\u5408\u306b\u4f7f\u7528\u3055\u308c\u308b JMX \u30b3\u30cd\u30af\u30bf\u30fc\u306e\u30bf\u30a4\u30d7
add.node.soap.displayName=SOAP
add.node.rmi.displayName=RMI
add.node.user.displayName=\u30e6\u30fc\u30b6\u30fc ID
add.node.user.description=\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u304c\u4f7f\u7528\u53ef\u80fd\u306a\u305f\u3081\u3001\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u3068\u901a\u4fe1\u3059\u308b\u305f\u3081\u306b\u3001\u30ea\u30e2\u30fc\u30c8 WebSphere \u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u306b\u306f\u3001\u30e6\u30fc\u30b6\u30fc ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5165\u529b\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002
add.node.password.displayName=\u30d1\u30b9\u30ef\u30fc\u30c9
add.node.password.description=\u4e0a\u8a18\u3067\u5165\u529b\u3055\u308c\u305f\u30e6\u30fc\u30b6\u30fc ID \u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3002
add.node.null.user.name=\u30e6\u30fc\u30b6\u30fc ID \u306f\u5fc5\u8981\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3059
add.node.null.password=\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u5fc5\u8981\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3059
add.node.status.adding=\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0
add.node.status.logout=\u65b0\u898f\u30ce\u30fc\u30c9\u306f\u3001\u518d\u5ea6\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u307e\u3067\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u3067\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093
add.node.status.logout.link=WebSphere \u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u304b\u3089\u306e\u30ed\u30b0\u30a2\u30a6\u30c8
remove.node.status.removing=\u30ce\u30fc\u30c9\u306e\u9664\u53bb
remove.node.status.logout=\u30ce\u30fc\u30c9\u306f\u3001\u518d\u5ea6\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u307e\u3067\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u306b\u30ea\u30b9\u30c8\u3055\u308c\u307e\u3059

null.host.name=\u30db\u30b9\u30c8\u540d\u306f\u5fc5\u8981\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3059
null.port=\u30dd\u30fc\u30c8\u306f\u5fc5\u8981\u30d1\u30e9\u30e1\u30fc\u30bf\u30fc\u3067\u3059
add.node.failed=\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30ed\u30b0\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
add.node.failed.connector.exception=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30ea\u30e2\u30fc\u30c8\u30fb\u30b5\u30fc\u30d0\u30fc\u306b\u63a5\u7d9a\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u30db\u30b9\u30c8\u540d\u3068\u30dd\u30fc\u30c8\u5024\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
add.node.initiated=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u304c\u30db\u30b9\u30c8 {0} \u4e0a\u306e\u30ce\u30fc\u30c9\u306e\u3001\u30bb\u30eb\u3078\u306e\u7d71\u5408\u3092\u958b\u59cb\u3057\u307e\u3057\u305f\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u3001\u6570\u5206\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001{0} \u306b\u3042\u308b addNode.log \u30d5\u30a1\u30a4\u30eb\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u5b8c\u4e86\u5f8c\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u5185\u306e\u65b0\u898f\u30ce\u30fc\u30c9\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u3001\u518d\u3073\u30b3\u30f3\u30bd\u30fc\u30eb\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 
remove.node.initiated=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306f\u3001\u30bb\u30eb\u304b\u3089 {0} \u3092\u9664\u53bb\u3057\u307e\u3059\u3002 \u3053\u306e\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306b\u306f\u3001\u6570\u5206\u304b\u304b\u308b\u3053\u3068\u304c\u3042\u308a\u307e\u3059\u3002 \u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u5b8c\u4e86\u5f8c\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u5185\u306e\u4f7f\u7528\u53ef\u80fd\u30ce\u30fc\u30c9\u306e\u30ea\u30b9\u30c8\u304b\u3089\u9664\u53bb\u3055\u308c\u305f\u30ce\u30fc\u30c9\u3092\u78ba\u8a8d\u3059\u308b\u305f\u3081\u306b\u3001\u518d\u3073\u30b3\u30f3\u30bd\u30fc\u30eb\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059\u3002 
remove.node.failed=\u30ce\u30fc\u30c9 {0} \u306e\u9664\u53bb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u8a73\u3057\u304f\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u30fb\u30ed\u30b0\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
remove.node.node.agent.not.active=\u30ce\u30fc\u30c9 {0} \u4e0a\u306e\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 \u30ce\u30fc\u30c9\u3092\u9664\u53bb\u3067\u304d\u307e\u305b\u3093\u3002 
remote.instance.not.found=\u30ea\u30e2\u30fc\u30c8\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30ce\u30fc\u30c9\u306e\u8ffd\u52a0\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u304c\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u30db\u30b9\u30c8\u5024\u3068\u30dd\u30fc\u30c8\u5024\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u3001\u30ea\u30e2\u30fc\u30c8\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u30fb\u30a4\u30f3\u30b9\u30bf\u30f3\u30b9\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sync.request.submitted=\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u4f7f\u3063\u305f\u30ce\u30fc\u30c9 {0} \u4e0a\u306e\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306e\u540c\u671f\u3092\u6b63\u5e38\u306b\u958b\u59cb\u3057\u307e\u3057\u305f\u3002
node.sync.failed=\u30ce\u30fc\u30c9 {0} \u306b\u5bfe\u3059\u308b\u540c\u671f\u8981\u6c42\u306e\u958b\u59cb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ed\u30b0\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
this.node.can.not.be.synchronized=\u540c\u671f\u5316\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30ce\u30fc\u30c9 {0} \u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093
this.node.can.not.be.removed=\u9664\u53bb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30ce\u30fc\u30c9 {0} \u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093
this.node.can.not.be.stopped=\u505c\u6b62\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30c7\u30d7\u30ed\u30a4\u30e1\u30f3\u30c8\u30fb\u30de\u30cd\u30fc\u30b8\u30e3\u30fc\u30fb\u30ce\u30fc\u30c9 {0} \u306b\u306f\u9069\u7528\u3055\u308c\u307e\u305b\u3093
this.node.already.synchronized=\u30ce\u30fc\u30c9 {0} \u306f\u3059\u3067\u306b\u540c\u671f\u5316\u3055\u308c\u3066\u3044\u307e\u3059
node.agent.must.be.active.for.sync=\u540c\u671f\u5316\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u30a2\u30af\u30c6\u30a3\u30d6\u3067\u306f\u306a\u3044\u305f\u3081\u306b\u3001\u30ce\u30fc\u30c9 {0} \u3067\u5b9f\u884c\u3067\u304d\u307e\u305b\u3093
ExecutionState.UNKNOWN=\u4e0d\u660e
button.sync=\u540c\u671f\u5316
button.syncall=\u3059\u3079\u3066\u306e\u540c\u671f\u5316
button.fullresync=\u5b8c\u5168\u306a\u518d\u540c\u671f

plugincfg.generation.failed=Web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u306e\u66f4\u65b0\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002 \u8a73\u3057\u304f\u306f\u3001\u30ed\u30b0\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
plugincfg.generated=Web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u306f\u3001\u6b63\u5e38\u306b\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f\u3002
update.plugincfg=Web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u306e\u66f4\u65b0

explore.title=<span class="bluebold">WebSphere Application Server </span><span class="purpletext">on IBM.com</span>
explore.link.text=http:// www-3.ibm.com / software / webservers / appserv/
explore.desc=<span class="desctext">\u30b5\u30dd\u30fc\u30c8\u306e\u5834\u6240\u3002WebSphere \u30d5\u30e9\u30c3\u30b7\u30e5\u3001FAQ\u3001\u30d2\u30f3\u30c8\u3001\u304a\u3088\u3073\u30c6\u30af\u30cb\u30ab\u30eb\u30fb\u30ce\u30fc\u30c8\u306a\u3069\u3002  \u307e\u305f\u3001\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3001\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3001\u30cb\u30e5\u30fc\u30b9\u3001\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u5f79\u306b\u7acb\u3064\u60c5\u5831\u3082\u3042\u308a\u307e\u3059\u3002</span>

about.title=<label for="abouttext"><span class="graytext">WebSphere Application Server</span> <spanclass="purplebold">\u306b\u3064\u3044\u3066</span></label>
about.link.text=\u30a2\u30af\u30bb\u30b9\u30fb\u30d8\u30eb\u30d7
about.build.num=\u30d3\u30eb\u30c9\u756a\u53f7:
about.build.date=\u30d3\u30eb\u30c9\u65e5:

developer.domain.title=<span class="bluebold">WebSphere Developer Domain</span>
developer.domain.link.text=http:// www7b.software.ibm.com / wsdd / 
developer.domain.desc=<span class="desctext">\u6700\u65b0\u306e\u6280\u8853\u9762\u306b\u95a2\u3059\u308b\u8ad6\u6587\u3001\u6700\u826f\u5b9f\u4f8b\u3001\u89e3\u8aac\u306f\u3001<a href="http://www7b.software.ibm.com/wsdd/zones/was/" target="_blank">WebSphere Application Server \u30be\u30fc\u30f3</a>\u304b\u3089\u5165\u624b\u3057\u3066\u304f\u3060\u3055\u3044\u3002 WebSphere Application Server \u3068 <a href="http://www7b.software.ibm.com/webapp/wsdd/wasServlet3" target="_blank">\u65b0\u898f\u88fd\u54c1\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u306e\u8981\u6c42</a>\u306e\u5c55\u958b\u306b\u5f71\u97ff\u3092\u4e0e\u3048\u307e\u3059\u3002</span>

infocenter.title=<span class="bluebold">InfoCenter</span>
infocenter.link.text=http:// www-3.ibm.com / software / webservers / appserv/
infocenter.desc=<span class="desctext">\u88fd\u54c1\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u304a\u3088\u3073\u6a5f\u80fd\u306b\u95a2\u3059\u308b\u30bf\u30b9\u30af\u3001\u30ea\u30d5\u30a1\u30ec\u30f3\u30b9\u3001\u304a\u3088\u3073\u6982\u5ff5\u60c5\u5831\u3092\u542b\u3080\u3001\u88fd\u54c1\u30c9\u30ad\u30e5\u30e1\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u306e\u5b8c\u5168\u30bd\u30fc\u30b9\u3002</span>
remove.node.title=\u30ce\u30fc\u30c9\u306e\u9664\u53bb
remove.node.help=\u30ce\u30fc\u30c9\u3092\u9664\u53bb\u3059\u308b\u3068\u3001\u305d\u306e\u30ce\u30fc\u30c9\u306f\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u304b\u3089\u5373\u6642\u306b\u9664\u53bb\u3055\u308c\u307e\u3059\u3002 \u518d\u5ea6\u30b3\u30f3\u30bd\u30fc\u30eb\u306b\u30ed\u30b0\u30a4\u30f3\u3059\u308b\u307e\u3067\u3001\u5909\u66f4\u306f\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306b\u53cd\u6620\u3055\u308c\u307e\u305b\u3093\u3002 
remove.node.confirm=\u300cOK\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u4ee5\u4e0b\u306e\u30ce\u30fc\u30c9\u3092\u9664\u53bb\u3059\u308b\u304b\u3001\u300c\u30ad\u30e3\u30f3\u30bb\u30eb\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u524d\u306e\u30da\u30fc\u30b8\u306b\u623b\u308a\u307e\u3059\u3002 
remove.node.only.select.one.node=\u30ce\u30fc\u30c9\u306e\u9664\u53bb\u30aa\u30da\u30ec\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u4e00\u5ea6\u306b 1 \u30ce\u30fc\u30c9\u306b\u306e\u307f\u884c\u3048\u307e\u3059\u3002
download.plugincfg=\u73fe\u884c\u306e web \u30b5\u30fc\u30d0\u30fc\u30fb\u30d7\u30e9\u30b0\u30a4\u30f3\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092\u8868\u793a\u307e\u305f\u306f\u30c0\u30a6\u30f3\u30ed\u30fc\u30c9\u3057\u307e\u3059

