# IBM Confidential OCO Source Material
# 5639-D57, 5630-A36, 5630-A37, 5724-D18 (C) COPYRIGHT International Business Machines Corp. 1997, 2002
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#==================================================================================================
#
# TRANSLATION / TRANSLATOR NOTES:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided. 
#
#==================================================================================================
#
# DEVELOPER NOTES:
#
# This file has been modified to follow the WebSphere Message Guidelines.
# For more information, visit:
#   http://seaux.raleigh.ibm.com/g11n/was/seae/45/messages/index.html
# or contact Dennis Hebert/Raleigh/IBM (hebert@us.ibm.com)
#
# cmvc_en_version_level=1.50,0,02/07/10,12:51:45
#
#CMVCPATHNAME ws/code/webui.environment/src/environment/WEB-INF/plugin.nlsprops
#ISMESSAGEFILE FALSE

nav.webSphere.environment.configuration=Ambiente
nav.view.virtual.hosts=Hosts Virtuais

nav.view.name.space.bindings=Liga\u00e7\u00f5es de Espa\u00e7o de Nomes
nav.view.libraries=Bibliotecas compartilhadas

environment.label.string=String
environment.label.ejb=EJB
environment.label.corba=CORBA
environment.label.indirect=Indirect
environment.label.name=Nome
environment.label.description=Descri\u00e7\u00e3o
environment.label.scope=Escopo \
    
error.virtualhost.not.found=O host virtual n\u00e3o foi localizado.
error.duplicate.virtualhost.name=<span class\="validation-error">Erro \: O host virtual "{0}" j\u00e1 existe.</span><br>
warning.virtualhost.name.change=Alterar as defini\u00e7\u00f5es desse host virtual pode afetar os aplicativos que est\u00e3o atualmente ligados para serem executados nele.  Ser\u00e1 necess\u00e1rio examinar manualmente os mapeamentos do Host Virtual de cada aplicativo para assegurar que estejam corretos.
error.noMimeEntry=<li>Falta Tipo MIME</li>
error.mimeentry.not.found=A entrada MIME n\u00e3o foi localizada.
error.hostalias.not.found=O alias do host n\u00e3o foi localizado.
error.variable.not.found=A vari\u00e1vel n\u00e3o foi localizada.
missing.required.values=Valores obrigat\u00f3rios ausentes.
warning.duplicate.namespacebinding.name=<span class\="validation-warn-info">Aviso \: O identificador de liga\u00e7\u00e3o "{0}" j\u00e1 existe neste escopo.</span><br>
warning.duplicate.namespacebinding.nameInNameSpace=<span class\="validation-warn-info">Aviso \: Uma liga\u00e7\u00e3o com o nome no espa\u00e7o de nomes "{0}" j\u00e1 est\u00e1 configurada neste escopo.</span><br>
error.namespacebinding.not.found=A liga\u00e7\u00e3o do espa\u00e7o de nomes n\u00e3o foi localizada.
error.library.not.found=A biblioteca n\u00e3o foi localizada.
error.node.not.found=O n\u00f3 n\u00e3o foi localizado.
error.replicators.not.defined=Um ou mais dom\u00ednios n\u00e3o possuem replicadores definidos
error.replicators.dont.exist=Nenhum dos dom\u00ednios existentes possui replicadores definidos

VirtualHost.displayName=Hosts Virtuais
VirtualHost.description=Configura\u00e7\u00e3o para permitir que uma \u00fanica m\u00e1quina host se pare\u00e7a com v\u00e1rias m\u00e1quinas host. Cada host virtual tem um nome l\u00f3gico e uma lista de um ou mais \
aliases DNS pelos quais ele \u00e9 conhecido.

VirtualHost.smallIcon=VirtualHost.gif
VirtualHost.largeIcon=VirtualHost32X32.gif
VirtualHost.name.description=Especifica um nome l\u00f3gico utilizado para configurar aplicativos da Web \
 para um determinado nome de host. O host virtual padr\u00e3o \u00e9 adequado para as configura\u00e7\u00f5es mais simples.
VirtualHost.aliases.displayName= Aliases do Host
VirtualHost.aliases.description=Uma lista de um ou mais aliases DNS pelos quais o host virtual \u00e9 conhecido.
VirtualHost.mimeTypes.displayName=Tipos MIME
VirtualHost.mimeTypes.description=Uma cole\u00e7\u00e3o de mapeamentos de extens\u00f5es de tipos MIME definidos para o host virtual. Se as entradas MIME n\u00e3o forem especificadas no n\u00edvel do m\u00f3dulo da Web, essas entradas ser\u00e3o aplicadas.
virtual.host.must.be.selected=Voc\u00ea deve selecionar pelo menos um host virtual para executar esta a\u00e7\u00e3o.

MimeEntry.displayName=Tipo MIME
MimeEntry.description=Configura\u00e7\u00e3o para mapeamento de tipos MIME para extens\u00f5es.
MimeEntry.smallIcon=MimeEntry.gif
MimeEntry.largeIcon=MimeEntry32X32.gif
MimeEntry.type.description=Especifica um tipo MIME ao qual as extens\u00f5es de nome de arquivo do tipo s\u00e3o mapeadas.
MimeEntry.extensions.displayName=Extens\u00f5es
MimeEntry.extensions.description=Lista as extens\u00f5es de arquivo que s\u00e3o mapeadas para o tipo MIME.
HostAlias.displayName=Nome do Host
HostAlias.description=Um alias \u00e9 o host DNS e o n\u00famero da porta utilizado por um cliente para formar o pedido da URL de um Recurso de Aplicativo da Web (como um servlet, p\u00e1gina JSP ou HTML). Por exemplo, a parte "myhost:8080" de http://myhost:8080/servlet/snoop. Quando n\u00e3o for especificado nenhum n\u00famero de porta, a porta padr\u00e3o 80 \u00e9 utilizada.
HostAlias.smallIcon=HostAlias.gif
HostAlias.largeIcon=HostAlias32X32.gif
HostAlias.hostname.description=O endere\u00e7o IP, o nome do host de DNS com o sufixo de nome de dom\u00ednio ou apenas o nome do host de DNS, utilizado por um cliente para solicitar um recurso de aplicativo da Web (como um servlet, JSP ou p\u00e1gina HTML).
HostAlias.port.displayName=Porta
HostAlias.port.description=A porta para a qual o servidor Web foi configurado para aceitar \
 pedidos do cliente. Especifica um valor de porta em conjunto com o nome do host.

plugincfg.title=Atualizar Web Server Plug-in
plugincfg.description=Clique no bot\u00e3o OK para atualizar o arquivo de configura\u00e7\u00e3o de plug-in.
plugincfg.help=O arquivo de configura\u00e7\u00e3o de plugin do servidor da Web controla qual conte\u00fado \u00e9 transferido a partir do servidor da Web a um servidor de aplicativo. Este arquivo deve ser regenerado quando as configura\u00e7\u00f5es de alias do servidor, do cluster, do transporte HTTP ou do host virtual s\u00e3o alteradas. O arquivo gerado plugin-cfg.xml \u00e9 colocado no diret\u00f3rio de config da instala\u00e7\u00e3o do WebSphere. Se seu servidor da Web for localizado em uma m\u00e1quina remota, voc\u00ea deve deslocar este arquivo manualmente para esta m\u00e1quina.


nav.view.variable.substitution.entry=Gerenciar Vari\u00e1veis do WebSphere
VariableSubstitutionEntry.displayName=Vari\u00e1veis do WebSphere
VariableSubstitutionEntry.description=As vari\u00e1veis de substitui\u00e7\u00e3o permitem especificar um n\u00edvel de via indireta para os valores definidos no sistema, como ra\u00edzes do sistema de arquivos. As vari\u00e1veis podem ser definidas no n\u00edvel do servidor, do n\u00f3 ou da c\u00e9lula.  Quando vari\u00e1veis em diferentes escopos possuem o mesmo nome, a ordem de resolu\u00e7\u00e3o \u00e9: vari\u00e1veis do servidor, vari\u00e1veis do n\u00f3 e vari\u00e1veis da c\u00e9lula.
VariableSubstitutionEntry.smallIcon=VariableSubstitutionEntry.gif
VariableSubstitutionEntry.largeIcon=VariableSubstitutionEntry32X32.gif
VariableSubstitutionEntry.symbolicName.description=Especifica o nome simb\u00f3lico que representa um caminho f\u00edsico ou raiz da URL.
VariableSubstitutionEntry.value.displayName=Valor
VariableSubstitutionEntry.value.description=Especifica o caminho absoluto que o nome simb\u00f3lico representa.
VariableSubstitutionEntry.description.description=Fornece uma descri\u00e7\u00e3o opcional para seus registros administrativos.

NameSpaceBinding.displayName=Liga\u00e7\u00f5es de Espa\u00e7o de Nomes
NameSpaceBinding.description=Utilize esta p\u00e1gina para configurar uma liga\u00e7\u00e3o de nome de um bean corporativo, um Contexto de Nomenclatura CORBA CosNaming ou objeto n\u00f3 de folha CORBA, um objeto que pode ser procurado utilizando o JNDI ou de um valor de cadeia constante.
NameSpaceBinding.smallIcon=NameSpaceBinding.gif
NameSpaceBinding.largeIcon=NameSpaceBinding32X32.gif
NameSpaceBinding.name.displayName=Identificador de Liga\u00e7\u00e3o
NameSpaceBinding.name.description=O nome determinado para identificar exclusivamente esta liga\u00e7\u00e3o configurada.
NameSpaceBinding.nameInNameSpace.displayName=Nome no Espa\u00e7o de Nomes
NameSpaceBinding.nameInNameSpace.description=O nome utilizado para esta liga\u00e7\u00e3o no espa\u00e7o de nomes. Simples ou \
composto relativo \u00e0 parte do espa\u00e7o de nomes em que esta liga\u00e7\u00e3o est\u00e1 configurada.
NameSpaceBinding.bindingType.description=O tipo de liga\u00e7\u00e3o configurada. Poss\u00edveis op\u00e7\u00f5es s\u00e3o Cadeia, EJB, CORBA e Indireto.
NameSpaceBinding.bindingType.displayName=Tipo de Liga\u00e7\u00e3o
NameSpaceBinding.namingContext.description=O escopo da liga\u00e7\u00e3o configurada. Esse valor indica a localiza\u00e7\u00e3o da configura\u00e7\u00e3o para o arquivo namebindings.xml.
EjbNameSpaceBinding.displayName=EjbNameSpaceBinding
EjbNameSpaceBinding.description=Utilize esta p\u00e1gina para configurar uma liga\u00e7\u00e3o de nome de um in\u00edcio de bean corporativo que j\u00e1 foi configurado em algum servidor dentro da c\u00e9lula.
EjbNameSpaceBinding.smallIcon=EjbNameSpaceBinding.gif
EjbNameSpaceBinding.largeIcon=EjbNameSpaceBinding32X32.gif
EjbNameSpaceBinding.ejbJndiName.displayName=Nome JNDI
EjbNameSpaceBinding.ejbJndiName.description=O nome JNDI do bean corporativo implementado (o nome JNDI do bean que est\u00e1 nas liga\u00e7\u00f5es no bean corporativo--n\u00e3o o nome java:comp).
EjbNameSpaceBinding.applicationServerName.displayName=Servidor
EjbNameSpaceBinding.applicationServerName.description=O nome do servidor cluster ou n\u00e3o-cluster em que o bean corporativo est\u00e1 configurado.
EjbNameSpaceBinding.applicationNodeName.displayName=N\u00f3
EjbNameSpaceBinding.serverCluster.displayName=Cluster de Servidor
EjbNameSpaceBinding.singleServer.displayName=\u00danico Servidor (o n\u00f3 \u00e9 requerido)
EjbNameSpaceBinding.bindingLocation.displayName=Localiza\u00e7\u00e3o do Bean Corporativo
EjbNameSpaceBinding.bindingLocation.description=Especifique a localiza\u00e7\u00e3o do bean corporativo.
EjbNameSpaceBinding.bindingLocation.description.base=Especifique a localiza\u00e7\u00e3o do bean corporativo, fornecendo o nome de n\u00f3.
EjbNameSpaceBinding.bindingLocation.description.nd=Especifique a localiza\u00e7\u00e3o do bean corporativo.  Se o bean corporativo estiver sendo executado em um cluster de servidores, selecione 'Cluster de Servidores'.  Caso contr\u00e1rio, selecione 'Servidor \u00danico' e forne\u00e7a o nome de n\u00f3.
CORBAObjectNameSpaceBinding.displayName=CORBAObjectNameSpaceBinding
CORBAObjectNameSpaceBinding.description=Uitlize esta p\u00e1gina para configurar uma liga\u00e7\u00e3o denome de um in\u00edcio de CORBA que j\u00e1 foi configurado em algum servidor dentro da c\u00e9lula.
CORBAObjectNameSpaceBinding.smallIcon=CORBAObjectNameSpaceBinding.gif
CORBAObjectNameSpaceBinding.largeIcon=CORBAObjectNameSpaceBinding32X32.gif
CORBAObjectNameSpaceBinding.corbanameUrl.displayName=URL do nome da CORBA
CORBAObjectNameSpaceBinding.corbanameUrl.description=Uma cadeia de URL \
do nome CORBA que identifica onde o objeto est\u00e1 ligado em um servidor CosNaming.
CORBAObjectNameSpaceBinding.federatedContext.displayName=Contexto Federado
CORBAObjectNameSpaceBinding.federatedContext.description=Se selecionado, o destino ser\u00e1 um contexto CosNaming .Se n\u00e3o for selecionado, o destino \u00e9 um objeto de n\u00f3 folha.
IndirectLookupNameSpaceBinding.displayName=IndirectLookupNameSpaceBinding
IndirectLookupNameSpaceBinding.description=Utilize esta p\u00e1gina para configurar uma liga\u00e7\u00e3o de nome de um objeto que pode ser procurado utilizando JNDI.
IndirectLookupNameSpaceBinding.smallIcon=IndirectLookupNameSpaceBinding.gif
IndirectLookupNameSpaceBinding.largeIcon=IndirectLookupNameSpaceBinding32X32.gif
IndirectLookupNameSpaceBinding.providerURL.displayName=URL do Provedor
IndirectLookupNameSpaceBinding.providerURL.description=A cadeia de URL do Provedor necess\u00e1ria para obter um contexto JNDI inicial.
IndirectLookupNameSpaceBinding.jndiName.displayName=Nome JNDI
IndirectLookupNameSpaceBinding.jndiName.description=O nome utilizado para procurar o objeto de destino a partir do contexto inicial.
StringNameSpaceBinding.displayName=StringNameSpaceBinding
StringNameSpaceBinding.description=Utilize esta p\u00e1gina para configurar uma liga\u00e7\u00e3o de nome de um valor de cadeia constante.
StringNameSpaceBinding.smallIcon=StringNameSpaceBinding.gif
StringNameSpaceBinding.largeIcon=StringNameSpaceBinding32X32.gif
StringNameSpaceBinding.stringToBind.displayName=Valor da Cadeia
StringNameSpaceBinding.stringToBind.description=A cadeia a ser ligada dentro do espa\u00e7o de nomes.
NameSpaceBinding.create.new=Nova Liga\u00e7\u00e3o de Espa\u00e7o de Nomes
NameSpaceBinding.create.new.description=Utilize este assistente para configurar uma liga\u00e7\u00e3o de espa\u00e7o de nomes.
NameSpaceBinding.new.step1=Especificar o tipo de liga\u00e7\u00e3o
NameSpaceBinding.new.step2.ejb=Especificar as propriedades b\u00e1sicas
NameSpaceBinding.new.step2.corba=Especificar as propriedades b\u00e1sicas
NameSpaceBinding.new.step2.indirect=Especificar as propriedades b\u00e1sicas
NameSpaceBinding.new.step2.string=Especificar as propriedades b\u00e1sicas
NameSpaceBinding.new.step3=Resumo

Node.displayName=N\u00f3
Node.description=Uma lista de n\u00f3s nesta c\u00e9lula. \u00c9 poss\u00edvel adicionar novos n\u00f3s na c\u00e9lula clicando em "Adicionar N\u00f3" e especificado uma inst\u00e2ncia remota do WebSphere Application Server em execu\u00e7\u00e3o.
Node.largeIcon=Node32X32.gif
Node.properties.displayName=Propriedades Personalizadas
Node.properties.description=Propriedades de configura\u00e7\u00e3o arbitr\u00e1rias que aplicam-se a este n\u00f3.
Node.name.displayName=Nome
Node.name.description=Especifica um nome l\u00f3gico para o n\u00f3. O nome deve ser exclusivo dentro da c\u00e9lula.
Node.status.displayName=Status
Node.synchronized=Sincronizado
Node.not.synchronized=N\u00e3o sincronizado
Node.discoveryProtocol.displayName=Protocolo do Discovery
Node.discoveryProtocol.description=Especifica o protocolo que o n\u00f3 segue para recuperar informa\u00e7\u00f5es de uma rede.
Cell.nodes.displayName=N\u00f3s
Cell.nodes.description=N\u00f3s definidos nesta c\u00e9lula
Cell.displayName=C\u00e9lula
Cell.description=Um agrupamento l\u00f3gico de n\u00f3s do WebSphere com a finalidade de administra\u00e7\u00e3o comum.
Cell.largeIcon=Cell32X32.gif
Cell.foreignCells.displayName=C\u00e9lulas externas
Cell.foreignCells.description=O Dom\u00ednio mant\u00e9m uma cole\u00e7\u00e3o de objetos de Dom\u00ednio externos que podem ser utilizados para acessar um dom\u00ednio diferente.

Cell.properties.displayName=Propriedades Personalizadas
Cell.properties.description=Propriedades de configura\u00e7\u00e3o arbitr\u00e1rias que aplicam-se a esta c\u00e9lula.
Cell.name.displayName=Nome
Cell.name.description=Especifica o nome da c\u00e9lula existente.
Cell.cellDiscoveryProtocol.displayName=Protocolo de Discovery de C\u00e9lula
Cell.cellDiscoveryProtocol.description=Especifica o protocolo que a c\u00e9lula segue para recuperar informa\u00e7\u00f5es de uma rede.
Cell.discoveryAddressEndpointName.displayName=Nome do n\u00f3 de \
extremidade de endere\u00e7o da Discovery
Cell.discoveryAddressEndpointName.description=Especifica o nome do n\u00f3 de extremidade que cont\u00e9m o endere\u00e7o de discovery.
Cell.multicastDiscoveryAddressEndpointName.displayName=Nome do n\u00f3 de \
extremidade de endere\u00e7o da Discovery de multicast.
Cell.multicastDiscoveryAddressEndpointName.description=Especifica o nome do ponto de extremidade que cont\u00e9m o endere\u00e7o discovery multicast.

EndPoint.displayName=N\u00f3 de Extremidade
EndPoint.description=Especifica um n\u00f3 de extremidade de \
comunica\u00e7\u00e3o utilizado por servi\u00e7os ou componentes de runtime que \
executam dentro de um processo.
EndPoint.smallIcon=EndPoint.gif
EndPoint.largeIcon=EndPoint32X32.gif
EndPoint.host.displayName=Host
EndPoint.host.description=O endere\u00e7o IP, o nome do host de DNS com o sufixo de nome de dom\u00ednio ou apenas o nome do host de DNS, utilizado por um cliente para solicitar um recurso de aplicativo da Web (como um servlet, JSP ou p\u00e1gina HTML).
EndPoint.port.displayName=Porta
EndPoint.port.description=A porta para a qual o servidor Web foi configurado para aceitar \
 pedidos do cliente. Especifica um valor de porta em conjunto com o nome do host.

TCPIPProtocolType.UDP=UDP
TCPIPProtocolType.TCP=TCP
TCPIPProtocolType.MULTICAST=MULTICAST

Transport.displayName=Transporte
Transport.description=Os processos do servidor podem suportar v\u00e1rios \
transportes para IPC.  Os processos clientes conectam o servidor \
utilizando um dos transportes suportados pelo servidor.
Transport.smallIcon=Transport.gif
Transport.largeIcon=Transport32X32.gif
Transport.address.displayName=endere\u00e7o
Transport.address.description=Especifica o endere\u00e7o a conectar para o transporte.
Transport.properties.displayName=Propriedades
Transport.properties.description=Propriedades de configura\u00e7\u00e3o especiais para o transporte. Cada \
tipo de transporte pode conter propriedades personalizadas \
especificadas pelo provedor de transporte. \
Consulte a documenta\u00e7\u00e3o para cada tipo de transporte a fim de \
determinar se h\u00e1 nomes de propriedades de transporte especiais e \
quais s\u00e3o os valores poss\u00edveis de cada propriedade especial.
Transport.external.displayName=Externo
Transport.external.description=Especifica se este transporte destina-se a uso interno ou externo.
Transport.sslEnabled.displayName=SSL Ativado
Transport.sslEnabled.description=Especifica se as conex\u00f5es entre o plug-in WebSphere e o servidor de aplicativos devem ser protegidas com Secure Socket Layer (SSL). O padr\u00e3o \u00e9 n\u00e3o utilizar SSL.
Transport.sslConfig.displayName=SSL
Transport.sslConfig.description=Especifica o tipo de defini\u00e7\u00f5es do SSL (Secure Socket Layer) para conex\u00f5es \
 entre o plug-in do WebSphere e o servidor de aplicativos. As op\u00e7\u00f5es incluem uma ou mais defini\u00e7\u00f5es \
 de SSL estabelecidas no Centro de Seguran\u00e7a; por exemplo, DefaultSSLSettings, \
 ORBSSLSettings ou LDAPSSLSettings.
Property.displayName=Propriedade
Property.description=Especifica os pares de dados nome/valor arbitr\u00e1rios, em que o nome \u00e9 a chave de propriedade e o valor \u00e9 um valor de cadeia que pode ser utilizado para definir propriedades de configura\u00e7\u00e3o do sistema interno.
Property.smallIcon=Property.gif
Property.largeIcon=Property32X32.gif
Property.name.displayName=Nome
Property.name.description=Especifica o nome (ou chave) da propriedade.
Property.value.displayName=Valor
Property.value.description=Especifica o valor emparelhado com o nome especificado.
Property.description.displayName=Descri\u00e7\u00e3o
Property.description.description=Fornece informa\u00e7\u00f5es sobre o par de nome-valor.
Property.required.displayName=Obrigat\u00f3rio
Property.required.description=Um atributo opcional que especifica se \
\u00e9 necess\u00e1rio que esta propriedade tenha um valor.
Property.validationExpression.displayName=Express\u00e3o de Valida\u00e7\u00e3o
Property.validationExpression.description=O console ou outras \
ferramentas utilizam este valor para validar o conte\u00fado do valor para \
esta propriedade.

PropertySet.displayName=Conjunto de Propriedades
PropertySet.description=Uma cole\u00e7\u00e3o de propriedades que s\u00e3o \
utilizadas para algumas finalidades.
PropertySet.smallIcon=PropertySet.gif
PropertySet.largeIcon=PropertySet32X32.gif
PropertySet.properties.displayName=Propriedades
PropertySet.properties.description=Alguns componentes de tempo de execu\u00e7\u00e3o permitem um conjunto de propriedades adicionais, que podem ser utilizadas para personaliza\u00e7\u00e3o. Consulte a documenta\u00e7\u00e3o relacionada ao componente de tempo de execu\u00e7\u00e3o para determinar se podem ser utilizadas propriedades especiais.
PropertySet.properties.TypedProperty.displayName=Propriedades de Tipo
PropertySet.description.displayName=descri\u00e7\u00e3o
PropertySet.description.description=Alguns componentes de tempo de execu\u00e7\u00e3o permitem um conjunto de propriedades adicionais, que podem ser utilizadas para personaliza\u00e7\u00e3o. Consulte a documenta\u00e7\u00e3o relacionada ao componente de tempo de execu\u00e7\u00e3o para determinar se podem ser utilizadas propriedades especiais.

TypedProperty.displayName=Propriedade de Tipo
TypedProperty.description=Valor de propriedade personalizada. Verifique a documenta\u00e7\u00e3o do componente de tempo de execu\u00e7\u00e3o para determinar se h\u00e1 mais propriedades personalizadas suportadas dispon\u00edveis.
TypedProperty.smallIcon=TypedProperty.gif
TypedProperty.largeIcon=TypedProperty32X32.gif
TypedProperty.type.displayName=Tipo
TypedProperty.type.description=Tipo Java completo para esta \
propriedade (java.lang.Integer, java.lang.Byte).

Library.displayName=Bibliotecas compartilhadas
Library.description=Especifica uma biblioteca compartilhada da largura de um cont\u00eainer que pode ser utilizada pelos aplicativos implementados.
Library.name.description=O nome da biblioteca compartilhada
Library.description.description=Uma descri\u00e7\u00e3o opcional para esta biblioteca compartilhada.
Library.classpath.displayName=Classpath
Library.classpath.description=Um classpath que cont\u00e9m este jar de biblioteca. Entradas de classpath s\u00e3o separadas utilizando-se a tecla ENTER e n\u00e3o devem conter \
caracteres de separadores de caminho (como ';' ou ':').  Classpaths podem conter nomes vari\u00e1veis \
(simb\u00f3licos) que podem ser substitu\u00eddos utilizando um mapa de \
vari\u00e1vel.
Library.nativepath.displayName=Caminho da Biblioteca Nativa
Library.nativepath.description=Um caminho opcional para qualquer biblioteca nativa(.dll's, .so's) requerido por esta biblioteca compartilhada.

button.addnode=Adicionar N\u00f3
button.removenode=Remover N\u00f3
add.node.displayName=Adicionar N\u00f3
add.node.description=Especificar uma inst\u00e2ncia remota do WebSphere Application Server para ser adicionada na c\u00e9lula. O servidor remoto deve estar em execu\u00e7\u00e3o.

add.node.host.displayName=Host
add.node.host.description=O nome da rede do n\u00f3 a ser adicionado na c\u00e9lula. Uma inst\u00e2ncia do WebSphere Application Server deve estar em execu\u00e7\u00e3o nesta m\u00e1quina.

add.node.port.displayName=Porta do Conector JMX
add.node.port.description=O n\u00famero da porta do Conector JMX na inst\u00e2ncia a ser adicionada na c\u00e9lula. A porta SOAPConnector padr\u00e3o \u00e9 8880.
add.node.rmi.port.displayName=Porta do Conector RMI
add.node.rmi.port.description=O n\u00famero da porta do Conector RMI na inst\u00e2ncia a ser adicionada na c\u00e9lula. Por padr\u00e3o, essa porta \u00e9 9809.
add.node.include.apps=Incluir Aplicativos
add.node.include.apps.description=Se selecionado, ser\u00e1 feita uma tentativa de copiar os aplicativos instalados na inst\u00e2ncia remota para a c\u00e9lula. Os aplicativos com o mesmo nome que os aplicativos que existem atualmente na c\u00e9lula n\u00e3o ser\u00e3o copiados.
add.node.connector.displayName=Tipo de Conector JMX
add.node.connector.description=O tipo de Conector JMX utilizado para executar a opera\u00e7\u00e3o
add.node.soap.displayName=SOAP
add.node.rmi.displayName=RMI
add.node.user.displayName=ID do usu\u00e1rio
add.node.user.description=Como a seguran\u00e7a est\u00e1 ativada, voc\u00ea deve inserir um ID de usu\u00e1rio e senha para ativar a inst\u00e2ncia remota do WebSphere para comunicar-se com o gerenciador de implementa\u00e7\u00e3o
add.node.password.displayName=Senha
add.node.password.description=A senha para o ID de usu\u00e1rio digitado acima
add.node.null.user.name=O ID do Usu\u00e1rio \u00e9 um par\u00e2metro obrigat\u00f3rio
add.node.null.password=A Senha \u00e9 um par\u00e2metro obrigat\u00f3rio
add.node.status.adding=Incluindo n\u00f3
add.node.status.logout=O novo n\u00f3 n\u00e3o estar\u00e1 dispon\u00edvel no console at\u00e9 que voc\u00ea efetue In\u00edcio de sess\u00e3o novamente.
add.node.status.logout.link=Encerrar sess\u00e3o do Administrative Console do WebSphere
remove.node.status.removing=Removendo n\u00f3
remove.node.status.logout=O n\u00f3 ser\u00e1 listado no console at\u00e9 que voc\u00ea efetue In\u00edcio de sess\u00e3o novamente

null.host.name=O nome do host \u00e9 um par\u00e2metro requerido
null.port=A porta \u00e9 um par\u00e2metro requerido
add.node.failed=Falha na opera\u00e7\u00e3o de inclus\u00e3o de n\u00f3. Verifique os logs do servidor para obter detalhes.

add.node.failed.connector.exception=A opera\u00e7\u00e3o de inclus\u00e3o de n\u00f3 falhou porque o gerenciador de implementa\u00e7\u00e3o n\u00e3o p\u00f4de conectar-se ao servidor remoto. Verifique os valores de porta e nome do host e certifique-se de que o servidor esteja em execu\u00e7\u00e3o.
add.node.initiated=O gerenciador de implementa\u00e7\u00e3o iniciou a federa\u00e7\u00e3o do n\u00f3 no {0} na c\u00e9lula. Esta opera\u00e7\u00e3o pode demorar v\u00e1rios minutos a ser conclu\u00edda. Verifique o arquivo addNode.log em {0} para obter detalhes nesta opera\u00e7\u00e3o. Voc\u00ea precisar\u00e1 efetuar In\u00edcio de sess\u00e3o no console novamente depois que a opera\u00e7\u00e3o for conclu\u00edda para ver o novo n\u00f3 no console.

remove.node.initiated=O gerenciador de implementa\u00e7\u00e3o est\u00e1 removendo {0} da c\u00e9lula. Esta opera\u00e7\u00e3o pode demorar v\u00e1rios minutos a ser conclu\u00edda. Voc\u00ea precisar\u00e1 efetuar In\u00edcio de sess\u00e3o no console novamente depois que a opera\u00e7\u00e3o for conclu\u00edda para ver o n\u00f3 removido da lista de n\u00f3s dispon\u00edveis no console.

remove.node.failed=Falha ao remover o n\u00f3 {0}. Verifique os logs do servidor para obter detalhes.

remove.node.node.agent.not.active=O agente do n\u00f3 no n\u00f3 {0} n\u00e3o est\u00e1 ativo. O n\u00f3 n\u00e3o pode ser removido.

remote.instance.not.found=Falha na opera\u00e7\u00e3o de inclus\u00e3o de n\u00f3 porque a inst\u00e2ncia remota n\u00e3o p\u00f4de ser localizada. Verifique os valores do host e da porta e certifique-se de que a inst\u00e2ncia do servidor de aplicativos remotos esteja em execu\u00e7\u00e3o.
sync.request.submitted=Sincroniza\u00e7\u00e3o iniciada com \u00eaxito do reposit\u00f3rio no n\u00f3 {0} com o reposit\u00f3rio do gerenciador de implementa\u00e7\u00e3o.
node.sync.failed=Falha ao iniciar o pedido de sincroniza\u00e7\u00e3o para o n\u00f3 {0}. Verifique os logs para obter detalhes.

this.node.can.not.be.synchronized=A opera\u00e7\u00e3o de sincroniza\u00e7\u00e3o n\u00e3o \u00e9 aplic\u00e1vel ao n\u00f3 de gerenciador de implementa\u00e7\u00e3o {0}
this.node.can.not.be.removed=A opera\u00e7\u00e3o de remo\u00e7\u00e3o n\u00e3o \u00e9 aplic\u00e1vel ao n\u00f3 do gerenciador de implementa\u00e7\u00e3o {0}
this.node.can.not.be.stopped=A opera\u00e7\u00e3o de parada n\u00e3o \u00e9 aplic\u00e1vel ao n\u00f3 do gerenciador de implementa\u00e7\u00e3o {0}
this.node.already.synchronized=O n\u00f3 {0} j\u00e1 est\u00e1 sincronizado
node.agent.must.be.active.for.sync=A opera\u00e7\u00e3o de sincroniza\u00e7\u00e3o n\u00e3o pode ser executada no n\u00f3 {0} porque seu agente do n\u00f3 n\u00e3o est\u00e1 ativo
ExecutionState.UNKNOWN=Desconhecido
button.sync=Sincronizar
button.syncall=Sincronizar Tudo
button.fullresync=Ressincroniza\u00e7\u00e3o Completa

plugincfg.generation.failed=Ocorreu um erro ao atualizar a configura\u00e7\u00e3o do plugin do servidor da Web. Verifique os logs para obter detalhes.
plugincfg.generated=A configura\u00e7\u00e3o do plugin do servidor da Web foi atualizado com \u00eaxito
update.plugincfg=Atualizar  configura\u00e7\u00e3o do plugin do servidor da Web 
explore.title=<span class="bluebold">WebSphere Application Server </span><span class="purpletext">no IBM.com</span>
explore.link.text=http:// www-3.ibm.com / software / webservers / appserv/
explore.desc=<span class="desctext">O local para suporte; incluindo Flashes, Perguntas Freq\u00fcentes, Dicas e Sugest\u00f5es e Notas T\u00e9cnicas do WebSphere.  Voc\u00ea tamb\u00e9m localizar\u00e1 Downloads, Biblioteca, Not\u00edcias e outras informa\u00e7\u00f5es \u00fateis.</span>

about.title=<label for="abouttext"><spanclass="purplebold">Sobre </span><span class="graytext">seu WebSphere Application Server</span></label>
about.link.text=Acessar a Ajuda
about.build.num=N\u00famero da Compila\u00e7\u00e3o:
about.build.date=Data da Compila\u00e7\u00e3o:
developer.domain.title=<span class="bluebold">WebSphere Developer Domain</span>
developer.domain.link.text=http:// www7b.software.ibm.com / wsdd / 

developer.domain.desc=<span class="desctext">Obtenha os boletins t\u00e9cnicos mais recentes, melhores pr\u00e1ticas, tutoriais e muito mais no <a href="http://www7b.software.ibm.com/wsdd/zones/was/" target="_blank">WebSphere Application Server Zone</a>. Prestigie a evolu\u00e7\u00e3o do WebSphere Application Server e <a href="http://www7b.software.ibm.com/webapp/wsdd/wasServlet3" target="_blank">solicite novos recursos do produto</a>.</span>

infocenter.title=<span class="bluebold">InfoCenter</span>
infocenter.link.text=http:// www-3.ibm.com / software / webservers / appserv/
infocenter.desc=<span class="desctext">A origem completa para documenta\u00e7\u00e3o do produto, incluindo tarefas, refer\u00eancias e informa\u00e7\u00f5es conceituais sobre recursos e fun\u00e7\u00f5es do produto.</span>
remove.node.title=Remover N\u00f3
remove.node.help=A remo\u00e7\u00e3o de um n\u00f3 faz com que ele seja removido imediatamente do reposit\u00f3rio de configura\u00e7\u00e3o master. As altera\u00e7\u00f5es n\u00e3o ser\u00e3o refletidas na \u00e1rea de trabalho at\u00e9 que voc\u00ea efetue In\u00edcio de sess\u00e3o novamente no console.

remove.node.confirm=Clique no bot\u00e3o OK para remover os n\u00f3s a seguir ou clique no bot\u00e3o Cancelar para retornar para a p\u00e1gina anterior.

remove.node.only.select.one.node=A opera\u00e7\u00e3o de n\u00f3 remoto pode desempenhar somente um n\u00f3 de cada vez.
download.plugincfg=Exibir ou fazer o download do atual arquivo de configura\u00e7\u00e3o do plugin do servidor Web

