<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<title>&#37197;&#32622;&#21333;&#20803;&#32423;&#21035;&#30340;&#29616;&#26102;&#26631;&#24535;</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="twbs_confnoncecell"></a>
<h2>
<img alt="[Release 5.1 and later]" src="v51.gif" border="0">&#37197;&#32622;&#21333;&#20803;&#32423;&#21035;&#30340;&#29616;&#26102;&#26631;&#24535;</h2>


<div>&#27492;&#20219;&#21153;&#25552;&#20379;&#26377;&#20851;&#22914;&#20309;&#20351;&#29992; WebSphere Application Server &#31649;&#29702;&#25511;&#21046;&#21488;&#37197;&#32622;&#21333;&#20803;&#32423;&#21035;&#30340;&#29616;&#26102;&#26631;&#24535;&#30340;&#35828;&#26126;&#12290;&#24744;&#21487;&#20197;&#22312;&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;&#12289;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#21333;&#20803;&#32423;&#21035;&#37197;&#32622;&#29616;&#26102;&#26631;&#24535;&#12290;&#20294;&#26159;&#65292;&#24744;&#24517;&#39035;&#32771;&#34385;&#20248;&#20808;&#39034;&#24207;&#12290;&#20197;&#19979;&#21015;&#34920;&#26174;&#31034;&#20248;&#20808;&#39034;&#24207;&#65306;<ol>

<li>&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;</li>

<li>&#26381;&#21153;&#22120;&#32423;&#21035;</li>

<li>&#21333;&#20803;&#32423;&#21035;</li>

</ol>&#22914;&#26524;&#24744;&#22312;&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;&#21644;&#26381;&#21153;&#22120;&#32423;&#21035;&#19978;&#37197;&#32622;&#29616;&#26102;&#26631;&#24535;&#65292;&#21017;&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;&#25351;&#23450;&#30340;&#20540;&#20248;&#20808;&#20110;&#26381;&#21153;&#22120;&#32423;&#21035;&#25351;&#23450;&#30340;&#20540;&#12290;&#21516;&#26679;&#22320;&#65292;&#24212;&#29992;&#31243;&#24207;&#32423;&#21035;&#25351;&#23450;&#30340;&#20540;&#20248;&#20808;&#20110;&#26381;&#21153;&#22120;&#32423;&#21035;&#21644;&#21333;&#20803;&#32423;&#21035;&#25351;&#23450;&#30340;&#20540;&#12290;&#22312; WebSphere Application Server Network Deployment &#20013;&#65292;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#12289;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#21644;<strong>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>&#23383;&#27573;&#23545;&#20110;&#26377;&#25928;&#20351;&#29992;&#29616;&#26102;&#26631;&#24535;&#26159;&#24517;&#38656;&#30340;&#12290;&#20294;&#26159;&#65292;&#36825;&#20123;&#23383;&#27573;&#22312;&#26381;&#21153;&#22120;&#32423;&#21035;&#19978;&#26159;&#21487;&#36873;&#30340;&#12290;&#23436;&#25104;&#19979;&#21015;&#27493;&#39588;&#20197;&#22312;&#21333;&#20803;&#32423;&#21035;&#19978;&#37197;&#32622;&#29616;&#26102;&#26631;&#24535;&#65306;</div>

<div>
<p class="sectiontitle">&#27492;&#20219;&#21153;&#30340;&#27493;&#39588;</p>
<ol>

<li>&#38500;&#38750;&#24744;&#26356;&#25913;&#20102;&#31471;&#21475;&#21495;&#65292;&#21542;&#21017;&#36890;&#36807;&#22312;&#24744;&#30340; Web &#27983;&#35272;&#22120;&#20013;&#36755;&#20837; http://localhost:9090/admin &#20197;&#36830;&#25509;&#21040;&#31649;&#29702;&#25511;&#21046;&#21488;&#12290;</li>

<li>&#21333;&#20987;<strong>&#26381;&#21153;&#22120; &gt; &#24212;&#29992;&#31243;&#24207;&#26381;&#21153;&#22120; &gt; </strong><strong>server1</strong>&#12290;
</li>

<li>&#22312;&ldquo;&#20854;&#23427;&#23646;&#24615;&rdquo;&#19979;&#65292;&#21333;&#20987; <strong>Web &#26381;&#21153;&#65306;Web &#26381;&#21153;&#23433;&#20840;&#24615;&#30340;&#32570;&#30465;&#32465;&#23450;</strong>&#12290;</li>

<li>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#20540;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;
<div>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#20540;&#34920;&#26126;&#22312;&#38500;&#21435;&#29616;&#26102;&#26631;&#24535;&#20043;&#21069;&#20445;&#30041;&#39640;&#36895;&#32531;&#23384;&#29616;&#26102;&#26631;&#24535;&#22810;&#38271;&#26102;&#38388;&#12290;&#24744;&#24517;&#39035;&#25351;&#23450;&#33267;&#23569; 300 &#31186;&#12290;&#28982;&#32780;&#65292;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 600 &#31186;&#12290;&#27492;&#23383;&#27573;&#22312;&#26381;&#21153;&#22120;&#32423;&#21035;&#19978;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#22312;&#21333;&#20803;&#32423;&#21035;&#19978;&#26159;&#24517;&#38656;&#30340;&#12290;</div>
</li>

<li>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#25351;&#23450;&#20540;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;
<div>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#20540;&#34920;&#26126;&#29616;&#26102;&#26631;&#24535;&#26377;&#25928;&#22810;&#38271;&#26102;&#38388;&#12290;&#24744;&#24517;&#39035;&#33267;&#23569;&#25351;&#23450; 300 &#31186;&#65292;&#20294;&#20540;&#19981;&#33021;&#36229;&#36807;&#21069;&#19968;&#27493;&#39588;&#20013;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#31186;&#25968;&#12290;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 600 &#31186;&#12290;&#22312; WebSphere Application Server
Network Deployment &#29615;&#22659;&#12289;WebSphere Application Server for z/OS &#29615;&#22659;&#20013;&#65292;&#22914;&#26524;&#22312;&#26381;&#21153;&#22120;&#32423;&#21035;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#20540;&#65292;&#21017;&#35813;&#20540;&#19981;&#33021;&#36229;&#36807;&#22312;&#21333;&#20803;&#32423;&#21035;&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#20540;&#12290;&#27492;&#23383;&#27573;&#22312;&#26381;&#21153;&#22120;&#32423;&#21035;&#19978;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#22312;&#21333;&#20803;&#32423;&#21035;&#19978;&#26159;&#24517;&#38656;&#30340;</div>
</li>

<li>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>&#23383;&#27573;&#25351;&#23450;&#20540;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;
<div>&#20026;<strong>&#29616;&#26102;&#26631;&#24535;&#26102;&#38047;&#20559;&#31227;</strong>&#23383;&#27573;&#25351;&#23450;&#30340;&#20540;&#25351;&#23450;&#24403;&#28040;&#24687;&#25509;&#25910;&#26041;&#26816;&#26597;&#20540;&#30340;&#26032;&#40092;&#24230;&#26102;&#35201;&#32771;&#34385;&#30340;&#26102;&#38388;&#37327;&#65288;&#20197;&#31186;&#35745;&#65289;&#12290;&#24403;&#24744;&#35774;&#32622;&#36825;&#20010;&#20540;&#30340;&#26102;&#20505;&#65292;&#32771;&#34385;&#20197;&#19979;&#20449;&#24687;&#65306;<ul>

<li>&#22914;&#26524;&#26102;&#38047;&#26159;&#19981;&#21516;&#27493;&#30340;&#65292;&#28040;&#24687;&#21457;&#36865;&#26041;&#21644;&#28040;&#24687;&#25509;&#25910;&#26041;&#20043;&#38388;&#30340;&#26102;&#38388;&#24046;&#24322;&#12290;</li>

<li>&#21152;&#23494;&#21644;&#21457;&#36865;&#28040;&#24687;&#25152;&#38656;&#30340;&#26102;&#38388;&#12290;</li>

<li>&#32593;&#32476;&#38459;&#22622;&#25152;&#38656;&#30340;&#26102;&#38388;&#12290;</li>

</ul>&#24744;&#24517;&#39035;&#22312;&#27492;&#23383;&#27573;&#20013;&#26368;&#23569;&#25351;&#23450; 0 &#31186;&#12290;&#28982;&#32780;&#65292;&#26368;&#22823;&#20540;&#19981;&#33021;&#36229;&#36807;&#22312;<strong>&#29616;&#26102;&#26631;&#24535;&#26368;&#22823;&#23551;&#21629;</strong>&#23383;&#27573;&#20013;&#34920;&#26126;&#30340;&#31186;&#25968;&#12290;&#22914;&#26524;&#24744;&#26410;&#25351;&#23450;&#20540;&#65292;&#21017;&#32570;&#30465;&#26159; 0 &#31186;&#12290;&#27492;&#23383;&#27573;&#22312;&#26381;&#21153;&#22120;&#32423;&#21035;&#19978;&#26159;&#21487;&#36873;&#30340;&#65292;&#20294;&#22312;&#21333;&#20803;&#32423;&#21035;&#19978;&#26159;&#24517;&#38656;&#30340;&#12290;</div>

</li>

<li>&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#12290;<div>&#22914;&#26524;&#24744;&#26356;&#25913;<strong>&#29616;&#26102;&#26631;&#24535;&#39640;&#36895;&#32531;&#23384;&#36229;&#26102;</strong>&#20540;&#19988;&#27809;&#26377;&#37325;&#26032;&#21551;&#21160;&#26381;&#21153;&#22120;&#65292;&#27492;&#26356;&#25913;&#26080;&#27861;&#34987;&#26381;&#21153;&#22120;&#35782;&#21035;&#12290;</div>
</li>

</ol>
</div>

</body>
</html>
