<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Colecci&oacute;n de f&aacute;bricas de conexiones de J2C</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="J2C_connection_factories"></a>
<h2>Colecci&oacute;n de f&aacute;bricas de conexiones de J2C</h2>

<p>Utilice esta p&aacute;gina para seleccionar una f&aacute;brica de conexiones, que representa un
conjunto de valores de configuraci&oacute;n de conexiones. </p>

<p>Los componentes de aplicaci&oacute;n, como por ejemplo, los enterprise beans tienen descriptores de referencia de recursos que se refieren a la f&aacute;brica de conexiones y no al adaptador de recursos.
La f&aacute;brica de conexiones es, de hecho, un contenedor de la lista de propiedades de configuraci&oacute;n. Adem&aacute;s del conjunto arbitrario de propiedades de configuraci&oacute;n definidas por el proveedor del adaptador de recursos, existen varias propiedades de configuraci&oacute;n est&aacute;ndar que hacen referencia a la f&aacute;brica de conexiones.  Esas propiedades est&aacute;ndares las emplea el
gestor de agrupaci&oacute;n de conexiones de J2C en el tiempo de ejecuci&oacute;n del servidor de
aplicaciones y no son conocidas por el c&oacute;digo del adaptador de recursos suministrado por el
proveedor. </p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Recursos</strong> &gt;
<strong>Adaptadores de recursos</strong> &gt; <em>adaptador_recursos</em> &gt; <strong>F&aacute;bricas de conexiones
de J2C</strong>.</p>

<dl>
<dt>
<strong><a name="J2CConnectionFactory_displayName"></a>Nombre</strong>
</dt>
<dd>Especifica una lista de los nombres de visualizaci&oacute;n de las f&aacute;bricas de
conexiones.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="J2CConnectionFactory_jndiName_displayName"></a>Nombre JNDI</strong>
</dt>
<dd>Especifica el nombre de la interfaz JNDI (Java Naming and Directory Interface) de esta f&aacute;brica de conexiones.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="J2CConnectionFactory_description_displayName"></a>Descripci&oacute;n</strong>
</dt>
<dd>Especifica una descripci&oacute;n de texto de esta f&aacute;brica de conexiones.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
<dt>
<strong><a name="J2CConnectionFactory_category_displayName"></a>Categor&iacute;a</strong>
</dt>
<dd>Especifica una serie que puede utilizarse para clasificar o agrupar esta f&aacute;brica de conexiones.
<table cellpadding="1">

<tr>

<td align="left" valign="top" class="base" style="background-color:#dedede">Tipo de datos</td>
<td align="left" valign="top" class="base">String</td>

</tr>

</table>

</dd>
</dl>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

<a href="udat_j2cconnfacdet.html">Valores de f&aacute;bricas de conexiones de J2C</a>
<br>

</div>
</body>
</html>
