<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de sesi&oacute;n de correo</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="ujtc_rjmsi"></a>
<h2>Valores de sesi&oacute;n de correo</h2>

<p>Utilice esta p&aacute;gina para configurar proveedores de correo espec&iacute;ficos.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, pulse <strong>Recursos</strong> &gt; <strong>Proveedores de correo</strong> &gt; <em>proveedor_correo</em> &gt; <strong>Sesiones de correo</strong> &gt; <em>sesi&oacute;n_correo</em>.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="MailSession_name_description"></a>Nombre</strong>
</dt>
<dd>Especifica el nombre administrativo del objeto de sesi&oacute;n de JavaMail.</dd>
<dt>
<strong><a name="MailSession_jndiName_description"></a>Nombre JNDI</strong>
</dt>
<dd>Especifica el nombre de la interfaz JNDI (Java Naming and Directory Interface)
correspondiente al recurso, incluido cualquier subcontexto de denominaci&oacute;n.
<p>Este nombre proporciona el enlace entre la informaci&oacute;n de enlace de la plataforma para los recursos definidos en el
descriptor de despliegue de la aplicaci&oacute;n cliente y los recursos reales unidos a JNDI por la plataforma.</p>

</dd>
<dt>
<strong><a name="MailSession_description_description"></a>Descripci&oacute;n</strong>
</dt>
<dd> Especifica una descripci&oacute;n opcional de los registros administrativos.</dd>
<dt>
<strong><a name="MailSession_category_description"></a>Categor&iacute;a</strong>
</dt>
<dd>Especifica una colecci&oacute;n opcional para clasificar o agrupar sesiones. </dd>
<dt>
<strong><a name="MailSession_mailTransportHost_description"></a>Sistema principal de transporte de correo</strong>
</dt>
<dd>Especifica el servidor al que se accede al enviar correo.</dd>
<dt>
<strong><a name="MailSession_mailTransportProtocol_description"></a>Protocolo de transporte de correo</strong>
</dt>
<dd>Indica el protocolo de transporte utilizado al enviar correo. </dd>
<dt>
<strong><a name="MailSession_mailTransportUser_description"></a>Usuario de transporte de correo</strong>
</dt>
<dd> Especifica el ID de usuario cuando el sistema principal de transporte de correo requiere autenticaci&oacute;n.
<p>Este valor no se suele utilizar con la mayor&iacute;a de los servidores de correo. No rellene este campo a no ser que el servidor de correo utilizado necesite un ID de usuario y una contrase&ntilde;a.</p>

</dd>
<dt>
<strong><a name="MailSession_mailTransportPassword_description"></a>Contrase&ntilde;a de transporte de correo</strong>
</dt>
<dd> Especifica la contrase&ntilde;a cuando el sistema principal de transporte de correo requiere autenticaci&oacute;n.
<p>Este valor no se suele utilizar con la mayor&iacute;a de los servidores de correo. No rellene este campo a no ser que el servidor de correo utilizado necesite un ID de usuario y una contrase&ntilde;a. </p>

</dd>
<dt>
<strong><a name="MailSession_mailFrom_description"></a>Correo de</strong>
</dt>
<dd>Especifique el emisor de correo.
<p>Este valor representa la direcci&oacute;n de correo electr&oacute;nico de Internet que, por omisi&oacute;n, se muestra en el mensaje recibido, como la direcci&oacute;n <samp>De</samp> o <samp>Responder a</samp>.
La respuesta del destinatario llega a esta direcci&oacute;n.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStoreHost_description"></a>Sistema principal de almacenamiento de correo</strong>
</dt>
<dd>Especifica el servidor al que se accede al recibir correo.
<p>Este valor, combinado con el ID de usuario y la contrase&ntilde;a del almacenamiento de correo, representa una cuenta de correo v&aacute;lida. Por ejemplo, si la cuenta de correo es <em>john_william@my.company.com</em>, el sistema principal de almacenamiento de correo es <em>my.company.com</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStoreProtocol_description"></a>Protocolo de almacenamiento de correo</strong>
</dt>
<dd>Especifica el protocolo que se utiliza al recibir correo y puede ser IMAP, POP3 o cualquier protocolo de almacenamiento para el que el usuario ha instalado un proveedor.</dd>
<dt>
<strong><a name="MailSession_mailStoreUser_description"></a>Usuario de almacenamiento de correo</strong>
</dt>
<dd>Especifica el ID de usuario para la cuenta de correo espec&iacute;fica.
<p>Por ejemplo, si la cuenta de correo es <em>john_william@my.company.com</em>, el usuario es
<em>john.william.com</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_mailStorePassword_description"></a>Contrase&ntilde;a de almacenamiento de correo</strong>
</dt>
<dd>Especifica la contrase&ntilde;a para la cuenta de correo espec&iacute;fica.
<p>Por ejemplo, si la cuenta de correo es <em>john_william@my.company.com</em>, deber&aacute; especificar la contrase&ntilde;a del usuario <em>john.william.com</em>.</p>

</dd>
<dt>
<strong><a name="MailSession_debug_description"></a>Depuraci&oacute;n</strong>
</dt>
<dd>Activa o desactiva la modalidad de depuraci&oacute;n para esta sesi&oacute;n de correo.</dd>
</dl>
</div>
</body>
</html>
