# IBM Confidential OCO Source Material
# 5630-A36 (C) COPYRIGHT International Business Machines Corp. 1997, 2003
# The source code for this program is not published or otherwise divested
# of its trade secrets, irrespective of what has been deposited with the
# U.S. Copyright Office.
#
#CMVCPATHNAME ws/code/webui.core/src/com/ibm/ws/console/core/resources/ConsoleAppResources.nlsprops
#ISMESSAGEFILE FALSE
#
# Note:
#
# Whenever an apostrophe is needed within this file, please do not double it. It has 
# been determined that the code that uses this file expects only a single 
# apostrophe, and should work properly when a single apostrophe is provided.
#

button.next=\u6b21\u3078
button.back=\u623b\u308b
button.finish=\u7d42\u4e86
button.help=\u30d8\u30eb\u30d7
button.install=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb
button.cancel=\u30ad\u30e3\u30f3\u30bb\u30eb
button.delete=\u524a\u9664
button.search=\u691c\u7d22

button.ok=OK
button.reset=\u30ea\u30bb\u30c3\u30c8
button.remove=\u9664\u53bb
button.save=\u4fdd\u7ba1
button.apply=\u9069\u7528
button.submit=\u5b9f\u884c\u4f9d\u983c
button.generate=\u751f\u6210

button.start=\u59cb\u52d5
button.stop=\u505c\u6b62
button.restart=\u518d\u59cb\u52d5
button.ping=Ping
button.connect=\u63a5\u7d9a
button.disconnect=\u5207\u65ad
button.new=\u65b0\u898f\u4f5c\u6210
button.move=\u79fb\u52d5
button.copy=\u30b3\u30d4\u30fc
button.go=Go
button.browse=\u53c2\u7167

button.continue=\u7d99\u7d9a
button.hidedetails=\u8a73\u7d30\u3092\u96a0\u3059
button.showdetails=\u8a73\u7d30\u3092\u8868\u793a
button.previous=\u623b\u308b
button.logout=\u30ed\u30b0\u30a2\u30a6\u30c8
button.add=\u8ffd\u52a0

button.rippledstart=ripple \u59cb\u52d5
button.quiesce=\u9759\u6b62

label.scope=\u6709\u52b9\u7bc4\u56f2
label.cell=\u30bb\u30eb
label.node=Node
label.server=\u30b5\u30fc\u30d0\u30fc
label.user=\u30e6\u30fc\u30b6\u30fc
label.group=\u30b0\u30eb\u30fc\u30d7
label.role=\u5f79\u5272
label.status=\u30ed\u30b0\u30a4\u30f3\u72b6\u6cc1
label.user.desc=\u7ba1\u7406\u8005\u6a29\u9650\u3092\u4ed8\u4e0e\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
label.group.desc=\u7ba1\u7406\u8005\u6a29\u9650\u3092\u4ed8\u4e0e\u3059\u308b\u30b0\u30eb\u30fc\u30d7\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
label.role.desc=\u4ed8\u4e0e\u3059\u308b\u7ba1\u7406\u8005\u6a29\u9650\u306e\u30ec\u30d9\u30eb\u3092\u6307\u5b9a\u3057\u307e\u3059\u3002
label.path=\u30d1\u30b9
label.local.path=\u30ed\u30fc\u30ab\u30eb\u30fb\u30d1\u30b9:
label.server.path=\u30b5\u30fc\u30d0\u30fc\u30fb\u30d1\u30b9:

#Note: Please translate the text contained within the alt="" on the next seven lines
errors.required=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>{0} \u306f\u5fc5\u8981\u3067\u3059</span><br>
errors.invalid=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>{0} \u306f\u7121\u52b9\u306a\u30a8\u30f3\u30c8\u30ea\u30fc\u3067\u3059</span><br>
errors.header=<table class="noframe-framing-table" border="0" cellpadding="3" cellspacing="0" width="100%"><tr><td class="validation-header">\u30e1\u30c3\u30bb\u30fc\u30b8</td></tr><tr><td class="table-text">
errors.footer=</td></tr></table><br>
errors.long=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>{0} \u306f\u9577\u6574\u6570\u5024\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093</span><br>
errors.integer=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>{0} \u306f\u6574\u6570\u5024\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093</span><br>
errors.range=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>{0} \u306f {1} \u304b\u3089 {2} \u306e\u7bc4\u56f2\u5185\u306b\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093</span><br>
#End Note

preferences.field.type.incorrect=\u8a2d\u5b9a\u30d5\u30a3\u30fc\u30eb\u30c9\u306b\u8aa4\u3063\u305f\u30bf\u30a4\u30d7\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059

quick.search.label=\u30d5\u30a3\u30eb\u30bf\u30fc
quick.search.search.in.label=\u6b21\u306e\u30c6\u30fc\u30d6\u30eb\u3092\u30d5\u30a3\u30eb\u30bf\u30fc\u306b\u639b\u3051\u308b\u306b\u306f\u3001\u30d5\u30a3\u30eb\u30bf\u30fc\u3059\u308b\u5217\u3092\u9078\u629e\u3057\u3066\u304b\u3089\u3001\u30d5\u30a3\u30eb\u30bf\u30fc\u57fa\u6e96\u3092\u5165\u529b\u3057\u3066\u304f\u3060\u3055\u3044 (\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9: *\u3001?\u3001%)
quick.search.with.string.label=\u30b9\u30c8\u30ea\u30f3\u30b0
quick.search.go.label=Go
paging.filtered.total.label=\u30d5\u30a3\u30eb\u30bf\u30fc\u5408\u8a08
paging.previous.label=\u623b\u308b
paging.next.label=\u6b21\u3078
paging.page.label=\u30da\u30fc\u30b8
paging.of.label=\u5408\u8a08\u30da\u30fc\u30b8
paging.total.label=\u5408\u8a08

Domain.displayName=\u30c9\u30e1\u30a4\u30f3
Domain.nodes.displayName=\u30ce\u30fc\u30c9
Domain.nodes.description=\u30ce\u30fc\u30c9\u306e\u8aac\u660e
Node.smallIcon=Node.gif

Domain.cell.displayName=\u30bb\u30eb
Domain.cells.displayName=\u30bb\u30eb
Domain.cells.description=\u30bb\u30eb\u306e\u8aac\u660e
Cell.smallIcon=Cell.gif

pageheader.label.view=\u8868\u793a
pageheader.label.more.information=\u8a73\u7d30\u60c5\u5831
pageheader.label.about=\u88fd\u54c1\u60c5\u5831

errorpage.title=\u30a8\u30e9\u30fc
errorpage.request=\u8981\u6c42\u306e\u51e6\u7406\u4e2d\u306b\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f:
errorpage.message=\u30e1\u30c3\u30bb\u30fc\u30b8:
errorpage.stacktrace=StackTrace:

menu.workspace.home=\u30db\u30fc\u30e0
menu.preferences=\u8a2d\u5b9a
menu.todo.list=To Do \u30ea\u30b9\u30c8
menu.save.changes=\u4fdd\u7ba1
menu.logout=\u30ed\u30b0\u30a2\u30a6\u30c8
menu.help=\u30d8\u30eb\u30d7

desc.main.title=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u30fb\u30db\u30fc\u30e0
desc.main.text=\u4ee5\u4e0b\u306f\u3001\u5bb9\u6613\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30db\u30fc\u30e0\u306b\u8ffd\u52a0\u3055\u308c\u305f\u30b3\u30f3\u30bd\u30fc\u30eb\u306e\u30da\u30fc\u30b8\u306e\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u3068\u30d3\u30e5\u30fc\u3067\u3059\u3002  \u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30da\u30fc\u30b8\u3092\u30ca\u30d3\u30b2\u30fc\u30c8\u3057\u3066\u3044\u308b\u3068\u304d\u306b\u3001\u3055\u3089\u306b\u30b7\u30e7\u30fc\u30c8\u30ab\u30c3\u30c8\u3068\u30d3\u30e5\u30fc\u3092\u8ffd\u52a0\u3059\u308b\u5834\u5408\u306f\u3001\u30da\u30fc\u30b8\u4e0a\u306e\u300c\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30db\u30fc\u30e0\u306b\u8ffd\u52a0\u300d\u30ea\u30f3\u30af\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u3053\u306e\u9805\u76ee\u3092\u9664\u53bb\u3059\u308b\u306b\u306f\u3001\u9664\u53bb\u3057\u305f\u3044\u9805\u76ee\u306e\u30dc\u30c3\u30af\u30b9\u306e\u53f3\u4e0a\u306b\u3042\u308b 'X' \u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002

desc.sync.title=\u4fdd\u7ba1
desc.sync.text=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5909\u66f4\u3092\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u4fdd\u7ba1\u3057\u307e\u3059

sync.title=\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u4fdd\u7ba1
sync.desc=\u300c\u4fdd\u7ba1\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u884c\u3063\u305f\u5909\u66f4\u3067\u3001\u30de\u30b9\u30bf\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002  \u5909\u66f4\u3092\u7834\u68c4\u3057\u3001\u30de\u30b9\u30bf\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u69cb\u6210\u3092\u4f7f\u7528\u3057\u3066\u518d\u3073\u4f5c\u696d\u3092\u958b\u59cb\u3059\u308b\u5834\u5408\u306f\u3001\u300c\u5ec3\u68c4\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002  \u884c\u3063\u305f\u5909\u66f4\u3067\u4f5c\u696d\u3092\u7d99\u7d9a\u3059\u308b\u5834\u5408\u306f\u3001\u300c\u30ad\u30e3\u30f3\u30bb\u30eb\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sync.desc.logoff=\u300c\u4fdd\u7ba1\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u3001\u884c\u3063\u305f\u5909\u66f4\u3067\u3001\u30de\u30b9\u30bf\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002  \u30ed\u30b0\u30a2\u30a6\u30c8\u3057\u3001\u884c\u3063\u305f\u5909\u66f4\u3092\u7834\u68c4\u3059\u308b\u5834\u5408\u306f\u3001\u300c\u5ec3\u68c4\u300d\u30dc\u30bf\u30f3\u3092\u30af\u30ea\u30c3\u30af\u3057\u307e\u3059\u3002 \u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5909\u66f4\u3092\u4fdd\u5b58\u3057\u306a\u304c\u3089\u30ed\u30b0\u30a2\u30a6\u30c8\u3092\u7d99\u7d9a\u3059\u308b\u306b\u306f\u3001\u300c\u30ed\u30b0\u30a2\u30a6\u30c8\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sync.list=\u5909\u66f4\u9805\u76ee\u306e\u8868\u793a
sync.changed=\u5909\u66f4\u9805\u76ee
sync.button.save=\u4fdd\u7ba1
sync.button.discard=\u7834\u68c4
sync.button.cancel=\u30ad\u30e3\u30f3\u30bb\u30eb
sync.label.syncwithnodes=\u30ce\u30fc\u30c9\u3068\u5909\u66f4\u3092\u540c\u671f\u5316

desc.sync.conflict.title=\u4fdd\u7ba1\u306e\u77db\u76fe
desc.sync.conflict.text=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5909\u66f4\u3092\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u4fdd\u7ba1\u3057\u3088\u3046\u3068\u3057\u305f\u3068\u304d\u306b\u3001\u7af6\u5408\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002

sync.conflict.title=\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u4fdd\u7ba1
sync.conflict.desc=\u69cb\u6210\u60c5\u5831\u306e\u5909\u66f4\u306e\u958b\u59cb\u3057\u305f\u5f8c\u3067\u3001\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u306b\u3088\u308a\u4e00\u90e8\u306e\u69cb\u6210\u60c5\u5831\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002 \u6b21\u306e\u5404\u9805\u76ee\u306b\u5bfe\u3057\u3066\u3001\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306e\u5909\u66f4\u3092\u4e0a\u66f8\u304d\u3057\u305f\u3044\u304b\u3001\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306e\u5909\u66f4\u3092\u5ec3\u68c4\u3057\u305f\u3044\u304b\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
sync.conflict.items=\u4fdd\u7ba1\u3067\u77db\u76fe\u3059\u308b\u9805\u76ee
sync.conflict.action=\u30a2\u30af\u30b7\u30e7\u30f3
sync.conflict.overwrite=\u4e0a\u66f8\u304d
sync.conflict.discard=\u4e0a\u66f8\u304d\u3057\u306a\u3044
sync.conflict.merge=\u30de\u30fc\u30b8

login.title=IBM WebSphere Application Server \u306e\u7ba1\u7406\u30ed\u30b0\u30a4\u30f3
login.header=\u30ed\u30b0\u30a4\u30f3
login.footer=\u30e6\u30fc\u30b6\u30fc ID \u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5fc5\u8981\u3068\u3057\u307e\u305b\u3093\u3002\u307e\u305f\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u306b\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u30e6\u30fc\u30b6\u30fc ID \u3067\u3042\u308b\u5fc5\u8981\u3082\u3042\u308a\u307e\u305b\u3093\u3002  \u3053\u308c\u306f\u3001\u69cb\u6210\u30c7\u30fc\u30bf\u306b\u5bfe\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u7279\u6709\u306e\u5909\u66f4\u3092\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0\u3059\u308b\u76ee\u7684\u3067\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002

error.login.failure=\u30ed\u30b0\u30a4\u30f3\u3092\u51e6\u7406\u3067\u304d\u307e\u305b\u3093\u3002 \u30e6\u30fc\u30b6\u30fc ID \u3068\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30c1\u30a7\u30c3\u30af\u3057\u3066\u3001\u3084\u308a\u76f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002

was.title=WebSphere Application Server
WebSphere.Application.Server=WebSphere Application Server
IBM.logo=IBM \u30ed\u30b4
WebSphere.background.image=WebSphere \u80cc\u666f\u30a4\u30e1\u30fc\u30b8
prompt.username=\u30e6\u30fc\u30b6\u30fc ID:
prompt.password=\u30d1\u30b9\u30ef\u30fc\u30c9:
logon.desc=\u30e6\u30fc\u30b6\u30fc ID \u306f\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5fc5\u8981\u3068\u3057\u307e\u305b\u3093\u3002\u307e\u305f\u3001\u30ed\u30fc\u30ab\u30eb\u30fb\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u306b\u3042\u308b\u30e6\u30fc\u30b6\u30fc\u306e\u30e6\u30fc\u30b6\u30fc ID \u3067\u3042\u308b\u5fc5\u8981\u3082\u3042\u308a\u307e\u305b\u3093\u3002 \u3053\u308c\u306f\u3001\u69cb\u6210\u30c7\u30fc\u30bf\u306b\u5bfe\u3059\u308b\u30e6\u30fc\u30b6\u30fc\u7279\u6709\u306e\u5909\u66f4\u3092\u30c8\u30e9\u30c3\u30ad\u30f3\u30b0\u3059\u308b\u76ee\u7684\u3067\u306e\u307f\u4f7f\u7528\u3055\u308c\u307e\u3059\u3002 \u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u306f\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u305b\u3093

logonForm.validation.usernameMaskMessage=\u30e6\u30fc\u30b6\u30fc ID \u306b\u306f\u6587\u5b57\u3068\u6570\u5b57\u3057\u304b\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002
logonForm.validation.passwordMaskMessage=\u30d1\u30b9\u30ef\u30fc\u30c9\u306b\u306f\u3001\u6587\u5b57\u3068\u6570\u5b57\u306e\u7d44\u307f\u5408\u308f\u305b\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002
logonForm.validation.username=\u30e6\u30fc\u30b6\u30fc ID \u304c\u5fc5\u8981\u3067\u3059
logonForm.validatoin.password=\u30d1\u30b9\u30ef\u30fc\u30c9\u304c\u5fc5\u8981\u3067\u3059

information.refresh.tree=<a href="loading.jsp" target="navigation_tree">\u30ca\u30d3\u30b2\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30ea\u30fc\u3092\u6700\u65b0\u8868\u793a</a>\u3057\u3066\u3001\u5185\u5bb9\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
information.refresh.header=<a href="was_header.jsp" target="header">\u30d8\u30c3\u30c0\u30fc\u3092\u6700\u65b0\u8868\u793a</a>\u3057\u3066\u3001\u5185\u5bb9\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002
information.refresh.all=<a href="index.jsp" target="parent">\u30d8\u30c3\u30c0\u30fc\u3092\u6700\u65b0\u8868\u793a</a>\u3057\u3066\u3001\u5185\u5bb9\u3092\u66f4\u65b0\u3057\u307e\u3059\u3002

consolehome.welcome.title=WebSphere Application Server \u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u3078\u3088\u3046\u3053\u305d
consolehome.welcome.description=\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u306f\u3001WebSphere Application Server Advanced Single Server Edition \u306e\u69cb\u6210\u304a\u3088\u3073\u8a2d\u5b9a\u3078\u306e Web \u30d9\u30fc\u30b9\u306e\u30a2\u30af\u30bb\u30b9\u3068\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30c7\u30d7\u30ed\u30a4\u3059\u308b\u6a5f\u80fd\u3092\u63d0\u4f9b\u3057\u307e\u3059\u3002 \u5de6\u306e\u30e1\u30cb\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3001XML \u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3067\u6307\u5b9a\u3055\u308c\u3066\u3044\u308b\u9805\u76ee\u3092\u691c\u7d22\u3057\u307e\u3059\u3002 \u307e\u305f\u306f\u4e0b\u306e\u30ea\u30f3\u30af\u3092\u691c\u7d22\u3057\u3066\u3001\u6709\u52b9\u306a\u60c5\u5831\u3092\u898b\u3064\u3051\u51fa\u3057\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30b5\u30fc\u30d0\u30fc\u3092\u6709\u52b9\u306b\u3057\u307e\u3059\u3002
consolehome.help.description=\u300c\u30d8\u30eb\u30d7\u300d\u3092\u9078\u629e\u3059\u308b\u3068\u3001IBM WebSphere InfoCenter Web \u30da\u30fc\u30b8\u306b\u79fb\u52d5\u3057\u307e\u3059\u3002\u3053\u306e\u30da\u30fc\u30b8\u3067\u306f\u3001IBM WebSphere Application Server Advanced Single Server Edition \u304a\u3088\u3073 IBM HTTP Server \u3084\u4ed6\u306e\u7248\u306e Application Server \u306e\u4f7f\u7528\u306b\u95a2\u3059\u308b\u60c5\u5831\u3092\u691c\u7d22\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002  \u307e\u305f\u3001InfoCenter \u3067\u306f\u30b5\u30f3\u30d7\u30eb\u305d\u306e\u4ed6\u60c5\u5831\u3092\u63d0\u4f9b\u3057\u3066\u304a\u308a\u3001\u3053\u308c\u3089\u306f\u983b\u7e41\u306b\u66f4\u65b0\u3055\u308c\u307e\u3059\u3002
consolehome.preferences=\u8a2d\u5b9a

consolehome.configuration.title=\u69cb\u6210
consolehome.openconfigfile.description=\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092<a href="selectConfigFile.do?action=Open">\u958b\u3044\u3066</a>\u3001\u30b3\u30f3\u30bd\u30fc\u30eb\u3092\u4f7f\u7528\u3057\u3066\u7de8\u96c6\u3057\u307e\u3059\u3002
consolehome.createconfigfile.description=\u30c6\u30f3\u30d7\u30ec\u30fc\u30c8\u3068\u3057\u3066\u65e2\u5b58\u306e\u30d5\u30a1\u30a4\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3001\u65b0\u898f\u306e\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092<a href="selectConfigFile.do?action=New">\u4f5c\u6210</a>\u3057\u307e\u3059\u3002
consolehome.savecurrentconfig.description=\u73fe\u5728\u306e\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u306b\u4f5c\u696d\u3092<a href="initSave.do">\u4fdd\u7ba1</a>\u3057\u307e\u3059\u3002
consolehome.preferences.title=<a href="editPreferences.do">\u8a2d\u5b9a</a>
consolehome.preferences.choose.description=\u5404\u30ea\u30b9\u30c8\u304a\u3088\u3073\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u30fb\u30da\u30fc\u30b8\u3067\u8aac\u660e\u30c6\u30ad\u30b9\u30c8\u3092\u8868\u793a\u3059\u308b\u304b\u3069\u3046\u304b\u3092\u9078\u629e\u3057\u307e\u3059\u3002  \u307e\u305f\u3001WebSphere Application Server \u30d0\u30ca\u30fc\u30fb\u30a4\u30e1\u30fc\u30b8\u3092\u96a0\u3059\u304b\u3069\u3046\u304b\u3082\u9078\u629e\u3057\u307e\u3059\u3002

UserExists.title=\u30e6\u30fc\u30b6\u30fc\u306f\u5b58\u5728\u3057\u307e\u3059\u3002
UserExists.information=\u540c\u3058\u30e6\u30fc\u30b6\u30fc ID \u3092\u4f7f\u3063\u3066\u3001\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u73fe\u5728\u30ed\u30b0\u30a4\u30f3\u3057\u3066\u3044\u307e\u3059\u3002 \u6b21\u306e\u4e2d\u304b\u3089\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
UserExists.force.login=\u540c\u3058\u30e6\u30fc\u30b6\u30fc ID \u3092\u6301\u3064\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u3092\u30ed\u30b0\u30a2\u30a6\u30c8\u3059\u308b\u3002 \u305d\u306e\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u4e2d\u306b\u884c\u308f\u308c\u305f\u5909\u66f4\u306f\u3001\u30ea\u30ab\u30d0\u30ea\u30fc\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
UserExists.continue=\u300c\u30ed\u30b0\u30a4\u30f3\u300d\u30da\u30fc\u30b8\u306b\u623b\u3063\u3066\u3001\u5225\u306e\u30e6\u30fc\u30b6\u30fc ID \u3092\u5165\u529b\u3059\u308b\u3002
UserExists.wait= \u300c\u30ed\u30b0\u30a4\u30f3\u300d\u30da\u30fc\u30b8\u306b\u623b\u3063\u3066\u3001\u540c\u3058\u30e6\u30fc\u30b6\u30fc ID \u3092\u6301\u3064\u307b\u304b\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u30ed\u30b0\u30a2\u30a6\u30c8\u3059\u308b\u306e\u3092\u5f85\u6a5f\u3059\u308b\u3002 

tab.runtime=\u30e9\u30f3\u30bf\u30a4\u30e0
tab.configuration=\u69cb\u6210
tab.topology=\u30ed\u30fc\u30ab\u30eb\u30fb\u30c8\u30dd\u30ed\u30b8\u30fc

config.general.properties=\u4e00\u822c\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
config.additional.properties=\u8ffd\u52a0\u30d7\u30ed\u30d1\u30c6\u30a3\u30fc
detail.page.title=\u8a73\u7d30\u30da\u30fc\u30b8
detail.more.info1=\u8868\u793a
detail.more.info2=\u8a73\u7d30\u60c5\u5831
detail.more.info3=\u88fd\u54c1\u60c5\u5831

statusTray.preference.enable=\u4f7f\u7528\u53ef\u80fd
statusTray.preference.units=\u79d2\u9593
statusTray.preference.cycle=\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u81ea\u52d5\u30b5\u30a4\u30af\u30eb
statusTray.preference.refresh=\u81ea\u52d5\u6700\u65b0\u8868\u793a
statusTray.preference.interval=\u6700\u65b0\u8868\u793a\u9593\u9694
statusTray.preference.description=\u6307\u5b9a\u3057\u305f\u9593\u9694\u3067\u3001\u30b7\u30b9\u30c6\u30e0\u30fb\u30c8\u30ec\u30a4\u3092\u6700\u65b0\u60c5\u5831\u3067\u81ea\u52d5\u7684\u306b\u6700\u65b0\u8868\u793a\u3057\u307e\u3059\u3002 \u307e\u305f\u3001\u6307\u5b9a\u3057\u305f\u6700\u65b0\u8868\u793a\u9593\u9694\u3067\u3001\u30b7\u30b9\u30c6\u30e0\u30fb\u30c8\u30ec\u30a4\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u306e\u81ea\u52d5\u30b5\u30a4\u30af\u30eb\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002 

refId.label=ID

ChangesFound.information=\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u5909\u66f4\u3092\u767a\u884c\u3059\u308b\u524d\u306b\u3001\u524d\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u306b\u306a\u308a\u307e\u3057\u305f\u3002 \u524d\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u884c\u3063\u305f\u5909\u66f4\u3092\u30ea\u30ab\u30d0\u30ea\u30fc\u3057\u307e\u3059\u304b\u3001\u305d\u308c\u3068\u3082\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u3092\u7de8\u96c6\u3057\u307e\u3059\u304b?
ChangesFound.restore=\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u3067\u306e\u4f5c\u696d
ChangesFound.recover=\u524d\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3067\u884c\u308f\u308c\u305f\u5909\u66f4\u3092\u30ea\u30ab\u30d0\u30ea\u30fc\u3059\u308b
ChangesFound.changed=\u5909\u66f4\u9805\u76ee
ChangesFound.view=\u5909\u66f4\u9805\u76ee\u306e\u8868\u793a

nav.SystemAdmin.displayName=\u30b7\u30b9\u30c6\u30e0\u7ba1\u7406
nav.Environment.displayName=\u74b0\u5883
nav.Naming.displayName=\u30cd\u30fc\u30df\u30f3\u30b0
nav.user.management=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30e6\u30fc\u30b6\u30fc
nav.group.management=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30b0\u30eb\u30fc\u30d7
nav.naming.user.management=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30e6\u30fc\u30b6\u30fc
nav.naming.group.management=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7

collection.preferences.maxRowLabel=\u6700\u5927\u884c\u6570:
collection.preferences.maxRowDesc=\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u304c\u5927\u304d\u3044\u5834\u5408\u306b\u8868\u793a\u3059\u308b\u6700\u5927\u884c\u6570\u3002 \u8868\u793a\u3055\u308c\u306a\u3044\u5206\u306f\u3001\u6b21\u306e\u30da\u30fc\u30b8\u306b\u8868\u793a\u3055\u308c\u307e\u3059\u3002
collection.preferences.searchHistoryLabel=\u30d5\u30a3\u30eb\u30bf\u30fc\u30fb\u30d2\u30b9\u30c8\u30ea\u30fc:
collection.preferences.searchHistoryUnits=\u30d5\u30a3\u30eb\u30bf\u30fc\u57fa\u6e96\u3092\u4fdd\u5b58\u3057\u307e\u3059\u3002
collection.preferences.searchHistoryDesc=\u3053\u308c\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u308b\u3068\u3001\u9ad8\u901f\u691c\u7d22\u6a5f\u80fd\u306b\u6700\u5f8c\u306b\u5165\u529b\u3055\u308c\u305f\u691c\u7d22\u57fa\u6e96\u304c\u4fdd\u5b58\u3055\u308c\u307e\u3059\u3002 \u30e6\u30fc\u30b6\u30fc\u304c\u3053\u306e\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u306b\u623b\u308b\u3068\u3001\u3053\u306e\u30da\u30fc\u30b8\u306f\u4fdd\u5b58\u3055\u308c\u305f\u691c\u7d22\u57fa\u6e96\u3092\u6700\u521d\u306b\u4f7f\u7528\u3057\u3066\u3001\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u3092\u8868\u793a\u3057\u307e\u3059\u3002

button.browse.nodes=\u30ce\u30fc\u30c9\u306e\u53c2\u7167
button.browse.servers=\u30b5\u30fc\u30d0\u30fc\u306e\u53c2\u7167
click.node.name.to.browse=\u30ce\u30fc\u30c9\u540d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u305d\u306e\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u3092\u53c2\u7167\u3057\u307e\u3059

server.select.title=\u30b5\u30fc\u30d0\u30fc\u6709\u52b9\u7bc4\u56f2\u306e\u9078\u629e 
server.select.text=\u73fe\u5728\u306e\u6709\u52b9\u7bc4\u56f2\u306e\u8a2d\u5b9a\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ea\u30b9\u30c8\u304b\u3089\u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

node.select.title=\u30ce\u30fc\u30c9\u6709\u52b9\u7bc4\u56f2\u306e\u9078\u629e
node.select.text=\u73fe\u5728\u306e\u6709\u52b9\u7bc4\u56f2\u306e\u8a2d\u5b9a\u306b\u4f7f\u7528\u3055\u308c\u308b\u30ea\u30b9\u30c8\u304b\u3089\u30ce\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

servers.displayName=\u30b5\u30fc\u30d0\u30fc
nodes.displayName=\u30ce\u30fc\u30c9
error.scope.select=\u30b3\u30f3\u30c6\u30ad\u30b9\u30c8\u7bc4\u56f2\u306e\u9078\u629e\u30a8\u30e9\u30fc
error.scope.select.node=\u30ce\u30fc\u30c9\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044

step.string=\u30b9\u30c6\u30c3\u30d7

desc.users.title=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30e6\u30fc\u30b6\u30fc
desc.users.text=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30e6\u30fc\u30b6\u30fc\u3092\u8ffd\u52a0\u3001\u66f4\u65b0\u3001\u304a\u3088\u3073\u9664\u53bb\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3002
users.displayName=\u30e6\u30fc\u30b6\u30fc
desc.groups.title=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30b0\u30eb\u30fc\u30d7
desc.groups.text=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30b0\u30eb\u30fc\u30d7\u3092\u8ffd\u52a0\u3001\u66f4\u65b0\u3001\u304a\u3088\u3073\u9664\u53bb\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3002
groups.displayName=\u30b0\u30eb\u30fc\u30d7

desc.naming.users.title=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30e6\u30fc\u30b6\u30fc
desc.naming.users.text=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30e6\u30fc\u30b6\u30fc\u3092\u8ffd\u52a0\u3001\u66f4\u65b0\u3001\u304a\u3088\u3073\u9664\u53bb\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3002
users.naming.displayName=\u30e6\u30fc\u30b6\u30fc
desc.naming.groups.title=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7
desc.naming.groups.text=CORBA \u30cd\u30fc\u30df\u30f3\u30b0\u30fb\u30b5\u30fc\u30d3\u30b9\u30fb\u30b0\u30eb\u30fc\u30d7\u3092\u8ffd\u52a0\u3001\u66f4\u65b0\u3001\u304a\u3088\u3073\u9664\u53bb\u3059\u308b\u305f\u3081\u306e\u69cb\u6210\u3002
groups.naming.displayName=\u30b0\u30eb\u30fc\u30d7

role.administrator=\u7ba1\u7406\u8005
role.configurator=\u30b3\u30f3\u30d5\u30a3\u30ae\u30e5\u30ec\u30fc\u30bf\u30fc
role.operator=\u30aa\u30da\u30ec\u30fc\u30bf\u30fc
role.monitor=\u30e2\u30cb\u30bf\u30fc
role.cosnamingread=COS \u30cd\u30fc\u30df\u30f3\u30b0\u8aad\u307f\u53d6\u308a
role.cosnamingwrite=COS \u30cd\u30fc\u30df\u30f3\u30b0\u66f8\u304d\u8fbc\u307f
role.cosnamingcreate=COS \u30cd\u30fc\u30df\u30f3\u30b0\u4f5c\u6210
role.cosnamingdelete=COS \u30cd\u30fc\u30df\u30f3\u30b0\u524a\u9664
status.not.logged.on=\u975e\u30a2\u30af\u30c6\u30a3\u30d6
status.logged.on=\u30a2\u30af\u30c6\u30a3\u30d6

#Note: Please translate the text contained within the alt="" on the next two lines
help.additional.information.image=<img src="/admin/images/more.gif" width="10" height="12" border="0" alt="\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u8a73\u7d30\u3092\u8868\u793a\u3059\u308b" align="texttop">
help.additional.information.image.align=<img src="/admin/images/more.gif" align="left" width="10" height="12" border="0" alt="\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u8a73\u7d30\u3092\u8868\u793a\u3059\u308b">
# End Note

help.notInstalled.title=\u8981\u6c42\u3055\u308c\u305f\u9805\u76ee\u306b\u5bfe\u3057\u3066\u3001\u30d8\u30eb\u30d7\u306f\u73fe\u5728\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093
help.main.welcome=\u30ed\u30fc\u30ab\u30eb\u30fb\u30d8\u30eb\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb\u3078\u3088\u3046\u3053\u305d
help.main.console.title=WebSphere Application Server \u306e\u30d8\u30eb\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb
help.main.title=\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30d8\u30eb\u30d7
help.main.text=WebSphere Application Server \u30d0\u30fc\u30b8\u30e7\u30f3 5 \u88fd\u54c1\u306b\u30d0\u30f3\u30c9\u30eb\u3055\u308c\u3066\u3044\u308b\u30ed\u30fc\u30ab\u30eb\u30fb\u30d8\u30eb\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb\u306b\u3088\u3063\u3066\u3001\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u304a\u3088\u3073\u305d\u306e\u4ed6\u306e\u30c4\u30fc\u30eb\u306e\u5404\u30da\u30fc\u30b8\u306b\u95a2\u3059\u308b\u53c2\u7167\u60c5\u5831\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002
help.main.text.index=\u5de6\u5074\u306e\u30ca\u30d3\u30b2\u30fc\u30b7\u30e7\u30f3\u306b\u3042\u308b <strong>"\u7d22\u5f15"</strong> \u30bf\u30d6\u306b\u3088\u3063\u3066\u3001\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u306e\u30da\u30fc\u30b8\u3068\u6a5f\u80fd\u306e\u3001\u82f1\u5b57\u306b\u3088\u308b\u30ea\u30b9\u30c8\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002  <strong>"\u691c\u7d22"</strong> \u30bf\u30d6\u306b\u3088\u3063\u3066\u3001\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u306e\u30d8\u30eb\u30d7\u30fb\u30d5\u30a1\u30a4\u30eb\u3059\u3079\u3066\u306b\u5bfe\u3059\u308b\u30ad\u30fc\u30ef\u30fc\u30c9\u691c\u7d22\u6a5f\u80fd\u304c\u63d0\u4f9b\u3055\u308c\u307e\u3059\u3002
help.main.more.info=WebSphere Application Server \u30d0\u30fc\u30b8\u30e7\u30f3 5 \u306b\u3064\u3044\u3066\u8a73\u3057\u304f\u306f\u3001\u30aa\u30f3\u30e9\u30a4\u30f3 <A HREF="http://www.ibm.com/software/webservers/appserv/library.html">InfoCenter</A> \u306b\u30a2\u30af\u30bb\u30b9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
help.main.notices=\u7279\u8a18\u4e8b\u9805
help.main.copyright=(c) Copyright IBM Corp. 2000, 2001. All Rights Reserved.
help.navigation.index=\u7d22\u5f15
help.navigation.search=\u691c\u7d22
help.navigation.home=\u30d8\u30eb\u30d7\u30fb\u30db\u30fc\u30e0
help.navigation.search.terms=\u691c\u7d22\u9805\u76ee:
help.navigation.search.wildcards=(\u6709\u52b9\u306a\u30ef\u30a4\u30eb\u30c9\u30ab\u30fc\u30c9: *\u3001%\u3001?)
help.navigation.search.nummatches=\u5404\u6587\u66f8\u3067\u306e\u4e00\u81f4\u6570:
help.navigation.search.toomanymatches=\u4e00\u81f4\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u304c 201 \u4ee5\u4e0a\u3042\u308a\u307e\u3057\u305f\u3002  \u3088\u308a\u9650\u5b9a\u3055\u308c\u308b\u691c\u7d22\u8a9e\u3092\u8a66\u307f\u3066\u304f\u3060\u3055\u3044\u3002
help.navigation.search.results=\u7d50\u679c
help.navigation.search.noresults=\u7d50\u679c\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093
help.navigation.search.totalfiles=\u4e00\u81f4\u3059\u308b\u5408\u8a08\u30d5\u30a1\u30a4\u30eb:

specify.group=\u30b0\u30eb\u30fc\u30d7\u3092\u6307\u5b9a\u3059\u308b:
specify.special.subject=\u4ee5\u4e0b\u306e\u5bfe\u8c61\u304b\u3089\u9078\u629e:
special.everyone=\u5168\u54e1
special.allauthenticated=\u5168\u8a8d\u8a3c\u8005

#Note: Please translate the text contained within the alt="" on the next six lines
error.group.not.found=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u5185\u306b\u3001\u3053\u306e\u540d\u524d\u306e\u30b0\u30eb\u30fc\u30d7\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002</span><br>
error.user.not.found=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u5185\u306b\u3001\u3053\u306e\u540d\u524d\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002</span><br>
error.role.not.selected=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u5f79\u5272\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044</span><br>
error.user.cannot.logout.self=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u73fe\u884c\u30e6\u30fc\u30b6\u30fc\u3092\u30ed\u30b0\u30aa\u30d5\u3059\u308b\u306b\u306f\u3001\u300c\u30ed\u30b0\u30aa\u30d5\u300d\u30e1\u30cb\u30e5\u30fc\u3092\u4f7f\u7528\u3057\u3066\u304f\u3060\u3055\u3044\u3002</span><br>
error.user.already.exists=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u30e6\u30fc\u30b6\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u3053\u306e\u540d\u524d\u306e\u30e6\u30fc\u30b6\u30fc\u306f\u3059\u3067\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u5b58\u5728\u3057\u307e\u3059\u3002</span><br>
error.group.already.exists=<span class='validation-error'><img alt="Error" align="baseline" height="16" width="16" src="/admin/images/Error.gif"/>\u30b0\u30eb\u30fc\u30d7\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u3053\u306e\u540d\u524d\u306e\u30b0\u30eb\u30fc\u30d7\u306f\u3059\u3067\u306b\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u30fb\u30ea\u30dd\u30b8\u30c8\u30ea\u30fc\u306b\u5b58\u5728\u3057\u307e\u3059\u3002</span><br>
# End Note

info.restart.server=\u5909\u66f4\u3092\u6709\u52b9\u306b\u3059\u308b\u306b\u306f\u3001\u30b5\u30fc\u30d0\u30fc\u306e\u518d\u59cb\u52d5\u304c\u5fc5\u8981\u3067\u3059\u3002

statustray.preferences.label=\u8a2d\u5b9a
statustray.title=WebSphere \u72b6\u6cc1
statustray.prev.button=< \u623b\u308b
statustray.next.button=\u6b21\u3078 >
id.must.be.selected=\u3053\u306e\u30a2\u30af\u30b7\u30e7\u30f3\u3092\u884c\u3046\u306b\u306f\u3001\u5c11\u306a\u304f\u3068\u3082 {0} \u3092 1 \u3064\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002

browse.contents=\u76ee\u6b21: 
mbean.notfound=WebSphere {0} MBean \u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002 \u30ce\u30fc\u30c9\u30fb\u30a8\u30fc\u30b8\u30a7\u30f3\u30c8\u304c\u5b9f\u884c\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
browse.remote.title=\u30ea\u30e2\u30fc\u30c8\u30fb\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306e\u53c2\u7167
browse.remote.description=\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u305f\u3044\u30a2\u30fc\u30ab\u30a4\u30d6\u306e\u6a2a\u306e\u30e9\u30b8\u30aa\u30fb\u30dc\u30bf\u30f3\u3092\u9078\u629e\u3059\u308b\u304b\u3001\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u540d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u305d\u306e\u5185\u5bb9\u3092\u8868\u793a\u3057\u307e\u3059\u3002

warning.config.changes.made=\u30ed\u30fc\u30ab\u30eb\u69cb\u6210\u304c\u5909\u66f4\u3055\u308c\u307e\u3057\u305f\u3002 <a href="/admin/syncworkspace.do?syncaction=list" target="detail">\u4fdd\u7ba1</a>\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u3001\u5909\u66f4\u3092\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u306b\u9069\u7528\u3057\u307e\u3059\u3002
confirm.discard.title=\u7834\u68c4\u306e\u78ba\u8a8d
confirm.discard.text=\u6700\u65b0\u306e\u5909\u66f4\u3092\u7834\u68c4\u3059\u308b\u3053\u3068\u3092\u9078\u629e\u3057\u307e\u3057\u305f\u3002  \u300c\u306f\u3044\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u6700\u65b0\u306e\u5909\u66f4\u3092\u7834\u68c4\u3059\u308b\u304b\u3001\u300c\u3044\u3044\u3048\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u76f4\u524d\u306e\u753b\u9762\u306b\u623b\u3063\u3066\u304f\u3060\u3055\u3044\u3002 
desc.sync.discard.title=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u5909\u66f4\u306e\u7834\u68c4
desc.sync.discard.text=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u5909\u66f4\u3092\u3059\u3079\u3066\u7834\u68c4\u3057\u307e\u3059
label.no.confirm.discard=\u4eca\u5f8c\u3001\u3053\u306e\u7834\u68c4\u306e\u78ba\u8a8d\u3092\u8868\u793a\u3057\u306a\u3044
button.yes=\u306f\u3044
button.no=\u3044\u3044\u3048
desc.preferences.title=\u8a2d\u5b9a
desc.preferences.text=\u30e6\u30fc\u30b6\u30fc\u8a2d\u5b9a
label.autorefresh.pref=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u81ea\u52d5\u6700\u65b0\u8868\u793a\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3059\u308b
desc.autorefresh.pref=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u81ea\u52d5\u6700\u65b0\u8868\u793a\u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u307e\u3059
label.nodiscardconfirm.pref=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5ec3\u68c4\u3092\u78ba\u8a8d\u3057\u306a\u3044
desc.nodiscardconfirm.pref=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u5ec3\u68c4\u306e\u78ba\u8a8d\u3092\u3057\u307e\u305b\u3093
warning.conflicts.found=\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u304c\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f\u3002 \u3053\u308c\u3089\u306e\u5909\u66f4\u306b\u3064\u3044\u3066\u3001\u73fe\u5728\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u7af6\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \u3053\u308c\u3089\u306e\u66f4\u65b0\u3092\u8868\u793a\u3059\u308b\u306b\u306f\u3001\u73fe\u5728\u306e\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306e\u5909\u66f4\u3092<a href="/admin/syncworkspace.do?syncaction=list" target="detail">\u4fdd\u7ba1\u307e\u305f\u306f\u7834\u68c4</a>\u3059\u308b\u5fc5\u8981\u304c\u3042\u308a\u307e\u3059
info.workspace.refreshed=\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u306f\u3001\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u304b\u3089\u81ea\u52d5\u6700\u65b0\u8868\u793a\u3055\u308c\u307e\u3057\u305f\u3002 \u30e6\u30fc\u30b6\u30fc\u8a2d\u5b9a\u306e\u5909\u66f4\u3067\u3001\u81ea\u52d5\u6700\u65b0\u8868\u793a\u3092\u4f7f\u7528\u4e0d\u53ef\u306b\u3059\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u3059\u3002
label.usedefaultscope.pref=\u30c7\u30d5\u30a9\u30eb\u30c8\u6709\u52b9\u7bc4\u56f2\u306e\u4f7f\u7528
desc.usedefaultscope.pref=\u30c7\u30d5\u30a9\u30eb\u30c8\u6709\u52b9\u7bc4\u56f2 (\u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb\u30fb\u30ce\u30fc\u30c9) \u3092\u4f7f\u7528\u3057\u307e\u3059
label.bannershow.pref=\u30d0\u30ca\u30fc\u306e\u975e\u8868\u793a/\u8868\u793a
desc.bannershow.pref=\u30d0\u30ca\u30fc\u306e\u8868\u793a
label.descriptionsshow.pref = \u8aac\u660e\u306e\u975e\u8868\u793a/\u8868\u793a
desc.descriptionsshow.pref = \u8aac\u660e\u306e\u8868\u793a


desc.session.invalid.title=\u7121\u52b9\u306a\u30bb\u30c3\u30b7\u30e7\u30f3
desc.session.invalid.text=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u306b\u306a\u308a\u307e\u3057\u305f
msg.invalid.session.text=\u30bb\u30c3\u30b7\u30e7\u30f3\u304c\u7121\u52b9\u306b\u306a\u308a\u307e\u3057\u305f\u3002 \u539f\u56e0\u3068\u3057\u3066\u306f\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30bf\u30a4\u30e0\u30a2\u30a6\u30c8\u304b\u3001\u7ba1\u7406\u8005\u304c\u30ed\u30b0\u30a2\u30a6\u30c8\u3055\u305b\u305f\u304b\u3001\u307e\u305f\u306f\u5225\u306e\u30e6\u30fc\u30b6\u30fc\u304c\u540c\u3058\u30e6\u30fc\u30b6\u30fc ID \u3092\u4f7f\u3063\u3066\u30ed\u30b0\u30aa\u30f3\u3057\u3066\u30e6\u30fc\u30b6\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u3092\u7121\u52b9\u306b\u3057\u305f\u3053\u3068\u304c\u8003\u3048\u3089\u308c\u307e\u3059\u3002
msg.scope.desc=\u30bb\u30eb\u6709\u52b9\u7bc4\u56f2\u3092\u6307\u5b9a\u3059\u308b\u305f\u3081\u306b\u306f\u3001\u300c\u30ce\u30fc\u30c9\u300d\u304a\u3088\u3073\u300c\u30b5\u30fc\u30d0\u30fc\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u30af\u30ea\u30a2\u3057\u3066\u3001\u300c\u9069\u7528\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002<br>\u30ce\u30fc\u30c9\u6709\u52b9\u7bc4\u56f2\u3092\u9078\u629e\u3059\u308b\u306b\u306f\u3001\u30ce\u30fc\u30c9\u3092\u5165\u529b\u307e\u305f\u306f\u691c\u7d22\u3057\u3066\u6307\u5b9a\u3057\u3001\u300c\u30b5\u30fc\u30d0\u30fc\u300d\u30d5\u30a3\u30fc\u30eb\u30c9\u3092\u30af\u30ea\u30a2\u3057\u3066\u300c\u9069\u7528\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002<br>\u30b5\u30fc\u30d0\u30fc\u6709\u52b9\u7bc4\u56f2\u3092\u9078\u629e\u3059\u308b\u306b\u306f\u3001\u307e\u305a\u30ce\u30fc\u30c9\u6709\u52b9\u7bc4\u56f2\u3092\u9078\u629e\u3057\u3001\u6b21\u306b\u30b5\u30fc\u30d0\u30fc\u3092\u5165\u529b\u307e\u305f\u306f\u691c\u7d22\u3057\u3066\u6307\u5b9a\u3057\u3066\u300c\u9069\u7528\u300d\u3092\u30af\u30ea\u30c3\u30af\u3057\u3066\u304f\u3060\u3055\u3044\u3002<br>\u3053\u306e\u30d3\u30e5\u30fc\u3067\u65b0\u898f\u9805\u76ee\u304c\u4f5c\u6210\u3055\u308c\u308b\u5834\u5408\u306f\u3001\u73fe\u884c\u6709\u52b9\u7bc4\u56f2\u5185\u306b\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002
msg.scope.desc.single=\u6709\u52b9\u7bc4\u56f2\u8a2d\u5b9a\u3092\u4f7f\u3063\u3066\u3001\u7279\u5b9a\u306e\u30bb\u30eb\u3001\u30ce\u30fc\u30c9\u3001\u307e\u305f\u306f\u30b5\u30fc\u30d0\u30fc\u306b\u30ea\u30bd\u30fc\u30b9\u306e\u4f7f\u7528\u53ef\u80fd\u6027\u3092\u9650\u5b9a\u3057\u307e\u3059\u3002<br>\u3053\u306e\u30d3\u30e5\u30fc\u3067\u65b0\u898f\u9805\u76ee\u304c\u4f5c\u6210\u3055\u308c\u308b\u5834\u5408\u306f\u3001\u73fe\u884c\u6709\u52b9\u7bc4\u56f2\u5185\u306b\u4f5c\u6210\u3055\u308c\u307e\u3059\u3002
error.RefOject.notFound=\u30a8\u30e9\u30fc\u304c\u767a\u751f\u3057\u307e\u3057\u305f: RefObject \u3092\u691c\u7d22\u3067\u304d\u307e\u305b\u3093
value1.lessthanorequalto.value2={0} \u306f\u3001{1} \u4ee5\u4e0b\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093
value1.lessthan.value2={0} \u306f {1} \u672a\u6e80\u3067\u306a\u3051\u308c\u3070\u306a\u308a\u307e\u305b\u3093

error.file.locked={0} \u306f\u3001\u30de\u30b9\u30bf\u30fc\u69cb\u6210\u3067\u30ed\u30c3\u30af\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u518d\u5ea6\u4fdd\u7ba1\u3092\u8a66\u307f\u3066\u304f\u3060\u3055\u3044\u3002

accessibility.skip.text=\u30a2\u30af\u30bb\u30b9\u652f\u63f4\u30a2\u30f3\u30ab\u30fc\u30fb\u30ea\u30f3\u30af\u3002\u6b21\u306e\u30b3\u30f3\u30c6\u30f3\u30c4\u30fb\u30bb\u30af\u30b7\u30e7\u30f3\u306b\u30b9\u30ad\u30c3\u30d7\u3057\u307e\u3059: 
accessibility.skip.to.title=\u8868\u984c
accessibility.skip.to.main=\u30e1\u30a4\u30f3
accessibility.skip.to.important=\u91cd\u8981\u30e1\u30c3\u30bb\u30fc\u30b8

work.area.frame=\u4f5c\u696d\u57df\u30d5\u30ec\u30fc\u30e0
task.nav.frame=\u30bf\u30b9\u30af\u30fb\u30ca\u30d3\u30b2\u30fc\u30b7\u30e7\u30f3\u30fb\u30d5\u30ec\u30fc\u30e0
header.frame=\u30d8\u30c3\u30c0\u30fc\u30fb\u30d5\u30ec\u30fc\u30e0
status.area.frame=WebSphere \u72b6\u6cc1\u57df\u30d5\u30ec\u30fc\u30e0
click.here=\u3053\u3053\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b

trace.tree.pleaseWaitLabel=\u3057\u3070\u3089\u304f\u304a\u5f85\u3061\u304f\u3060\u3055\u3044...

information.required=\u5fc5\u8981\u306a\u60c5\u5831

websphere.admin.console=WebSphere \u7ba1\u7406\u30b3\u30f3\u30bd\u30fc\u30eb
ibm.logo=IBM \u30ed\u30b4

show.search.and.filter=\u691c\u7d22\u304a\u3088\u3073\u30d5\u30a3\u30eb\u30bf\u30fc\u306e\u8868\u793a

sorted.ascending=\u6607\u9806\u306b\u30bd\u30fc\u30c8 - \u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u6607\u9806\u306b\u30bd\u30fc\u30c8\u3057\u307e\u3059
sorted.descending=\u964d\u9806\u306b\u30bd\u30fc\u30c8 - \u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u964d\u9806\u306b\u30bd\u30fc\u30c8\u3057\u307e\u3059
not.sorted=\u3053\u306e\u5217\u306f\u30bd\u30fc\u30c8\u3055\u308c\u3066\u3044\u307e\u305b\u3093 - \u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u6607\u9806\u306b\u30bd\u30fc\u30c8\u3057\u307e\u3059
refresh.view=\u30d3\u30e5\u30fc\u306e\u6700\u65b0\u8868\u793a

click.for.status=\u3053\u3053\u3092\u30af\u30ea\u30c3\u30af\u3059\u308b\u3068\u3001\u72b6\u6cc1\u30c6\u30ad\u30b9\u30c8\u3092\u8868\u793a\u3057\u307e\u3059
view.more.info=\u3053\u306e\u30d5\u30a3\u30fc\u30eb\u30c9\u306e\u8a73\u7d30\u60c5\u5831\u3092\u8868\u793a\u3057\u307e\u3059

currently.selected.scope=\u73fe\u5728\u9078\u629e\u3055\u308c\u3066\u3044\u308b\u30b9\u30b3\u30fc\u30d7
not.selected=\u9078\u629e\u3055\u308c\u3066\u3044\u307e\u305b\u3093
show.search.scope=\u691c\u7d22\u30b9\u30b3\u30fc\u30d7\u306e\u8868\u793a

show.preferences=\u8a2d\u5b9a\u306e\u8868\u793a

hide.field.page.descriptions=\u30d5\u30a3\u30fc\u30eb\u30c9\u304a\u3088\u3073\u30da\u30fc\u30b8\u306e\u8aac\u660e\u3092\u96a0\u3059
show.field.page.descriptions=\u30d5\u30a3\u30fc\u30eb\u30c9\u304a\u3088\u3073\u30da\u30fc\u30b8\u306e\u8aac\u660e\u3092\u8868\u793a\u3059\u308b

edit.display.websphere.system.info=WebSphere \u30b7\u30b9\u30c6\u30e0\u60c5\u5831\u306e\u8868\u793a\u306e\u7de8\u96c6
runtime.messages=\u30e9\u30f3\u30bf\u30a4\u30e0\u30fb\u30e1\u30c3\u30bb\u30fc\u30b8

hide.filter=\u30d5\u30a3\u30eb\u30bf\u30fc\u6a5f\u80fd\u3092\u96a0\u3059
show.filter=\u30d5\u30a3\u30eb\u30bf\u30fc\u6a5f\u80fd\u3092\u8868\u793a\u3059\u308b

refresh.data=\u30c7\u30fc\u30bf\u306e\u6700\u65b0\u8868\u793a

current.step=\u73fe\u884c\u30b9\u30c6\u30c3\u30d7

all.disabled=\u3059\u3079\u3066\u4f7f\u7528\u4e0d\u53ef
entry.exit=\u958b\u59cb/\u7d42\u4e86
event=\u30a4\u30d9\u30f3\u30c8
debug=\u30c7\u30d0\u30c3\u30b0
entry.exit.event=\u958b\u59cb/\u7d42\u4e86 + \u30a4\u30d9\u30f3\u30c8
entry.exit.debug=\u958b\u59cb/\u7d42\u4e86 + \u30c7\u30d0\u30c3\u30b0
event.debug=\u30a4\u30d9\u30f3\u30c8 + \u30c7\u30d0\u30c3\u30b0
all.enabled=\u3059\u3079\u3066\u4f7f\u7528\u53ef\u80fd

related.items=\u95a2\u9023\u9805\u76ee
total.changed.documents=\u5909\u66f4\u6587\u66f8\u306e\u5408\u8a08:

security.nonFIPS.ssl=FIPS \u627f\u8a8d\u6e08\u307f\u6697\u53f7\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306e\u307f\u3092\u4f7f\u7528\u3059\u308b\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u30fb\u30dd\u30ea\u30b7\u30fc\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u3059\u3002 \u305f\u3060\u3057\u3001\u5c11\u306a\u304f\u3068\u3082 1 \u3064\u306e SSL \u69cb\u6210\u3067\u3001FIPS \u627f\u8a8d\u6e08\u307f JSSE \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u304c\u4f7f\u7528\u3055\u308c\u3066\u3044\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 \u3053\u306e\u3088\u3046\u306a\u5834\u5408\u306b\u306f\u3001FIPS \u627f\u8a8d\u6e08\u307f\u6697\u53f7\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u304c\u4f7f\u7528\u3067\u304d\u306a\u3044\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002
security.nonFIPS.provider=\u300cFIPS \u3092\u4f7f\u7528\u300d\u304c\u4f7f\u7528\u53ef\u80fd\u306b\u306a\u3063\u3066\u3044\u307e\u3059\u304c\u3001SSL \u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u306f IBMJSSEFIPS \u3067\u306f\u3042\u308a\u307e\u305b\u3093\u3002 FIPS \u627f\u8a8d\u6e08\u307f\u6697\u53f7\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u306f\u4f7f\u7528\u3067\u304d\u307e\u305b\u3093\u3002

error.msg.error=\u30a8\u30e9\u30fc
error.msg.warning=\u8b66\u544a
error.msg.information=\u60c5\u5831

none.text=(\u306a\u3057)
collection.checkall.checkbox.alt=\u30b3\u30ec\u30af\u30b7\u30e7\u30f3\u5185\u306e\u30c1\u30a7\u30c3\u30af\u30fb\u30dc\u30c3\u30af\u30b9\u3092\u5168\u9078\u629e/\u5168\u9078\u629e\u89e3\u9664
