<!--DITA to HTML transform for WAS-->
<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>Valores de las anotaciones cronol&oacute;gicas de servicio de IBM</title>
<link rel="stylesheet" href="was_style_help.css">

</head>
<body>
<a name="RASLogs_description"></a>
<h2>Valores de las anotaciones cronol&oacute;gicas de servicio de IBM</h2>

<p>Utilice esta p&aacute;gina para configurar las anotaciones cronol&oacute;gicas de servicio de IBM, tambi&eacute;n conocidas como <em>anotaciones cronol&oacute;gicas de actividad</em>.</p>

<p>Para ver esta p&aacute;gina de la consola administrativa, <strong>Determinaci&oacute;n
de problemas &gt; Anotaciones cronol&oacute;gicas y rastreo</strong> &gt;
<em>servidor</em> &gt; <strong>Anotaciones cronol&oacute;gicas de servicio de
IBM</strong>.</p>

<div>
<p>
<strong>Pesta&ntilde;a Configuraci&oacute;n</strong>
</p>
<dl>
<dt>
<strong><a name="enable_service_log_description"></a>Habilitar anotaciones cronol&oacute;gicas de servicio</strong>
</dt>
<dd>Especifica la creaci&oacute;n de un archivo de anotaciones cronol&oacute;gicas por las anotaciones
cronol&oacute;gicas de servicio de IBM.</dd>
<dt>
<strong><a name="file_name_description"></a>Nombre de archivo</strong>
</dt>
<dd>Especifica el nombre del archivo que utiliza las anotaciones cronol&oacute;gicas de servicio de IBM.</dd>
<dt>
<strong><a name="max_file_size_description"></a>Tama&ntilde;o m&aacute;ximo de archivo</strong>
</dt>
<dd>Especifica el tama&ntilde;o m&aacute;ximo en megabytes del archivo de anotaciones cronol&oacute;gicas de servicio.
El valor por omisi&oacute;n es 2 megabytes.
<p>Cuando se alcanza este tama&ntilde;o, el archivo de
anotaciones cronol&oacute;gicas de servicio se acomoda en su sitio. Tenga en cuenta que las
anotaciones cronol&oacute;gicas de servicio no se recuperan en un nuevo archivo de anotaciones
cronol&oacute;gicas como el de anotaciones cronol&oacute;gicas de JVM.</p>

</dd>
<dt>
<strong><a name="filter_level_description"></a>Filtro de mensajes</strong>
</dt>
<dd>Especifica el nivel de filtro de mensajes con el estado deseado. Puede utilizar esta opci&oacute;n para filtrar o suprimir algunas categor&iacute;as de mensajes. Este valor de filtro se aplica a todas las
anotaciones cronol&oacute;gicas, no s&oacute;lo a las anotaciones cronol&oacute;gicas de servicio.</dd>
<dt>
<strong><a name="enable_correlationid_description"></a>Habilitar ID de correlaci&oacute;n</strong>
</dt>
<dd>Especifica la generaci&oacute;n de un ID de correlaci&oacute;n que se anota con cada mensaje.
<p>Puede utilizar el ID de correlaci&oacute;n para correlacionar la actividad con una petici&oacute;n de
cliente determinada o para correlacionar actividades en varios servidores de aplicaciones.</p>

</dd>
</dl>
</div>
<div>
<p>
<strong>Informaci&oacute;n relacionada</strong>
</p>
<a href="rcon_buttons.html">Botones de la consola de administraci&oacute;n</a>
<br>

<a href="rcon_scope.html">Valores de &aacute;mbito de la consola administrativa</a>
<br>

<a href="rcon_filter.html">Valores de filtro de la consola administrativa</a>
<br>

<a href="rcon_preferences.html">Valores de preferencias de la consola administrativa</a>
<br>

<a href="rcon_pageusage.html">Caracter&iacute;sticas de la p&aacute;gina de la consola administrativa</a>
<br>

</div>
</body>
</html>
